toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// Generated by the protocol buffer compiler.  DO NOT EDIT!
// source: PSocketProcess.proto

#ifndef GOOGLE_PROTOBUF_INCLUDED_PSocketProcess_2eproto
#define GOOGLE_PROTOBUF_INCLUDED_PSocketProcess_2eproto

#include <limits>
#include <string>

#include <google/protobuf/port_def.inc>
#if PROTOBUF_VERSION < 3021000
#error This file was generated by a newer version of protoc which is
#error incompatible with your Protocol Buffer headers. Please update
#error your headers.
#endif
#if 3021006 < PROTOBUF_MIN_PROTOC_VERSION
#error This file was generated by an older version of protoc which is
#error incompatible with your Protocol Buffer headers. Please
#error regenerate this file with a newer version of protoc.
#endif

#include <google/protobuf/port_undef.inc>
#include <google/protobuf/io/coded_stream.h>
#include <google/protobuf/arena.h>
#include <google/protobuf/arenastring.h>
#include <google/protobuf/generated_message_util.h>
#include <google/protobuf/metadata_lite.h>
#include <google/protobuf/message_lite.h>
#include <google/protobuf/repeated_field.h>  // IWYU pragma: export
#include <google/protobuf/extension_set.h>  // IWYU pragma: export
#include "PSocketProcess_protobuf.mozilla.net.h.pb.h"
#include "CrashReporterInitArgs.pb.h"
#include "MemoryReportTypes.pb.h"
#include "NeckoChannelParams.pb.h"
#include "PrefsTypes.pb.h"
// @@protoc_insertion_point(includes)
#include <google/protobuf/port_def.inc>
#define PROTOBUF_INTERNAL_EXPORT_PSocketProcess_2eproto
PROTOBUF_NAMESPACE_OPEN
namespace internal {
class AnyMetadata;
}  // namespace internal
PROTOBUF_NAMESPACE_CLOSE

// Internal implementation detail -- do not use these members.
struct TableStruct_PSocketProcess_2eproto {
  static const uint32_t offsets[];
};
namespace protobuf {
namespace mozilla {
namespace net {
namespace PSocketProcess {
class Msg_AccumulateChildHistograms;
struct Msg_AccumulateChildHistogramsDefaultTypeInternal;
extern Msg_AccumulateChildHistogramsDefaultTypeInternal _Msg_AccumulateChildHistograms_default_instance_;
class Msg_AccumulateChildKeyedHistograms;
struct Msg_AccumulateChildKeyedHistogramsDefaultTypeInternal;
extern Msg_AccumulateChildKeyedHistogramsDefaultTypeInternal _Msg_AccumulateChildKeyedHistograms_default_instance_;
class Msg_AddMemoryReport;
struct Msg_AddMemoryReportDefaultTypeInternal;
extern Msg_AddMemoryReportDefaultTypeInternal _Msg_AddMemoryReport_default_instance_;
class Msg_AddNetAddrOverride;
struct Msg_AddNetAddrOverrideDefaultTypeInternal;
extern Msg_AddNetAddrOverrideDefaultTypeInternal _Msg_AddNetAddrOverride_default_instance_;
class Msg_ClearNetAddrOverrides;
struct Msg_ClearNetAddrOverridesDefaultTypeInternal;
extern Msg_ClearNetAddrOverridesDefaultTypeInternal _Msg_ClearNetAddrOverrides_default_instance_;
class Msg_ClearSessionCache;
struct Msg_ClearSessionCacheDefaultTypeInternal;
extern Msg_ClearSessionCacheDefaultTypeInternal _Msg_ClearSessionCache_default_instance_;
class Msg_ExcludeHttp2OrHttp3;
struct Msg_ExcludeHttp2OrHttp3DefaultTypeInternal;
extern Msg_ExcludeHttp2OrHttp3DefaultTypeInternal _Msg_ExcludeHttp2OrHttp3_default_instance_;
class Msg_FOGData;
struct Msg_FOGDataDefaultTypeInternal;
extern Msg_FOGDataDefaultTypeInternal _Msg_FOGData_default_instance_;
class Msg_FlushFOGData;
struct Msg_FlushFOGDataDefaultTypeInternal;
extern Msg_FlushFOGDataDefaultTypeInternal _Msg_FlushFOGData_default_instance_;
class Msg_GetDNSCacheEntries;
struct Msg_GetDNSCacheEntriesDefaultTypeInternal;
extern Msg_GetDNSCacheEntriesDefaultTypeInternal _Msg_GetDNSCacheEntries_default_instance_;
class Msg_GetHttp3ConnectionStatsData;
struct Msg_GetHttp3ConnectionStatsDataDefaultTypeInternal;
extern Msg_GetHttp3ConnectionStatsDataDefaultTypeInternal _Msg_GetHttp3ConnectionStatsData_default_instance_;
class Msg_GetHttpConnectionData;
struct Msg_GetHttpConnectionDataDefaultTypeInternal;
extern Msg_GetHttpConnectionDataDefaultTypeInternal _Msg_GetHttpConnectionData_default_instance_;
class Msg_GetSocketData;
struct Msg_GetSocketDataDefaultTypeInternal;
extern Msg_GetSocketDataDefaultTypeInternal _Msg_GetSocketData_default_instance_;
class Msg_Init;
struct Msg_InitDefaultTypeInternal;
extern Msg_InitDefaultTypeInternal _Msg_Init_default_instance_;
class Msg_InitCrashReporter;
struct Msg_InitCrashReporterDefaultTypeInternal;
extern Msg_InitCrashReporterDefaultTypeInternal _Msg_InitCrashReporter_default_instance_;
class Msg_InitLinuxSandbox;
struct Msg_InitLinuxSandboxDefaultTypeInternal;
extern Msg_InitLinuxSandboxDefaultTypeInternal _Msg_InitLinuxSandbox_default_instance_;
class Msg_InitProfiler;
struct Msg_InitProfilerDefaultTypeInternal;
extern Msg_InitProfilerDefaultTypeInternal _Msg_InitProfiler_default_instance_;
class Msg_InitProxyAutoConfigChild;
struct Msg_InitProxyAutoConfigChildDefaultTypeInternal;
extern Msg_InitProxyAutoConfigChildDefaultTypeInternal _Msg_InitProxyAutoConfigChild_default_instance_;
class Msg_InitSocketBackground;
struct Msg_InitSocketBackgroundDefaultTypeInternal;
extern Msg_InitSocketBackgroundDefaultTypeInternal _Msg_InitSocketBackground_default_instance_;
class Msg_InitSocketProcessBridgeParent;
struct Msg_InitSocketProcessBridgeParentDefaultTypeInternal;
extern Msg_InitSocketProcessBridgeParentDefaultTypeInternal _Msg_InitSocketProcessBridgeParent_default_instance_;
class Msg_NotifyObserver;
struct Msg_NotifyObserverDefaultTypeInternal;
extern Msg_NotifyObserverDefaultTypeInternal _Msg_NotifyObserver_default_instance_;
class Msg_ObserveHttpActivity;
struct Msg_ObserveHttpActivityDefaultTypeInternal;
extern Msg_ObserveHttpActivityDefaultTypeInternal _Msg_ObserveHttpActivity_default_instance_;
class Msg_OnConsoleMessage;
struct Msg_OnConsoleMessageDefaultTypeInternal;
extern Msg_OnConsoleMessageDefaultTypeInternal _Msg_OnConsoleMessage_default_instance_;
class Msg_OnHttpActivityDistributorActivated;
struct Msg_OnHttpActivityDistributorActivatedDefaultTypeInternal;
extern Msg_OnHttpActivityDistributorActivatedDefaultTypeInternal _Msg_OnHttpActivityDistributorActivated_default_instance_;
class Msg_OnHttpActivityDistributorObserveConnection;
struct Msg_OnHttpActivityDistributorObserveConnectionDefaultTypeInternal;
extern Msg_OnHttpActivityDistributorObserveConnectionDefaultTypeInternal _Msg_OnHttpActivityDistributorObserveConnection_default_instance_;
class Msg_OnHttpActivityDistributorObserveProxyResponse;
struct Msg_OnHttpActivityDistributorObserveProxyResponseDefaultTypeInternal;
extern Msg_OnHttpActivityDistributorObserveProxyResponseDefaultTypeInternal _Msg_OnHttpActivityDistributorObserveProxyResponse_default_instance_;
class Msg_PAltServiceConstructor;
struct Msg_PAltServiceConstructorDefaultTypeInternal;
extern Msg_PAltServiceConstructorDefaultTypeInternal _Msg_PAltServiceConstructor_default_instance_;
class Msg_PAltSvcTransactionConstructor;
struct Msg_PAltSvcTransactionConstructorDefaultTypeInternal;
extern Msg_PAltSvcTransactionConstructorDefaultTypeInternal _Msg_PAltSvcTransactionConstructor_default_instance_;
class Msg_PDNSRequestConstructor;
struct Msg_PDNSRequestConstructorDefaultTypeInternal;
extern Msg_PDNSRequestConstructorDefaultTypeInternal _Msg_PDNSRequestConstructor_default_instance_;
class Msg_PHttpConnectionMgrConstructor;
struct Msg_PHttpConnectionMgrConstructorDefaultTypeInternal;
extern Msg_PHttpConnectionMgrConstructorDefaultTypeInternal _Msg_PHttpConnectionMgrConstructor_default_instance_;
class Msg_PHttpTransactionConstructor;
struct Msg_PHttpTransactionConstructorDefaultTypeInternal;
extern Msg_PHttpTransactionConstructorDefaultTypeInternal _Msg_PHttpTransactionConstructor_default_instance_;
class Msg_PInputChannelThrottleQueueConstructor;
struct Msg_PInputChannelThrottleQueueConstructorDefaultTypeInternal;
extern Msg_PInputChannelThrottleQueueConstructorDefaultTypeInternal _Msg_PInputChannelThrottleQueueConstructor_default_instance_;
class Msg_PNativeDNSResolverOverrideConstructor;
struct Msg_PNativeDNSResolverOverrideConstructorDefaultTypeInternal;
extern Msg_PNativeDNSResolverOverrideConstructorDefaultTypeInternal _Msg_PNativeDNSResolverOverrideConstructor_default_instance_;
class Msg_PProxyConfigLookupConstructor;
struct Msg_PProxyConfigLookupConstructorDefaultTypeInternal;
extern Msg_PProxyConfigLookupConstructorDefaultTypeInternal _Msg_PProxyConfigLookupConstructor_default_instance_;
class Msg_PTRRServiceConstructor;
struct Msg_PTRRServiceConstructorDefaultTypeInternal;
extern Msg_PTRRServiceConstructorDefaultTypeInternal _Msg_PTRRServiceConstructor_default_instance_;
class Msg_PWebrtcTCPSocketConstructor;
struct Msg_PWebrtcTCPSocketConstructorDefaultTypeInternal;
extern Msg_PWebrtcTCPSocketConstructorDefaultTypeInternal _Msg_PWebrtcTCPSocketConstructor_default_instance_;
class Msg_PreferenceUpdate;
struct Msg_PreferenceUpdateDefaultTypeInternal;
extern Msg_PreferenceUpdateDefaultTypeInternal _Msg_PreferenceUpdate_default_instance_;
class Msg_RecheckDNS;
struct Msg_RecheckDNSDefaultTypeInternal;
extern Msg_RecheckDNSDefaultTypeInternal _Msg_RecheckDNS_default_instance_;
class Msg_RecheckIPConnectivity;
struct Msg_RecheckIPConnectivityDefaultTypeInternal;
extern Msg_RecheckIPConnectivityDefaultTypeInternal _Msg_RecheckIPConnectivity_default_instance_;
class Msg_RecordChildEvents;
struct Msg_RecordChildEventsDefaultTypeInternal;
extern Msg_RecordChildEventsDefaultTypeInternal _Msg_RecordChildEvents_default_instance_;
class Msg_RecordDiscardedData;
struct Msg_RecordDiscardedDataDefaultTypeInternal;
extern Msg_RecordDiscardedDataDefaultTypeInternal _Msg_RecordDiscardedData_default_instance_;
class Msg_RequestMemoryReport;
struct Msg_RequestMemoryReportDefaultTypeInternal;
extern Msg_RequestMemoryReportDefaultTypeInternal _Msg_RequestMemoryReport_default_instance_;
class Msg_SetConnectivity;
struct Msg_SetConnectivityDefaultTypeInternal;
extern Msg_SetConnectivityDefaultTypeInternal _Msg_SetConnectivity_default_instance_;
class Msg_SetOffline;
struct Msg_SetOfflineDefaultTypeInternal;
extern Msg_SetOfflineDefaultTypeInternal _Msg_SetOffline_default_instance_;
class Msg_SocketProcessTelemetryPing;
struct Msg_SocketProcessTelemetryPingDefaultTypeInternal;
extern Msg_SocketProcessTelemetryPingDefaultTypeInternal _Msg_SocketProcessTelemetryPing_default_instance_;
class Msg_TestTriggerMetrics;
struct Msg_TestTriggerMetricsDefaultTypeInternal;
extern Msg_TestTriggerMetricsDefaultTypeInternal _Msg_TestTriggerMetrics_default_instance_;
class Msg_UpdateChildKeyedScalars;
struct Msg_UpdateChildKeyedScalarsDefaultTypeInternal;
extern Msg_UpdateChildKeyedScalarsDefaultTypeInternal _Msg_UpdateChildKeyedScalars_default_instance_;
class Msg_UpdateChildScalars;
struct Msg_UpdateChildScalarsDefaultTypeInternal;
extern Msg_UpdateChildScalarsDefaultTypeInternal _Msg_UpdateChildScalars_default_instance_;
class Msg_UpdateDeviceModelId;
struct Msg_UpdateDeviceModelIdDefaultTypeInternal;
extern Msg_UpdateDeviceModelIdDefaultTypeInternal _Msg_UpdateDeviceModelId_default_instance_;
class Reply_ClearSessionCache;
struct Reply_ClearSessionCacheDefaultTypeInternal;
extern Reply_ClearSessionCacheDefaultTypeInternal _Reply_ClearSessionCache_default_instance_;
class Reply_FlushFOGData;
struct Reply_FlushFOGDataDefaultTypeInternal;
extern Reply_FlushFOGDataDefaultTypeInternal _Reply_FlushFOGData_default_instance_;
class Reply_GetDNSCacheEntries;
struct Reply_GetDNSCacheEntriesDefaultTypeInternal;
extern Reply_GetDNSCacheEntriesDefaultTypeInternal _Reply_GetDNSCacheEntries_default_instance_;
class Reply_GetHttp3ConnectionStatsData;
struct Reply_GetHttp3ConnectionStatsDataDefaultTypeInternal;
extern Reply_GetHttp3ConnectionStatsDataDefaultTypeInternal _Reply_GetHttp3ConnectionStatsData_default_instance_;
class Reply_GetHttpConnectionData;
struct Reply_GetHttpConnectionDataDefaultTypeInternal;
extern Reply_GetHttpConnectionDataDefaultTypeInternal _Reply_GetHttpConnectionData_default_instance_;
class Reply_GetSocketData;
struct Reply_GetSocketDataDefaultTypeInternal;
extern Reply_GetSocketDataDefaultTypeInternal _Reply_GetSocketData_default_instance_;
class Reply_PAltServiceConstructor;
struct Reply_PAltServiceConstructorDefaultTypeInternal;
extern Reply_PAltServiceConstructorDefaultTypeInternal _Reply_PAltServiceConstructor_default_instance_;
class Reply_PAltSvcTransactionConstructor;
struct Reply_PAltSvcTransactionConstructorDefaultTypeInternal;
extern Reply_PAltSvcTransactionConstructorDefaultTypeInternal _Reply_PAltSvcTransactionConstructor_default_instance_;
class Reply_PDNSRequestConstructor;
struct Reply_PDNSRequestConstructorDefaultTypeInternal;
extern Reply_PDNSRequestConstructorDefaultTypeInternal _Reply_PDNSRequestConstructor_default_instance_;
class Reply_PHttpConnectionMgrConstructor;
struct Reply_PHttpConnectionMgrConstructorDefaultTypeInternal;
extern Reply_PHttpConnectionMgrConstructorDefaultTypeInternal _Reply_PHttpConnectionMgrConstructor_default_instance_;
class Reply_PHttpTransactionConstructor;
struct Reply_PHttpTransactionConstructorDefaultTypeInternal;
extern Reply_PHttpTransactionConstructorDefaultTypeInternal _Reply_PHttpTransactionConstructor_default_instance_;
class Reply_PInputChannelThrottleQueueConstructor;
struct Reply_PInputChannelThrottleQueueConstructorDefaultTypeInternal;
extern Reply_PInputChannelThrottleQueueConstructorDefaultTypeInternal _Reply_PInputChannelThrottleQueueConstructor_default_instance_;
class Reply_PNativeDNSResolverOverrideConstructor;
struct Reply_PNativeDNSResolverOverrideConstructorDefaultTypeInternal;
extern Reply_PNativeDNSResolverOverrideConstructorDefaultTypeInternal _Reply_PNativeDNSResolverOverrideConstructor_default_instance_;
class Reply_PProxyConfigLookupConstructor;
struct Reply_PProxyConfigLookupConstructorDefaultTypeInternal;
extern Reply_PProxyConfigLookupConstructorDefaultTypeInternal _Reply_PProxyConfigLookupConstructor_default_instance_;
class Reply_PTRRServiceConstructor;
struct Reply_PTRRServiceConstructorDefaultTypeInternal;
extern Reply_PTRRServiceConstructorDefaultTypeInternal _Reply_PTRRServiceConstructor_default_instance_;
class Reply_PWebrtcTCPSocketConstructor;
struct Reply_PWebrtcTCPSocketConstructorDefaultTypeInternal;
extern Reply_PWebrtcTCPSocketConstructorDefaultTypeInternal _Reply_PWebrtcTCPSocketConstructor_default_instance_;
class Reply_RequestMemoryReport;
struct Reply_RequestMemoryReportDefaultTypeInternal;
extern Reply_RequestMemoryReportDefaultTypeInternal _Reply_RequestMemoryReport_default_instance_;
class Reply_TestTriggerMetrics;
struct Reply_TestTriggerMetricsDefaultTypeInternal;
extern Reply_TestTriggerMetricsDefaultTypeInternal _Reply_TestTriggerMetrics_default_instance_;
}  // namespace PSocketProcess
}  // namespace net
}  // namespace mozilla
}  // namespace protobuf
PROTOBUF_NAMESPACE_OPEN
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_AccumulateChildHistograms* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_AccumulateChildHistograms>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_AccumulateChildKeyedHistograms* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_AccumulateChildKeyedHistograms>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_AddMemoryReport* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_AddMemoryReport>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_AddNetAddrOverride* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_AddNetAddrOverride>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_ClearNetAddrOverrides* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_ClearNetAddrOverrides>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_ClearSessionCache* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_ClearSessionCache>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_ExcludeHttp2OrHttp3* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_ExcludeHttp2OrHttp3>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_FOGData* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_FOGData>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_FlushFOGData* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_FlushFOGData>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_GetDNSCacheEntries* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_GetDNSCacheEntries>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_GetHttp3ConnectionStatsData* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_GetHttp3ConnectionStatsData>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_GetHttpConnectionData* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_GetHttpConnectionData>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_GetSocketData* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_GetSocketData>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_Init* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_Init>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_InitCrashReporter* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_InitCrashReporter>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_InitLinuxSandbox* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_InitLinuxSandbox>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_InitProfiler* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_InitProfiler>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_InitProxyAutoConfigChild* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_InitProxyAutoConfigChild>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_InitSocketBackground* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_InitSocketBackground>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_InitSocketProcessBridgeParent* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_InitSocketProcessBridgeParent>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_NotifyObserver* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_NotifyObserver>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_ObserveHttpActivity* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_ObserveHttpActivity>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_OnConsoleMessage* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_OnConsoleMessage>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_OnHttpActivityDistributorActivated* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_OnHttpActivityDistributorActivated>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_OnHttpActivityDistributorObserveConnection* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_OnHttpActivityDistributorObserveConnection>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_OnHttpActivityDistributorObserveProxyResponse* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_OnHttpActivityDistributorObserveProxyResponse>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_PAltServiceConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_PAltServiceConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_PAltSvcTransactionConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_PAltSvcTransactionConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_PDNSRequestConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_PDNSRequestConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_PHttpConnectionMgrConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_PHttpConnectionMgrConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_PHttpTransactionConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_PHttpTransactionConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_PInputChannelThrottleQueueConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_PInputChannelThrottleQueueConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_PNativeDNSResolverOverrideConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_PNativeDNSResolverOverrideConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_PProxyConfigLookupConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_PProxyConfigLookupConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_PTRRServiceConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_PTRRServiceConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_PWebrtcTCPSocketConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_PWebrtcTCPSocketConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_PreferenceUpdate* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_PreferenceUpdate>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_RecheckDNS* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_RecheckDNS>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_RecheckIPConnectivity* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_RecheckIPConnectivity>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_RecordChildEvents* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_RecordChildEvents>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_RecordDiscardedData* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_RecordDiscardedData>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_RequestMemoryReport* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_RequestMemoryReport>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_SetConnectivity* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_SetConnectivity>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_SetOffline* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_SetOffline>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_SocketProcessTelemetryPing* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_SocketProcessTelemetryPing>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_TestTriggerMetrics* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_TestTriggerMetrics>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_UpdateChildKeyedScalars* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_UpdateChildKeyedScalars>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_UpdateChildScalars* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_UpdateChildScalars>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Msg_UpdateDeviceModelId* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Msg_UpdateDeviceModelId>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_ClearSessionCache* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_ClearSessionCache>(Arena*);
