toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_FlushFOGData* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_FlushFOGData>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_GetDNSCacheEntries* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_GetDNSCacheEntries>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_GetHttp3ConnectionStatsData* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_GetHttp3ConnectionStatsData>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_GetHttpConnectionData* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_GetHttpConnectionData>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_GetSocketData* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_GetSocketData>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_PAltServiceConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_PAltServiceConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_PAltSvcTransactionConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_PAltSvcTransactionConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_PDNSRequestConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_PDNSRequestConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_PHttpConnectionMgrConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_PHttpConnectionMgrConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_PHttpTransactionConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_PHttpTransactionConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_PInputChannelThrottleQueueConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_PInputChannelThrottleQueueConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_PNativeDNSResolverOverrideConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_PNativeDNSResolverOverrideConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_PProxyConfigLookupConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_PProxyConfigLookupConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_PTRRServiceConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_PTRRServiceConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_PWebrtcTCPSocketConstructor* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_PWebrtcTCPSocketConstructor>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_RequestMemoryReport* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_RequestMemoryReport>(Arena*);
template<> ::protobuf::mozilla::net::PSocketProcess::Reply_TestTriggerMetrics* Arena::CreateMaybeMessage<::protobuf::mozilla::net::PSocketProcess::Reply_TestTriggerMetrics>(Arena*);
PROTOBUF_NAMESPACE_CLOSE
namespace protobuf {
namespace mozilla {
namespace net {
namespace PSocketProcess {

// ===================================================================

class Msg_InitCrashReporter final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_InitCrashReporter) */ {
 public:
  inline Msg_InitCrashReporter() : Msg_InitCrashReporter(nullptr) {}
  ~Msg_InitCrashReporter() override;
  explicit PROTOBUF_CONSTEXPR Msg_InitCrashReporter(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_InitCrashReporter(const Msg_InitCrashReporter& from);
  Msg_InitCrashReporter(Msg_InitCrashReporter&& from) noexcept
    : Msg_InitCrashReporter() {
    *this = ::std::move(from);
  }

  inline Msg_InitCrashReporter& operator=(const Msg_InitCrashReporter& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_InitCrashReporter& operator=(Msg_InitCrashReporter&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_InitCrashReporter& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_InitCrashReporter* internal_default_instance() {
    return reinterpret_cast<const Msg_InitCrashReporter*>(
               &_Msg_InitCrashReporter_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    0;

  friend void swap(Msg_InitCrashReporter& a, Msg_InitCrashReporter& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_InitCrashReporter* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_InitCrashReporter* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_InitCrashReporter* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_InitCrashReporter>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_InitCrashReporter& from);
  void MergeFrom(const Msg_InitCrashReporter& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

