toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_InitCrashReporter* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_InitCrashReporter";
  }
  protected:
  explicit Msg_InitCrashReporter(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAAInitArgsFieldNumber = 1,
  };
  // required .protobuf.CrashReporter.CrashReporterInitArgs a_aInitArgs = 1;
  bool has_a_ainitargs() const;
  private:
  bool _internal_has_a_ainitargs() const;
  public:
  void clear_a_ainitargs();
  const ::protobuf::CrashReporter::CrashReporterInitArgs& a_ainitargs() const;
  PROTOBUF_NODISCARD ::protobuf::CrashReporter::CrashReporterInitArgs* release_a_ainitargs();
  ::protobuf::CrashReporter::CrashReporterInitArgs* mutable_a_ainitargs();
  void set_allocated_a_ainitargs(::protobuf::CrashReporter::CrashReporterInitArgs* a_ainitargs);
  private:
  const ::protobuf::CrashReporter::CrashReporterInitArgs& _internal_a_ainitargs() const;
  ::protobuf::CrashReporter::CrashReporterInitArgs* _internal_mutable_a_ainitargs();
  public:
  void unsafe_arena_set_allocated_a_ainitargs(
      ::protobuf::CrashReporter::CrashReporterInitArgs* a_ainitargs);
  ::protobuf::CrashReporter::CrashReporterInitArgs* unsafe_arena_release_a_ainitargs();

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_InitCrashReporter)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::protobuf::CrashReporter::CrashReporterInitArgs* a_ainitargs_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_AddMemoryReport final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_AddMemoryReport) */ {
 public:
  inline Msg_AddMemoryReport() : Msg_AddMemoryReport(nullptr) {}
  ~Msg_AddMemoryReport() override;
  explicit PROTOBUF_CONSTEXPR Msg_AddMemoryReport(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_AddMemoryReport(const Msg_AddMemoryReport& from);
  Msg_AddMemoryReport(Msg_AddMemoryReport&& from) noexcept
    : Msg_AddMemoryReport() {
    *this = ::std::move(from);
  }

  inline Msg_AddMemoryReport& operator=(const Msg_AddMemoryReport& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_AddMemoryReport& operator=(Msg_AddMemoryReport&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_AddMemoryReport& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_AddMemoryReport* internal_default_instance() {
    return reinterpret_cast<const Msg_AddMemoryReport*>(
               &_Msg_AddMemoryReport_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    1;

  friend void swap(Msg_AddMemoryReport& a, Msg_AddMemoryReport& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_AddMemoryReport* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_AddMemoryReport* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_AddMemoryReport* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_AddMemoryReport>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_AddMemoryReport& from);
  void MergeFrom(const Msg_AddMemoryReport& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_AddMemoryReport* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_AddMemoryReport";
  }
  protected:
  explicit Msg_AddMemoryReport(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

