toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAAReportFieldNumber = 1,
  };
  // required .protobuf.mozilla.dom.MemoryReport a_aReport = 1;
  bool has_a_areport() const;
  private:
  bool _internal_has_a_areport() const;
  public:
  void clear_a_areport();
  const ::protobuf::mozilla::dom::MemoryReport& a_areport() const;
  PROTOBUF_NODISCARD ::protobuf::mozilla::dom::MemoryReport* release_a_areport();
  ::protobuf::mozilla::dom::MemoryReport* mutable_a_areport();
  void set_allocated_a_areport(::protobuf::mozilla::dom::MemoryReport* a_areport);
  private:
  const ::protobuf::mozilla::dom::MemoryReport& _internal_a_areport() const;
  ::protobuf::mozilla::dom::MemoryReport* _internal_mutable_a_areport();
  public:
  void unsafe_arena_set_allocated_a_areport(
      ::protobuf::mozilla::dom::MemoryReport* a_areport);
  ::protobuf::mozilla::dom::MemoryReport* unsafe_arena_release_a_areport();

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_AddMemoryReport)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::protobuf::mozilla::dom::MemoryReport* a_areport_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_AccumulateChildHistograms final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms) */ {
 public:
  inline Msg_AccumulateChildHistograms() : Msg_AccumulateChildHistograms(nullptr) {}
  ~Msg_AccumulateChildHistograms() override;
  explicit PROTOBUF_CONSTEXPR Msg_AccumulateChildHistograms(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_AccumulateChildHistograms(const Msg_AccumulateChildHistograms& from);
  Msg_AccumulateChildHistograms(Msg_AccumulateChildHistograms&& from) noexcept
    : Msg_AccumulateChildHistograms() {
    *this = ::std::move(from);
  }

  inline Msg_AccumulateChildHistograms& operator=(const Msg_AccumulateChildHistograms& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_AccumulateChildHistograms& operator=(Msg_AccumulateChildHistograms&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_AccumulateChildHistograms& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_AccumulateChildHistograms* internal_default_instance() {
    return reinterpret_cast<const Msg_AccumulateChildHistograms*>(
               &_Msg_AccumulateChildHistograms_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    2;

  friend void swap(Msg_AccumulateChildHistograms& a, Msg_AccumulateChildHistograms& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_AccumulateChildHistograms* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_AccumulateChildHistograms* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_AccumulateChildHistograms* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_AccumulateChildHistograms>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_AccumulateChildHistograms& from);
  void MergeFrom(const Msg_AccumulateChildHistograms& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_AccumulateChildHistograms* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms";
  }
  protected:
  explicit Msg_AccumulateChildHistograms(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

