toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  enum : int {
    kAAccumulationsFieldNumber = 1,
  };
  // repeated bytes a_accumulations = 1;
  int a_accumulations_size() const;
  private:
  int _internal_a_accumulations_size() const;
  public:
  void clear_a_accumulations();
  const std::string& a_accumulations(int index) const;
  std::string* mutable_a_accumulations(int index);
  void set_a_accumulations(int index, const std::string& value);
  void set_a_accumulations(int index, std::string&& value);
  void set_a_accumulations(int index, const char* value);
  void set_a_accumulations(int index, const void* value, size_t size);
  std::string* add_a_accumulations();
  void add_a_accumulations(const std::string& value);
  void add_a_accumulations(std::string&& value);
  void add_a_accumulations(const char* value);
  void add_a_accumulations(const void* value, size_t size);
  const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>& a_accumulations() const;
  ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>* mutable_a_accumulations();
  private:
  const std::string& _internal_a_accumulations(int index) const;
  std::string* _internal_add_a_accumulations();
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string> a_accumulations_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_AccumulateChildKeyedHistograms final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms) */ {
 public:
  inline Msg_AccumulateChildKeyedHistograms() : Msg_AccumulateChildKeyedHistograms(nullptr) {}
  ~Msg_AccumulateChildKeyedHistograms() override;
  explicit PROTOBUF_CONSTEXPR Msg_AccumulateChildKeyedHistograms(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_AccumulateChildKeyedHistograms(const Msg_AccumulateChildKeyedHistograms& from);
  Msg_AccumulateChildKeyedHistograms(Msg_AccumulateChildKeyedHistograms&& from) noexcept
    : Msg_AccumulateChildKeyedHistograms() {
    *this = ::std::move(from);
  }

  inline Msg_AccumulateChildKeyedHistograms& operator=(const Msg_AccumulateChildKeyedHistograms& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_AccumulateChildKeyedHistograms& operator=(Msg_AccumulateChildKeyedHistograms&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_AccumulateChildKeyedHistograms& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_AccumulateChildKeyedHistograms* internal_default_instance() {
    return reinterpret_cast<const Msg_AccumulateChildKeyedHistograms*>(
               &_Msg_AccumulateChildKeyedHistograms_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    3;

  friend void swap(Msg_AccumulateChildKeyedHistograms& a, Msg_AccumulateChildKeyedHistograms& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_AccumulateChildKeyedHistograms* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_AccumulateChildKeyedHistograms* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_AccumulateChildKeyedHistograms* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_AccumulateChildKeyedHistograms>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_AccumulateChildKeyedHistograms& from);
  void MergeFrom(const Msg_AccumulateChildKeyedHistograms& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_AccumulateChildKeyedHistograms* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms";
  }
  protected:
  explicit Msg_AccumulateChildKeyedHistograms(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

