toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
class Msg_RecordChildEvents final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents) */ {
 public:
  inline Msg_RecordChildEvents() : Msg_RecordChildEvents(nullptr) {}
  ~Msg_RecordChildEvents() override;
  explicit PROTOBUF_CONSTEXPR Msg_RecordChildEvents(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_RecordChildEvents(const Msg_RecordChildEvents& from);
  Msg_RecordChildEvents(Msg_RecordChildEvents&& from) noexcept
    : Msg_RecordChildEvents() {
    *this = ::std::move(from);
  }

  inline Msg_RecordChildEvents& operator=(const Msg_RecordChildEvents& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_RecordChildEvents& operator=(Msg_RecordChildEvents&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_RecordChildEvents& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_RecordChildEvents* internal_default_instance() {
    return reinterpret_cast<const Msg_RecordChildEvents*>(
               &_Msg_RecordChildEvents_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    6;

  friend void swap(Msg_RecordChildEvents& a, Msg_RecordChildEvents& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_RecordChildEvents* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_RecordChildEvents* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_RecordChildEvents* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_RecordChildEvents>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_RecordChildEvents& from);
  void MergeFrom(const Msg_RecordChildEvents& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_RecordChildEvents* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents";
  }
  protected:
  explicit Msg_RecordChildEvents(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAEventsFieldNumber = 1,
  };
  // repeated bytes a_events = 1;
  int a_events_size() const;
  private:
  int _internal_a_events_size() const;
  public:
  void clear_a_events();
  const std::string& a_events(int index) const;
  std::string* mutable_a_events(int index);
  void set_a_events(int index, const std::string& value);
  void set_a_events(int index, std::string&& value);
  void set_a_events(int index, const char* value);
  void set_a_events(int index, const void* value, size_t size);
  std::string* add_a_events();
  void add_a_events(const std::string& value);
  void add_a_events(std::string&& value);
  void add_a_events(const char* value);
  void add_a_events(const void* value, size_t size);
  const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>& a_events() const;
  ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>* mutable_a_events();
  private:
  const std::string& _internal_a_events(int index) const;
  std::string* _internal_add_a_events();
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string> a_events_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_RecordDiscardedData final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_RecordDiscardedData) */ {
 public:
  inline Msg_RecordDiscardedData() : Msg_RecordDiscardedData(nullptr) {}
  ~Msg_RecordDiscardedData() override;
  explicit PROTOBUF_CONSTEXPR Msg_RecordDiscardedData(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_RecordDiscardedData(const Msg_RecordDiscardedData& from);
  Msg_RecordDiscardedData(Msg_RecordDiscardedData&& from) noexcept
    : Msg_RecordDiscardedData() {
    *this = ::std::move(from);
  }

  inline Msg_RecordDiscardedData& operator=(const Msg_RecordDiscardedData& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_RecordDiscardedData& operator=(Msg_RecordDiscardedData&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_RecordDiscardedData& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_RecordDiscardedData* internal_default_instance() {
    return reinterpret_cast<const Msg_RecordDiscardedData*>(
               &_Msg_RecordDiscardedData_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    7;

  friend void swap(Msg_RecordDiscardedData& a, Msg_RecordDiscardedData& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_RecordDiscardedData* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_RecordDiscardedData* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

