toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_PWebrtcTCPSocketConstructor* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_PWebrtcTCPSocketConstructor";
  }
  protected:
  explicit Msg_PWebrtcTCPSocketConstructor(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kATabIdFieldNumber = 1,
  };
  // optional bytes a_tabId = 1;
  bool has_a_tabid() const;
  private:
  bool _internal_has_a_tabid() const;
  public:
  void clear_a_tabid();
  const std::string& a_tabid() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_tabid(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_tabid();
  PROTOBUF_NODISCARD std::string* release_a_tabid();
  void set_allocated_a_tabid(std::string* a_tabid);
  private:
  const std::string& _internal_a_tabid() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_tabid(const std::string& value);
  std::string* _internal_mutable_a_tabid();
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_PWebrtcTCPSocketConstructor)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_tabid_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Reply_PWebrtcTCPSocketConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Reply_PWebrtcTCPSocketConstructor) */ {
 public:
  inline Reply_PWebrtcTCPSocketConstructor() : Reply_PWebrtcTCPSocketConstructor(nullptr) {}
  ~Reply_PWebrtcTCPSocketConstructor() override;
  explicit PROTOBUF_CONSTEXPR Reply_PWebrtcTCPSocketConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Reply_PWebrtcTCPSocketConstructor(const Reply_PWebrtcTCPSocketConstructor& from);
  Reply_PWebrtcTCPSocketConstructor(Reply_PWebrtcTCPSocketConstructor&& from) noexcept
    : Reply_PWebrtcTCPSocketConstructor() {
    *this = ::std::move(from);
  }

  inline Reply_PWebrtcTCPSocketConstructor& operator=(const Reply_PWebrtcTCPSocketConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Reply_PWebrtcTCPSocketConstructor& operator=(Reply_PWebrtcTCPSocketConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Reply_PWebrtcTCPSocketConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Reply_PWebrtcTCPSocketConstructor* internal_default_instance() {
    return reinterpret_cast<const Reply_PWebrtcTCPSocketConstructor*>(
               &_Reply_PWebrtcTCPSocketConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    9;

  friend void swap(Reply_PWebrtcTCPSocketConstructor& a, Reply_PWebrtcTCPSocketConstructor& b) {
    a.Swap(&b);
  }
  inline void Swap(Reply_PWebrtcTCPSocketConstructor* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Reply_PWebrtcTCPSocketConstructor* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Reply_PWebrtcTCPSocketConstructor* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Reply_PWebrtcTCPSocketConstructor>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Reply_PWebrtcTCPSocketConstructor& from);
  void MergeFrom(const Reply_PWebrtcTCPSocketConstructor& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Reply_PWebrtcTCPSocketConstructor* other);

