toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Reply_PWebrtcTCPSocketConstructor";
  }
  protected:
  explicit Reply_PWebrtcTCPSocketConstructor(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Reply_PWebrtcTCPSocketConstructor)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_ObserveHttpActivity final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity) */ {
 public:
  inline Msg_ObserveHttpActivity() : Msg_ObserveHttpActivity(nullptr) {}
  ~Msg_ObserveHttpActivity() override;
  explicit PROTOBUF_CONSTEXPR Msg_ObserveHttpActivity(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_ObserveHttpActivity(const Msg_ObserveHttpActivity& from);
  Msg_ObserveHttpActivity(Msg_ObserveHttpActivity&& from) noexcept
    : Msg_ObserveHttpActivity() {
    *this = ::std::move(from);
  }

  inline Msg_ObserveHttpActivity& operator=(const Msg_ObserveHttpActivity& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_ObserveHttpActivity& operator=(Msg_ObserveHttpActivity&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_ObserveHttpActivity& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_ObserveHttpActivity* internal_default_instance() {
    return reinterpret_cast<const Msg_ObserveHttpActivity*>(
               &_Msg_ObserveHttpActivity_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    10;

  friend void swap(Msg_ObserveHttpActivity& a, Msg_ObserveHttpActivity& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_ObserveHttpActivity* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_ObserveHttpActivity* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_ObserveHttpActivity* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_ObserveHttpActivity>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_ObserveHttpActivity& from);
  void MergeFrom(const Msg_ObserveHttpActivity& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_ObserveHttpActivity* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity";
  }
  protected:
  explicit Msg_ObserveHttpActivity(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAATimestampFieldNumber = 4,
    kAAExtraStringDataFieldNumber = 6,
    kAAActivityArgsFieldNumber = 1,
    kAAActivityTypeFieldNumber = 2,
    kAAActivitySubtypeFieldNumber = 3,
    kAAExtraSizeDataFieldNumber = 5,
  };
  // required bytes a_aTimestamp = 4;
  bool has_a_atimestamp() const;
  private:
  bool _internal_has_a_atimestamp() const;
  public:
  void clear_a_atimestamp();
  const std::string& a_atimestamp() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_atimestamp(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_atimestamp();
  PROTOBUF_NODISCARD std::string* release_a_atimestamp();
  void set_allocated_a_atimestamp(std::string* a_atimestamp);
  private:
  const std::string& _internal_a_atimestamp() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_atimestamp(const std::string& value);
  std::string* _internal_mutable_a_atimestamp();
  public:

