toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  // required string a_aExtraStringData = 6;
  bool has_a_aextrastringdata() const;
  private:
  bool _internal_has_a_aextrastringdata() const;
  public:
  void clear_a_aextrastringdata();
  const std::string& a_aextrastringdata() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_aextrastringdata(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_aextrastringdata();
  PROTOBUF_NODISCARD std::string* release_a_aextrastringdata();
  void set_allocated_a_aextrastringdata(std::string* a_aextrastringdata);
  private:
  const std::string& _internal_a_aextrastringdata() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_aextrastringdata(const std::string& value);
  std::string* _internal_mutable_a_aextrastringdata();
  public:

  // required .protobuf.mozilla.net.HttpActivityArgs a_aActivityArgs = 1;
  bool has_a_aactivityargs() const;
  private:
  bool _internal_has_a_aactivityargs() const;
  public:
  void clear_a_aactivityargs();
  const ::protobuf::mozilla::net::HttpActivityArgs& a_aactivityargs() const;
  PROTOBUF_NODISCARD ::protobuf::mozilla::net::HttpActivityArgs* release_a_aactivityargs();
  ::protobuf::mozilla::net::HttpActivityArgs* mutable_a_aactivityargs();
  void set_allocated_a_aactivityargs(::protobuf::mozilla::net::HttpActivityArgs* a_aactivityargs);
  private:
  const ::protobuf::mozilla::net::HttpActivityArgs& _internal_a_aactivityargs() const;
  ::protobuf::mozilla::net::HttpActivityArgs* _internal_mutable_a_aactivityargs();
  public:
  void unsafe_arena_set_allocated_a_aactivityargs(
      ::protobuf::mozilla::net::HttpActivityArgs* a_aactivityargs);
  ::protobuf::mozilla::net::HttpActivityArgs* unsafe_arena_release_a_aactivityargs();

  // required uint32 a_aActivityType = 2;
  bool has_a_aactivitytype() const;
  private:
  bool _internal_has_a_aactivitytype() const;
  public:
  void clear_a_aactivitytype();
  uint32_t a_aactivitytype() const;
  void set_a_aactivitytype(uint32_t value);
  private:
  uint32_t _internal_a_aactivitytype() const;
  void _internal_set_a_aactivitytype(uint32_t value);
  public:

  // required uint32 a_aActivitySubtype = 3;
  bool has_a_aactivitysubtype() const;
  private:
  bool _internal_has_a_aactivitysubtype() const;
  public:
  void clear_a_aactivitysubtype();
  uint32_t a_aactivitysubtype() const;
  void set_a_aactivitysubtype(uint32_t value);
  private:
  uint32_t _internal_a_aactivitysubtype() const;
  void _internal_set_a_aactivitysubtype(uint32_t value);
  public:

  // required uint64 a_aExtraSizeData = 5;
  bool has_a_aextrasizedata() const;
  private:
  bool _internal_has_a_aextrasizedata() const;
  public:
  void clear_a_aextrasizedata();
  uint64_t a_aextrasizedata() const;
  void set_a_aextrasizedata(uint64_t value);
  private:
  uint64_t _internal_a_aextrasizedata() const;
  void _internal_set_a_aextrasizedata(uint64_t value);
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity)
 private:
  class _Internal;

  // helper for ByteSizeLong()
  size_t RequiredFieldsByteSizeFallback() const;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_atimestamp_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_aextrastringdata_;
    ::protobuf::mozilla::net::HttpActivityArgs* a_aactivityargs_;
    uint32_t a_aactivitytype_;
    uint32_t a_aactivitysubtype_;
    uint64_t a_aextrasizedata_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_InitSocketBackground final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketBackground) */ {
 public:
  inline Msg_InitSocketBackground() : Msg_InitSocketBackground(nullptr) {}
  ~Msg_InitSocketBackground() override;
  explicit PROTOBUF_CONSTEXPR Msg_InitSocketBackground(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_InitSocketBackground(const Msg_InitSocketBackground& from);
  Msg_InitSocketBackground(Msg_InitSocketBackground&& from) noexcept
    : Msg_InitSocketBackground() {
    *this = ::std::move(from);
  }

  inline Msg_InitSocketBackground& operator=(const Msg_InitSocketBackground& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_InitSocketBackground& operator=(Msg_InitSocketBackground&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_InitSocketBackground& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_InitSocketBackground* internal_default_instance() {
    return reinterpret_cast<const Msg_InitSocketBackground*>(
               &_Msg_InitSocketBackground_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    11;

  friend void swap(Msg_InitSocketBackground& a, Msg_InitSocketBackground& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_InitSocketBackground* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_InitSocketBackground* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_InitSocketBackground* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_InitSocketBackground>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_InitSocketBackground& from);
  void MergeFrom(const Msg_InitSocketBackground& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

