toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_PAltServiceConstructor)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Reply_PAltServiceConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Reply_PAltServiceConstructor) */ {
 public:
  inline Reply_PAltServiceConstructor() : Reply_PAltServiceConstructor(nullptr) {}
  ~Reply_PAltServiceConstructor() override;
  explicit PROTOBUF_CONSTEXPR Reply_PAltServiceConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Reply_PAltServiceConstructor(const Reply_PAltServiceConstructor& from);
  Reply_PAltServiceConstructor(Reply_PAltServiceConstructor&& from) noexcept
    : Reply_PAltServiceConstructor() {
    *this = ::std::move(from);
  }

  inline Reply_PAltServiceConstructor& operator=(const Reply_PAltServiceConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Reply_PAltServiceConstructor& operator=(Reply_PAltServiceConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Reply_PAltServiceConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Reply_PAltServiceConstructor* internal_default_instance() {
    return reinterpret_cast<const Reply_PAltServiceConstructor*>(
               &_Reply_PAltServiceConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    13;

  friend void swap(Reply_PAltServiceConstructor& a, Reply_PAltServiceConstructor& b) {
    a.Swap(&b);
  }
  inline void Swap(Reply_PAltServiceConstructor* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Reply_PAltServiceConstructor* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Reply_PAltServiceConstructor* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Reply_PAltServiceConstructor>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Reply_PAltServiceConstructor& from);
  void MergeFrom(const Reply_PAltServiceConstructor& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Reply_PAltServiceConstructor* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Reply_PAltServiceConstructor";
  }
  protected:
  explicit Reply_PAltServiceConstructor(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Reply_PAltServiceConstructor)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_PProxyConfigLookupConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_PProxyConfigLookupConstructor) */ {
 public:
  inline Msg_PProxyConfigLookupConstructor() : Msg_PProxyConfigLookupConstructor(nullptr) {}
  ~Msg_PProxyConfigLookupConstructor() override;
  explicit PROTOBUF_CONSTEXPR Msg_PProxyConfigLookupConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_PProxyConfigLookupConstructor(const Msg_PProxyConfigLookupConstructor& from);
  Msg_PProxyConfigLookupConstructor(Msg_PProxyConfigLookupConstructor&& from) noexcept
    : Msg_PProxyConfigLookupConstructor() {
    *this = ::std::move(from);
  }

  inline Msg_PProxyConfigLookupConstructor& operator=(const Msg_PProxyConfigLookupConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_PProxyConfigLookupConstructor& operator=(Msg_PProxyConfigLookupConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_PProxyConfigLookupConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_PProxyConfigLookupConstructor* internal_default_instance() {
    return reinterpret_cast<const Msg_PProxyConfigLookupConstructor*>(
               &_Msg_PProxyConfigLookupConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    14;

