toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  friend void swap(Msg_PProxyConfigLookupConstructor& a, Msg_PProxyConfigLookupConstructor& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_PProxyConfigLookupConstructor* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_PProxyConfigLookupConstructor* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_PProxyConfigLookupConstructor* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_PProxyConfigLookupConstructor>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_PProxyConfigLookupConstructor& from);
  void MergeFrom(const Msg_PProxyConfigLookupConstructor& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_PProxyConfigLookupConstructor* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_PProxyConfigLookupConstructor";
  }
  protected:
  explicit Msg_PProxyConfigLookupConstructor(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAAUriFieldNumber = 1,
    kAAFlagsFieldNumber = 2,
  };
  // required bytes a_aUri = 1;
  bool has_a_auri() const;
  private:
  bool _internal_has_a_auri() const;
  public:
  void clear_a_auri();
  const std::string& a_auri() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_auri(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_auri();
  PROTOBUF_NODISCARD std::string* release_a_auri();
  void set_allocated_a_auri(std::string* a_auri);
  private:
  const std::string& _internal_a_auri() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_auri(const std::string& value);
  std::string* _internal_mutable_a_auri();
  public:

  // required uint32 a_aFlags = 2;
  bool has_a_aflags() const;
  private:
  bool _internal_has_a_aflags() const;
  public:
  void clear_a_aflags();
  uint32_t a_aflags() const;
  void set_a_aflags(uint32_t value);
  private:
  uint32_t _internal_a_aflags() const;
  void _internal_set_a_aflags(uint32_t value);
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_PProxyConfigLookupConstructor)
 private:
  class _Internal;

  // helper for ByteSizeLong()
  size_t RequiredFieldsByteSizeFallback() const;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_auri_;
    uint32_t a_aflags_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Reply_PProxyConfigLookupConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Reply_PProxyConfigLookupConstructor) */ {
 public:
  inline Reply_PProxyConfigLookupConstructor() : Reply_PProxyConfigLookupConstructor(nullptr) {}
  ~Reply_PProxyConfigLookupConstructor() override;
  explicit PROTOBUF_CONSTEXPR Reply_PProxyConfigLookupConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Reply_PProxyConfigLookupConstructor(const Reply_PProxyConfigLookupConstructor& from);
  Reply_PProxyConfigLookupConstructor(Reply_PProxyConfigLookupConstructor&& from) noexcept
    : Reply_PProxyConfigLookupConstructor() {
    *this = ::std::move(from);
  }

  inline Reply_PProxyConfigLookupConstructor& operator=(const Reply_PProxyConfigLookupConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Reply_PProxyConfigLookupConstructor& operator=(Reply_PProxyConfigLookupConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Reply_PProxyConfigLookupConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Reply_PProxyConfigLookupConstructor* internal_default_instance() {
    return reinterpret_cast<const Reply_PProxyConfigLookupConstructor*>(
               &_Reply_PProxyConfigLookupConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    15;

