toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_ExcludeHttp2OrHttp3* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_ExcludeHttp2OrHttp3";
  }
  protected:
  explicit Msg_ExcludeHttp2OrHttp3(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAAArgsFieldNumber = 1,
  };
  // required .protobuf.mozilla.net.HttpConnectionInfoCloneArgs a_aArgs = 1;
  bool has_a_aargs() const;
  private:
  bool _internal_has_a_aargs() const;
  public:
  void clear_a_aargs();
  const ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs& a_aargs() const;
  PROTOBUF_NODISCARD ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* release_a_aargs();
  ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* mutable_a_aargs();
  void set_allocated_a_aargs(::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* a_aargs);
  private:
  const ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs& _internal_a_aargs() const;
  ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* _internal_mutable_a_aargs();
  public:
  void unsafe_arena_set_allocated_a_aargs(
      ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* a_aargs);
  ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* unsafe_arena_release_a_aargs();

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_ExcludeHttp2OrHttp3)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* a_aargs_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_OnConsoleMessage final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_OnConsoleMessage) */ {
 public:
  inline Msg_OnConsoleMessage() : Msg_OnConsoleMessage(nullptr) {}
  ~Msg_OnConsoleMessage() override;
  explicit PROTOBUF_CONSTEXPR Msg_OnConsoleMessage(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_OnConsoleMessage(const Msg_OnConsoleMessage& from);
  Msg_OnConsoleMessage(Msg_OnConsoleMessage&& from) noexcept
    : Msg_OnConsoleMessage() {
    *this = ::std::move(from);
  }

  inline Msg_OnConsoleMessage& operator=(const Msg_OnConsoleMessage& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_OnConsoleMessage& operator=(Msg_OnConsoleMessage&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_OnConsoleMessage& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_OnConsoleMessage* internal_default_instance() {
    return reinterpret_cast<const Msg_OnConsoleMessage*>(
               &_Msg_OnConsoleMessage_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    17;

  friend void swap(Msg_OnConsoleMessage& a, Msg_OnConsoleMessage& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_OnConsoleMessage* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_OnConsoleMessage* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_OnConsoleMessage* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_OnConsoleMessage>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_OnConsoleMessage& from);
  void MergeFrom(const Msg_OnConsoleMessage& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_OnConsoleMessage* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_OnConsoleMessage";
  }
  protected:
  explicit Msg_OnConsoleMessage(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

