toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAAMessageFieldNumber = 1,
  };
  // required string a_aMessage = 1;
  bool has_a_amessage() const;
  private:
  bool _internal_has_a_amessage() const;
  public:
  void clear_a_amessage();
  const std::string& a_amessage() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_amessage(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_amessage();
  PROTOBUF_NODISCARD std::string* release_a_amessage();
  void set_allocated_a_amessage(std::string* a_amessage);
  private:
  const std::string& _internal_a_amessage() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_amessage(const std::string& value);
  std::string* _internal_mutable_a_amessage();
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_OnConsoleMessage)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_amessage_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_FOGData final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_FOGData) */ {
 public:
  inline Msg_FOGData() : Msg_FOGData(nullptr) {}
  ~Msg_FOGData() override;
  explicit PROTOBUF_CONSTEXPR Msg_FOGData(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_FOGData(const Msg_FOGData& from);
  Msg_FOGData(Msg_FOGData&& from) noexcept
    : Msg_FOGData() {
    *this = ::std::move(from);
  }

  inline Msg_FOGData& operator=(const Msg_FOGData& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_FOGData& operator=(Msg_FOGData&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_FOGData& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_FOGData* internal_default_instance() {
    return reinterpret_cast<const Msg_FOGData*>(
               &_Msg_FOGData_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    18;

  friend void swap(Msg_FOGData& a, Msg_FOGData& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_FOGData* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_FOGData* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_FOGData* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_FOGData>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_FOGData& from);
  void MergeFrom(const Msg_FOGData& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_FOGData* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_FOGData";
  }
  protected:
  explicit Msg_FOGData(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kABufFieldNumber = 1,
  };
  // required bytes a_buf = 1;
  bool has_a_buf() const;
  private:
  bool _internal_has_a_buf() const;
  public:
  void clear_a_buf();
  const std::string& a_buf() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_buf(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_buf();
  PROTOBUF_NODISCARD std::string* release_a_buf();
  void set_allocated_a_buf(std::string* a_buf);
  private:
  const std::string& _internal_a_buf() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_buf(const std::string& value);
  std::string* _internal_mutable_a_buf();
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_FOGData)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_buf_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_Init final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_Init) */ {
 public:
  inline Msg_Init() : Msg_Init(nullptr) {}
  ~Msg_Init() override;
  explicit PROTOBUF_CONSTEXPR Msg_Init(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_Init(const Msg_Init& from);
  Msg_Init(Msg_Init&& from) noexcept
    : Msg_Init() {
    *this = ::std::move(from);
  }

  inline Msg_Init& operator=(const Msg_Init& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_Init& operator=(Msg_Init&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_Init& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_Init* internal_default_instance() {
    return reinterpret_cast<const Msg_Init*>(
               &_Msg_Init_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    19;

