toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  friend void swap(Msg_Init& a, Msg_Init& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_Init* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_Init* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_Init* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_Init>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_Init& from);
  void MergeFrom(const Msg_Init& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_Init* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_Init";
  }
  protected:
  explicit Msg_Init(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAAAttributesFieldNumber = 1,
  };
  // required .protobuf.mozilla.net.SocketPorcessInitAttributes a_aAttributes = 1;
  bool has_a_aattributes() const;
  private:
  bool _internal_has_a_aattributes() const;
  public:
  void clear_a_aattributes();
  const ::protobuf::mozilla::net::SocketPorcessInitAttributes& a_aattributes() const;
  PROTOBUF_NODISCARD ::protobuf::mozilla::net::SocketPorcessInitAttributes* release_a_aattributes();
  ::protobuf::mozilla::net::SocketPorcessInitAttributes* mutable_a_aattributes();
  void set_allocated_a_aattributes(::protobuf::mozilla::net::SocketPorcessInitAttributes* a_aattributes);
  private:
  const ::protobuf::mozilla::net::SocketPorcessInitAttributes& _internal_a_aattributes() const;
  ::protobuf::mozilla::net::SocketPorcessInitAttributes* _internal_mutable_a_aattributes();
  public:
  void unsafe_arena_set_allocated_a_aattributes(
      ::protobuf::mozilla::net::SocketPorcessInitAttributes* a_aattributes);
  ::protobuf::mozilla::net::SocketPorcessInitAttributes* unsafe_arena_release_a_aattributes();

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_Init)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::protobuf::mozilla::net::SocketPorcessInitAttributes* a_aattributes_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_PreferenceUpdate final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_PreferenceUpdate) */ {
 public:
  inline Msg_PreferenceUpdate() : Msg_PreferenceUpdate(nullptr) {}
  ~Msg_PreferenceUpdate() override;
  explicit PROTOBUF_CONSTEXPR Msg_PreferenceUpdate(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_PreferenceUpdate(const Msg_PreferenceUpdate& from);
  Msg_PreferenceUpdate(Msg_PreferenceUpdate&& from) noexcept
    : Msg_PreferenceUpdate() {
    *this = ::std::move(from);
  }

  inline Msg_PreferenceUpdate& operator=(const Msg_PreferenceUpdate& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_PreferenceUpdate& operator=(Msg_PreferenceUpdate&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_PreferenceUpdate& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_PreferenceUpdate* internal_default_instance() {
    return reinterpret_cast<const Msg_PreferenceUpdate*>(
               &_Msg_PreferenceUpdate_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    20;

  friend void swap(Msg_PreferenceUpdate& a, Msg_PreferenceUpdate& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_PreferenceUpdate* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_PreferenceUpdate* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_PreferenceUpdate* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_PreferenceUpdate>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_PreferenceUpdate& from);
  void MergeFrom(const Msg_PreferenceUpdate& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

