toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_PreferenceUpdate* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_PreferenceUpdate";
  }
  protected:
  explicit Msg_PreferenceUpdate(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAPrefFieldNumber = 1,
  };
  // required .protobuf.mozilla.dom.Pref a_pref = 1;
  bool has_a_pref() const;
  private:
  bool _internal_has_a_pref() const;
  public:
  void clear_a_pref();
  const ::protobuf::mozilla::dom::Pref& a_pref() const;
  PROTOBUF_NODISCARD ::protobuf::mozilla::dom::Pref* release_a_pref();
  ::protobuf::mozilla::dom::Pref* mutable_a_pref();
  void set_allocated_a_pref(::protobuf::mozilla::dom::Pref* a_pref);
  private:
  const ::protobuf::mozilla::dom::Pref& _internal_a_pref() const;
  ::protobuf::mozilla::dom::Pref* _internal_mutable_a_pref();
  public:
  void unsafe_arena_set_allocated_a_pref(
      ::protobuf::mozilla::dom::Pref* a_pref);
  ::protobuf::mozilla::dom::Pref* unsafe_arena_release_a_pref();

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_PreferenceUpdate)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::protobuf::mozilla::dom::Pref* a_pref_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_RequestMemoryReport final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport) */ {
 public:
  inline Msg_RequestMemoryReport() : Msg_RequestMemoryReport(nullptr) {}
  ~Msg_RequestMemoryReport() override;
  explicit PROTOBUF_CONSTEXPR Msg_RequestMemoryReport(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_RequestMemoryReport(const Msg_RequestMemoryReport& from);
  Msg_RequestMemoryReport(Msg_RequestMemoryReport&& from) noexcept
    : Msg_RequestMemoryReport() {
    *this = ::std::move(from);
  }

  inline Msg_RequestMemoryReport& operator=(const Msg_RequestMemoryReport& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_RequestMemoryReport& operator=(Msg_RequestMemoryReport&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_RequestMemoryReport& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_RequestMemoryReport* internal_default_instance() {
    return reinterpret_cast<const Msg_RequestMemoryReport*>(
               &_Msg_RequestMemoryReport_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    21;

  friend void swap(Msg_RequestMemoryReport& a, Msg_RequestMemoryReport& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_RequestMemoryReport* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_RequestMemoryReport* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_RequestMemoryReport* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_RequestMemoryReport>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_RequestMemoryReport& from);
  void MergeFrom(const Msg_RequestMemoryReport& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_RequestMemoryReport* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport";
  }
  protected:
  explicit Msg_RequestMemoryReport(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

