toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kADMDFileFieldNumber = 4,
    kAGenerationFieldNumber = 1,
    kAAnonymizeFieldNumber = 2,
    kAMinimizeMemoryUsageFieldNumber = 3,
  };
  // optional bytes a_DMDFile = 4;
  bool has_a_dmdfile() const;
  private:
  bool _internal_has_a_dmdfile() const;
  public:
  void clear_a_dmdfile();
  const std::string& a_dmdfile() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_dmdfile(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_dmdfile();
  PROTOBUF_NODISCARD std::string* release_a_dmdfile();
  void set_allocated_a_dmdfile(std::string* a_dmdfile);
  private:
  const std::string& _internal_a_dmdfile() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_dmdfile(const std::string& value);
  std::string* _internal_mutable_a_dmdfile();
  public:

  // required uint32 a_generation = 1;
  bool has_a_generation() const;
  private:
  bool _internal_has_a_generation() const;
  public:
  void clear_a_generation();
  uint32_t a_generation() const;
  void set_a_generation(uint32_t value);
  private:
  uint32_t _internal_a_generation() const;
  void _internal_set_a_generation(uint32_t value);
  public:

  // required bool a_anonymize = 2;
  bool has_a_anonymize() const;
  private:
  bool _internal_has_a_anonymize() const;
  public:
  void clear_a_anonymize();
  bool a_anonymize() const;
  void set_a_anonymize(bool value);
  private:
  bool _internal_a_anonymize() const;
  void _internal_set_a_anonymize(bool value);
  public:

  // required bool a_minimizeMemoryUsage = 3;
  bool has_a_minimizememoryusage() const;
  private:
  bool _internal_has_a_minimizememoryusage() const;
  public:
  void clear_a_minimizememoryusage();
  bool a_minimizememoryusage() const;
  void set_a_minimizememoryusage(bool value);
  private:
  bool _internal_a_minimizememoryusage() const;
  void _internal_set_a_minimizememoryusage(bool value);
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport)
 private:
  class _Internal;

  // helper for ByteSizeLong()
  size_t RequiredFieldsByteSizeFallback() const;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_dmdfile_;
    uint32_t a_generation_;
    bool a_anonymize_;
    bool a_minimizememoryusage_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Reply_RequestMemoryReport final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Reply_RequestMemoryReport) */ {
 public:
  inline Reply_RequestMemoryReport() : Reply_RequestMemoryReport(nullptr) {}
  ~Reply_RequestMemoryReport() override;
  explicit PROTOBUF_CONSTEXPR Reply_RequestMemoryReport(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Reply_RequestMemoryReport(const Reply_RequestMemoryReport& from);
  Reply_RequestMemoryReport(Reply_RequestMemoryReport&& from) noexcept
    : Reply_RequestMemoryReport() {
    *this = ::std::move(from);
  }

  inline Reply_RequestMemoryReport& operator=(const Reply_RequestMemoryReport& from) {
    CopyFrom(from);
    return *this;
  }
  inline Reply_RequestMemoryReport& operator=(Reply_RequestMemoryReport&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Reply_RequestMemoryReport& default_instance() {
    return *internal_default_instance();
  }
  static inline const Reply_RequestMemoryReport* internal_default_instance() {
    return reinterpret_cast<const Reply_RequestMemoryReport*>(
               &_Reply_RequestMemoryReport_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    22;

  friend void swap(Reply_RequestMemoryReport& a, Reply_RequestMemoryReport& b) {
    a.Swap(&b);
  }
  inline void Swap(Reply_RequestMemoryReport* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Reply_RequestMemoryReport* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Reply_RequestMemoryReport* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Reply_RequestMemoryReport>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Reply_RequestMemoryReport& from);
  void MergeFrom(const Reply_RequestMemoryReport& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

