toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Reply_RequestMemoryReport* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Reply_RequestMemoryReport";
  }
  protected:
  explicit Reply_RequestMemoryReport(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAAGenerationFieldNumber = 1,
  };
  // required uint32 a_aGeneration = 1;
  bool has_a_ageneration() const;
  private:
  bool _internal_has_a_ageneration() const;
  public:
  void clear_a_ageneration();
  uint32_t a_ageneration() const;
  void set_a_ageneration(uint32_t value);
  private:
  uint32_t _internal_a_ageneration() const;
  void _internal_set_a_ageneration(uint32_t value);
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Reply_RequestMemoryReport)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    uint32_t a_ageneration_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_SetOffline final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_SetOffline) */ {
 public:
  inline Msg_SetOffline() : Msg_SetOffline(nullptr) {}
  ~Msg_SetOffline() override;
  explicit PROTOBUF_CONSTEXPR Msg_SetOffline(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_SetOffline(const Msg_SetOffline& from);
  Msg_SetOffline(Msg_SetOffline&& from) noexcept
    : Msg_SetOffline() {
    *this = ::std::move(from);
  }

  inline Msg_SetOffline& operator=(const Msg_SetOffline& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_SetOffline& operator=(Msg_SetOffline&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_SetOffline& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_SetOffline* internal_default_instance() {
    return reinterpret_cast<const Msg_SetOffline*>(
               &_Msg_SetOffline_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    23;

  friend void swap(Msg_SetOffline& a, Msg_SetOffline& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_SetOffline* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_SetOffline* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_SetOffline* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_SetOffline>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_SetOffline& from);
  void MergeFrom(const Msg_SetOffline& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_SetOffline* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_SetOffline";
  }
  protected:
  explicit Msg_SetOffline(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAOfflineFieldNumber = 1,
  };
  // required bool a_offline = 1;
  bool has_a_offline() const;
  private:
  bool _internal_has_a_offline() const;
  public:
  void clear_a_offline();
  bool a_offline() const;
  void set_a_offline(bool value);
  private:
  bool _internal_a_offline() const;
  void _internal_set_a_offline(bool value);
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_SetOffline)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    bool a_offline_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_SetConnectivity final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_SetConnectivity) */ {
 public:
  inline Msg_SetConnectivity() : Msg_SetConnectivity(nullptr) {}
  ~Msg_SetConnectivity() override;
  explicit PROTOBUF_CONSTEXPR Msg_SetConnectivity(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

