toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  Msg_SetConnectivity(const Msg_SetConnectivity& from);
  Msg_SetConnectivity(Msg_SetConnectivity&& from) noexcept
    : Msg_SetConnectivity() {
    *this = ::std::move(from);
  }

  inline Msg_SetConnectivity& operator=(const Msg_SetConnectivity& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_SetConnectivity& operator=(Msg_SetConnectivity&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_SetConnectivity& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_SetConnectivity* internal_default_instance() {
    return reinterpret_cast<const Msg_SetConnectivity*>(
               &_Msg_SetConnectivity_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    24;

  friend void swap(Msg_SetConnectivity& a, Msg_SetConnectivity& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_SetConnectivity* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_SetConnectivity* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_SetConnectivity* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_SetConnectivity>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_SetConnectivity& from);
  void MergeFrom(const Msg_SetConnectivity& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_SetConnectivity* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_SetConnectivity";
  }
  protected:
  explicit Msg_SetConnectivity(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAConnectivityFieldNumber = 1,
  };
  // required bool a_connectivity = 1;
  bool has_a_connectivity() const;
  private:
  bool _internal_has_a_connectivity() const;
  public:
  void clear_a_connectivity();
  bool a_connectivity() const;
  void set_a_connectivity(bool value);
  private:
  bool _internal_a_connectivity() const;
  void _internal_set_a_connectivity(bool value);
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_SetConnectivity)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    bool a_connectivity_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_InitLinuxSandbox final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_InitLinuxSandbox) */ {
 public:
  inline Msg_InitLinuxSandbox() : Msg_InitLinuxSandbox(nullptr) {}
  ~Msg_InitLinuxSandbox() override;
  explicit PROTOBUF_CONSTEXPR Msg_InitLinuxSandbox(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_InitLinuxSandbox(const Msg_InitLinuxSandbox& from);
  Msg_InitLinuxSandbox(Msg_InitLinuxSandbox&& from) noexcept
    : Msg_InitLinuxSandbox() {
    *this = ::std::move(from);
  }

  inline Msg_InitLinuxSandbox& operator=(const Msg_InitLinuxSandbox& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_InitLinuxSandbox& operator=(Msg_InitLinuxSandbox&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_InitLinuxSandbox& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_InitLinuxSandbox* internal_default_instance() {
    return reinterpret_cast<const Msg_InitLinuxSandbox*>(
               &_Msg_InitLinuxSandbox_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    25;

  friend void swap(Msg_InitLinuxSandbox& a, Msg_InitLinuxSandbox& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_InitLinuxSandbox* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_InitLinuxSandbox* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_InitLinuxSandbox* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_InitLinuxSandbox>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_InitLinuxSandbox& from);
  void MergeFrom(const Msg_InitLinuxSandbox& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

