toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_InitLinuxSandbox* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_InitLinuxSandbox";
  }
  protected:
  explicit Msg_InitLinuxSandbox(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kASandboxBrokerFieldNumber = 1,
  };
  // optional bytes a_sandboxBroker = 1;
  bool has_a_sandboxbroker() const;
  private:
  bool _internal_has_a_sandboxbroker() const;
  public:
  void clear_a_sandboxbroker();
  const std::string& a_sandboxbroker() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_sandboxbroker(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_sandboxbroker();
  PROTOBUF_NODISCARD std::string* release_a_sandboxbroker();
  void set_allocated_a_sandboxbroker(std::string* a_sandboxbroker);
  private:
  const std::string& _internal_a_sandboxbroker() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_sandboxbroker(const std::string& value);
  std::string* _internal_mutable_a_sandboxbroker();
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_InitLinuxSandbox)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_sandboxbroker_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_InitSocketProcessBridgeParent final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketProcessBridgeParent) */ {
 public:
  inline Msg_InitSocketProcessBridgeParent() : Msg_InitSocketProcessBridgeParent(nullptr) {}
  ~Msg_InitSocketProcessBridgeParent() override;
  explicit PROTOBUF_CONSTEXPR Msg_InitSocketProcessBridgeParent(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_InitSocketProcessBridgeParent(const Msg_InitSocketProcessBridgeParent& from);
  Msg_InitSocketProcessBridgeParent(Msg_InitSocketProcessBridgeParent&& from) noexcept
    : Msg_InitSocketProcessBridgeParent() {
    *this = ::std::move(from);
  }

  inline Msg_InitSocketProcessBridgeParent& operator=(const Msg_InitSocketProcessBridgeParent& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_InitSocketProcessBridgeParent& operator=(Msg_InitSocketProcessBridgeParent&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_InitSocketProcessBridgeParent& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_InitSocketProcessBridgeParent* internal_default_instance() {
    return reinterpret_cast<const Msg_InitSocketProcessBridgeParent*>(
               &_Msg_InitSocketProcessBridgeParent_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    26;

  friend void swap(Msg_InitSocketProcessBridgeParent& a, Msg_InitSocketProcessBridgeParent& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_InitSocketProcessBridgeParent* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_InitSocketProcessBridgeParent* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_InitSocketProcessBridgeParent* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_InitSocketProcessBridgeParent>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_InitSocketProcessBridgeParent& from);
  void MergeFrom(const Msg_InitSocketProcessBridgeParent& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_InitSocketProcessBridgeParent* other);

