toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_InitSocketProcessBridgeParent";
  }
  protected:
  explicit Msg_InitSocketProcessBridgeParent(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAProcessIdFieldNumber = 1,
    kAEndpointFieldNumber = 2,
  };
  // required bytes a_processId = 1;
  bool has_a_processid() const;
  private:
  bool _internal_has_a_processid() const;
  public:
  void clear_a_processid();
  const std::string& a_processid() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_processid(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_processid();
  PROTOBUF_NODISCARD std::string* release_a_processid();
  void set_allocated_a_processid(std::string* a_processid);
  private:
  const std::string& _internal_a_processid() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_processid(const std::string& value);
  std::string* _internal_mutable_a_processid();
  public:

  // required bytes a_endpoint = 2;
  bool has_a_endpoint() const;
  private:
  bool _internal_has_a_endpoint() const;
  public:
  void clear_a_endpoint();
  const std::string& a_endpoint() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_endpoint(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_endpoint();
  PROTOBUF_NODISCARD std::string* release_a_endpoint();
  void set_allocated_a_endpoint(std::string* a_endpoint);
  private:
  const std::string& _internal_a_endpoint() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_endpoint(const std::string& value);
  std::string* _internal_mutable_a_endpoint();
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketProcessBridgeParent)
 private:
  class _Internal;

  // helper for ByteSizeLong()
  size_t RequiredFieldsByteSizeFallback() const;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_processid_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_endpoint_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_InitProfiler final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_InitProfiler) */ {
 public:
  inline Msg_InitProfiler() : Msg_InitProfiler(nullptr) {}
  ~Msg_InitProfiler() override;
  explicit PROTOBUF_CONSTEXPR Msg_InitProfiler(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_InitProfiler(const Msg_InitProfiler& from);
  Msg_InitProfiler(Msg_InitProfiler&& from) noexcept
    : Msg_InitProfiler() {
    *this = ::std::move(from);
  }

  inline Msg_InitProfiler& operator=(const Msg_InitProfiler& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_InitProfiler& operator=(Msg_InitProfiler&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_InitProfiler& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_InitProfiler* internal_default_instance() {
    return reinterpret_cast<const Msg_InitProfiler*>(
               &_Msg_InitProfiler_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    27;

  friend void swap(Msg_InitProfiler& a, Msg_InitProfiler& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_InitProfiler* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_InitProfiler* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_InitProfiler* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_InitProfiler>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_InitProfiler& from);
  void MergeFrom(const Msg_InitProfiler& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

