toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_SocketProcessTelemetryPing)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_PHttpTransactionConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_PHttpTransactionConstructor) */ {
 public:
  inline Msg_PHttpTransactionConstructor() : Msg_PHttpTransactionConstructor(nullptr) {}
  ~Msg_PHttpTransactionConstructor() override;
  explicit PROTOBUF_CONSTEXPR Msg_PHttpTransactionConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_PHttpTransactionConstructor(const Msg_PHttpTransactionConstructor& from);
  Msg_PHttpTransactionConstructor(Msg_PHttpTransactionConstructor&& from) noexcept
    : Msg_PHttpTransactionConstructor() {
    *this = ::std::move(from);
  }

  inline Msg_PHttpTransactionConstructor& operator=(const Msg_PHttpTransactionConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_PHttpTransactionConstructor& operator=(Msg_PHttpTransactionConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_PHttpTransactionConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_PHttpTransactionConstructor* internal_default_instance() {
    return reinterpret_cast<const Msg_PHttpTransactionConstructor*>(
               &_Msg_PHttpTransactionConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    29;

  friend void swap(Msg_PHttpTransactionConstructor& a, Msg_PHttpTransactionConstructor& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_PHttpTransactionConstructor* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_PHttpTransactionConstructor* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_PHttpTransactionConstructor* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_PHttpTransactionConstructor>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_PHttpTransactionConstructor& from);
  void MergeFrom(const Msg_PHttpTransactionConstructor& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_PHttpTransactionConstructor* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_PHttpTransactionConstructor";
  }
  protected:
  explicit Msg_PHttpTransactionConstructor(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_PHttpTransactionConstructor)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Reply_PHttpTransactionConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Reply_PHttpTransactionConstructor) */ {
 public:
  inline Reply_PHttpTransactionConstructor() : Reply_PHttpTransactionConstructor(nullptr) {}
  ~Reply_PHttpTransactionConstructor() override;
  explicit PROTOBUF_CONSTEXPR Reply_PHttpTransactionConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

