toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  Reply_PHttpTransactionConstructor(const Reply_PHttpTransactionConstructor& from);
  Reply_PHttpTransactionConstructor(Reply_PHttpTransactionConstructor&& from) noexcept
    : Reply_PHttpTransactionConstructor() {
    *this = ::std::move(from);
  }

  inline Reply_PHttpTransactionConstructor& operator=(const Reply_PHttpTransactionConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Reply_PHttpTransactionConstructor& operator=(Reply_PHttpTransactionConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Reply_PHttpTransactionConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Reply_PHttpTransactionConstructor* internal_default_instance() {
    return reinterpret_cast<const Reply_PHttpTransactionConstructor*>(
               &_Reply_PHttpTransactionConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    30;

  friend void swap(Reply_PHttpTransactionConstructor& a, Reply_PHttpTransactionConstructor& b) {
    a.Swap(&b);
  }
  inline void Swap(Reply_PHttpTransactionConstructor* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Reply_PHttpTransactionConstructor* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Reply_PHttpTransactionConstructor* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Reply_PHttpTransactionConstructor>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Reply_PHttpTransactionConstructor& from);
  void MergeFrom(const Reply_PHttpTransactionConstructor& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Reply_PHttpTransactionConstructor* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Reply_PHttpTransactionConstructor";
  }
  protected:
  explicit Reply_PHttpTransactionConstructor(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Reply_PHttpTransactionConstructor)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_PHttpConnectionMgrConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_PHttpConnectionMgrConstructor) */ {
 public:
  inline Msg_PHttpConnectionMgrConstructor() : Msg_PHttpConnectionMgrConstructor(nullptr) {}
  ~Msg_PHttpConnectionMgrConstructor() override;
  explicit PROTOBUF_CONSTEXPR Msg_PHttpConnectionMgrConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_PHttpConnectionMgrConstructor(const Msg_PHttpConnectionMgrConstructor& from);
  Msg_PHttpConnectionMgrConstructor(Msg_PHttpConnectionMgrConstructor&& from) noexcept
    : Msg_PHttpConnectionMgrConstructor() {
    *this = ::std::move(from);
  }

  inline Msg_PHttpConnectionMgrConstructor& operator=(const Msg_PHttpConnectionMgrConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_PHttpConnectionMgrConstructor& operator=(Msg_PHttpConnectionMgrConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_PHttpConnectionMgrConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_PHttpConnectionMgrConstructor* internal_default_instance() {
    return reinterpret_cast<const Msg_PHttpConnectionMgrConstructor*>(
               &_Msg_PHttpConnectionMgrConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    31;

  friend void swap(Msg_PHttpConnectionMgrConstructor& a, Msg_PHttpConnectionMgrConstructor& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_PHttpConnectionMgrConstructor* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_PHttpConnectionMgrConstructor* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

