toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  Msg_PHttpConnectionMgrConstructor* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_PHttpConnectionMgrConstructor>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_PHttpConnectionMgrConstructor& from);
  void MergeFrom(const Msg_PHttpConnectionMgrConstructor& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_PHttpConnectionMgrConstructor* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_PHttpConnectionMgrConstructor";
  }
  protected:
  explicit Msg_PHttpConnectionMgrConstructor(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAAArgsFieldNumber = 1,
  };
  // required .protobuf.mozilla.net.HttpHandlerInitArgs a_aArgs = 1;
  bool has_a_aargs() const;
  private:
  bool _internal_has_a_aargs() const;
  public:
  void clear_a_aargs();
  const ::protobuf::mozilla::net::HttpHandlerInitArgs& a_aargs() const;
  PROTOBUF_NODISCARD ::protobuf::mozilla::net::HttpHandlerInitArgs* release_a_aargs();
  ::protobuf::mozilla::net::HttpHandlerInitArgs* mutable_a_aargs();
  void set_allocated_a_aargs(::protobuf::mozilla::net::HttpHandlerInitArgs* a_aargs);
  private:
  const ::protobuf::mozilla::net::HttpHandlerInitArgs& _internal_a_aargs() const;
  ::protobuf::mozilla::net::HttpHandlerInitArgs* _internal_mutable_a_aargs();
  public:
  void unsafe_arena_set_allocated_a_aargs(
      ::protobuf::mozilla::net::HttpHandlerInitArgs* a_aargs);
  ::protobuf::mozilla::net::HttpHandlerInitArgs* unsafe_arena_release_a_aargs();

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_PHttpConnectionMgrConstructor)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::protobuf::mozilla::net::HttpHandlerInitArgs* a_aargs_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Reply_PHttpConnectionMgrConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Reply_PHttpConnectionMgrConstructor) */ {
 public:
  inline Reply_PHttpConnectionMgrConstructor() : Reply_PHttpConnectionMgrConstructor(nullptr) {}
  ~Reply_PHttpConnectionMgrConstructor() override;
  explicit PROTOBUF_CONSTEXPR Reply_PHttpConnectionMgrConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Reply_PHttpConnectionMgrConstructor(const Reply_PHttpConnectionMgrConstructor& from);
  Reply_PHttpConnectionMgrConstructor(Reply_PHttpConnectionMgrConstructor&& from) noexcept
    : Reply_PHttpConnectionMgrConstructor() {
    *this = ::std::move(from);
  }

  inline Reply_PHttpConnectionMgrConstructor& operator=(const Reply_PHttpConnectionMgrConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Reply_PHttpConnectionMgrConstructor& operator=(Reply_PHttpConnectionMgrConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Reply_PHttpConnectionMgrConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Reply_PHttpConnectionMgrConstructor* internal_default_instance() {
    return reinterpret_cast<const Reply_PHttpConnectionMgrConstructor*>(
               &_Reply_PHttpConnectionMgrConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    32;

  friend void swap(Reply_PHttpConnectionMgrConstructor& a, Reply_PHttpConnectionMgrConstructor& b) {
    a.Swap(&b);
  }
  inline void Swap(Reply_PHttpConnectionMgrConstructor* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Reply_PHttpConnectionMgrConstructor* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Reply_PHttpConnectionMgrConstructor* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Reply_PHttpConnectionMgrConstructor>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Reply_PHttpConnectionMgrConstructor& from);
  void MergeFrom(const Reply_PHttpConnectionMgrConstructor& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

