toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Reply_PHttpConnectionMgrConstructor* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Reply_PHttpConnectionMgrConstructor";
  }
  protected:
  explicit Reply_PHttpConnectionMgrConstructor(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Reply_PHttpConnectionMgrConstructor)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_UpdateDeviceModelId final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_UpdateDeviceModelId) */ {
 public:
  inline Msg_UpdateDeviceModelId() : Msg_UpdateDeviceModelId(nullptr) {}
  ~Msg_UpdateDeviceModelId() override;
  explicit PROTOBUF_CONSTEXPR Msg_UpdateDeviceModelId(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_UpdateDeviceModelId(const Msg_UpdateDeviceModelId& from);
  Msg_UpdateDeviceModelId(Msg_UpdateDeviceModelId&& from) noexcept
    : Msg_UpdateDeviceModelId() {
    *this = ::std::move(from);
  }

  inline Msg_UpdateDeviceModelId& operator=(const Msg_UpdateDeviceModelId& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_UpdateDeviceModelId& operator=(Msg_UpdateDeviceModelId&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_UpdateDeviceModelId& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_UpdateDeviceModelId* internal_default_instance() {
    return reinterpret_cast<const Msg_UpdateDeviceModelId*>(
               &_Msg_UpdateDeviceModelId_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    33;

  friend void swap(Msg_UpdateDeviceModelId& a, Msg_UpdateDeviceModelId& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_UpdateDeviceModelId* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_UpdateDeviceModelId* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_UpdateDeviceModelId* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_UpdateDeviceModelId>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_UpdateDeviceModelId& from);
  void MergeFrom(const Msg_UpdateDeviceModelId& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_UpdateDeviceModelId* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_UpdateDeviceModelId";
  }
  protected:
  explicit Msg_UpdateDeviceModelId(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAAModelIdFieldNumber = 1,
  };
  // required string a_aModelId = 1;
  bool has_a_amodelid() const;
  private:
  bool _internal_has_a_amodelid() const;
  public:
  void clear_a_amodelid();
  const std::string& a_amodelid() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_amodelid(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_amodelid();
  PROTOBUF_NODISCARD std::string* release_a_amodelid();
  void set_allocated_a_amodelid(std::string* a_amodelid);
  private:
  const std::string& _internal_a_amodelid() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_amodelid(const std::string& value);
  std::string* _internal_mutable_a_amodelid();
  public:

