toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_UpdateDeviceModelId)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_amodelid_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_OnHttpActivityDistributorActivated final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_OnHttpActivityDistributorActivated) */ {
 public:
  inline Msg_OnHttpActivityDistributorActivated() : Msg_OnHttpActivityDistributorActivated(nullptr) {}
  ~Msg_OnHttpActivityDistributorActivated() override;
  explicit PROTOBUF_CONSTEXPR Msg_OnHttpActivityDistributorActivated(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_OnHttpActivityDistributorActivated(const Msg_OnHttpActivityDistributorActivated& from);
  Msg_OnHttpActivityDistributorActivated(Msg_OnHttpActivityDistributorActivated&& from) noexcept
    : Msg_OnHttpActivityDistributorActivated() {
    *this = ::std::move(from);
  }

  inline Msg_OnHttpActivityDistributorActivated& operator=(const Msg_OnHttpActivityDistributorActivated& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_OnHttpActivityDistributorActivated& operator=(Msg_OnHttpActivityDistributorActivated&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_OnHttpActivityDistributorActivated& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_OnHttpActivityDistributorActivated* internal_default_instance() {
    return reinterpret_cast<const Msg_OnHttpActivityDistributorActivated*>(
               &_Msg_OnHttpActivityDistributorActivated_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    34;

  friend void swap(Msg_OnHttpActivityDistributorActivated& a, Msg_OnHttpActivityDistributorActivated& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_OnHttpActivityDistributorActivated* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_OnHttpActivityDistributorActivated* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_OnHttpActivityDistributorActivated* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_OnHttpActivityDistributorActivated>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_OnHttpActivityDistributorActivated& from);
  void MergeFrom(const Msg_OnHttpActivityDistributorActivated& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_OnHttpActivityDistributorActivated* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_OnHttpActivityDistributorActivated";
  }
  protected:
  explicit Msg_OnHttpActivityDistributorActivated(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAAIsActivatedFieldNumber = 1,
  };
  // required bool a_aIsActivated = 1;
  bool has_a_aisactivated() const;
  private:
  bool _internal_has_a_aisactivated() const;
  public:
  void clear_a_aisactivated();
  bool a_aisactivated() const;
  void set_a_aisactivated(bool value);
  private:
  bool _internal_a_aisactivated() const;
  void _internal_set_a_aisactivated(bool value);
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_OnHttpActivityDistributorActivated)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    bool a_aisactivated_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_OnHttpActivityDistributorObserveProxyResponse final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_OnHttpActivityDistributorObserveProxyResponse) */ {
 public:
  inline Msg_OnHttpActivityDistributorObserveProxyResponse() : Msg_OnHttpActivityDistributorObserveProxyResponse(nullptr) {}
  ~Msg_OnHttpActivityDistributorObserveProxyResponse() override;
  explicit PROTOBUF_CONSTEXPR Msg_OnHttpActivityDistributorObserveProxyResponse(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_OnHttpActivityDistributorObserveProxyResponse(const Msg_OnHttpActivityDistributorObserveProxyResponse& from);
  Msg_OnHttpActivityDistributorObserveProxyResponse(Msg_OnHttpActivityDistributorObserveProxyResponse&& from) noexcept
    : Msg_OnHttpActivityDistributorObserveProxyResponse() {
    *this = ::std::move(from);
  }

  inline Msg_OnHttpActivityDistributorObserveProxyResponse& operator=(const Msg_OnHttpActivityDistributorObserveProxyResponse& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_OnHttpActivityDistributorObserveProxyResponse& operator=(Msg_OnHttpActivityDistributorObserveProxyResponse&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

