toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  static const Msg_OnHttpActivityDistributorObserveProxyResponse& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_OnHttpActivityDistributorObserveProxyResponse* internal_default_instance() {
    return reinterpret_cast<const Msg_OnHttpActivityDistributorObserveProxyResponse*>(
               &_Msg_OnHttpActivityDistributorObserveProxyResponse_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    35;

  friend void swap(Msg_OnHttpActivityDistributorObserveProxyResponse& a, Msg_OnHttpActivityDistributorObserveProxyResponse& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_OnHttpActivityDistributorObserveProxyResponse* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_OnHttpActivityDistributorObserveProxyResponse* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_OnHttpActivityDistributorObserveProxyResponse* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_OnHttpActivityDistributorObserveProxyResponse>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_OnHttpActivityDistributorObserveProxyResponse& from);
  void MergeFrom(const Msg_OnHttpActivityDistributorObserveProxyResponse& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_OnHttpActivityDistributorObserveProxyResponse* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_OnHttpActivityDistributorObserveProxyResponse";
  }
  protected:
  explicit Msg_OnHttpActivityDistributorObserveProxyResponse(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAAIsEnabledFieldNumber = 1,
  };
  // required bool a_aIsEnabled = 1;
  bool has_a_aisenabled() const;
  private:
  bool _internal_has_a_aisenabled() const;
  public:
  void clear_a_aisenabled();
  bool a_aisenabled() const;
  void set_a_aisenabled(bool value);
  private:
  bool _internal_a_aisenabled() const;
  void _internal_set_a_aisenabled(bool value);
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_OnHttpActivityDistributorObserveProxyResponse)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    bool a_aisenabled_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_OnHttpActivityDistributorObserveConnection final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_OnHttpActivityDistributorObserveConnection) */ {
 public:
  inline Msg_OnHttpActivityDistributorObserveConnection() : Msg_OnHttpActivityDistributorObserveConnection(nullptr) {}
  ~Msg_OnHttpActivityDistributorObserveConnection() override;
  explicit PROTOBUF_CONSTEXPR Msg_OnHttpActivityDistributorObserveConnection(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_OnHttpActivityDistributorObserveConnection(const Msg_OnHttpActivityDistributorObserveConnection& from);
  Msg_OnHttpActivityDistributorObserveConnection(Msg_OnHttpActivityDistributorObserveConnection&& from) noexcept
    : Msg_OnHttpActivityDistributorObserveConnection() {
    *this = ::std::move(from);
  }

  inline Msg_OnHttpActivityDistributorObserveConnection& operator=(const Msg_OnHttpActivityDistributorObserveConnection& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_OnHttpActivityDistributorObserveConnection& operator=(Msg_OnHttpActivityDistributorObserveConnection&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_OnHttpActivityDistributorObserveConnection& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_OnHttpActivityDistributorObserveConnection* internal_default_instance() {
    return reinterpret_cast<const Msg_OnHttpActivityDistributorObserveConnection*>(
               &_Msg_OnHttpActivityDistributorObserveConnection_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    36;

