toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_PInputChannelThrottleQueueConstructor* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_PInputChannelThrottleQueueConstructor";
  }
  protected:
  explicit Msg_PInputChannelThrottleQueueConstructor(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAMeanBytesPerSecondFieldNumber = 1,
    kAMaxBytesPerSecondFieldNumber = 2,
  };
  // required uint32 a_meanBytesPerSecond = 1;
  bool has_a_meanbytespersecond() const;
  private:
  bool _internal_has_a_meanbytespersecond() const;
  public:
  void clear_a_meanbytespersecond();
  uint32_t a_meanbytespersecond() const;
  void set_a_meanbytespersecond(uint32_t value);
  private:
  uint32_t _internal_a_meanbytespersecond() const;
  void _internal_set_a_meanbytespersecond(uint32_t value);
  public:

  // required uint32 a_maxBytesPerSecond = 2;
  bool has_a_maxbytespersecond() const;
  private:
  bool _internal_has_a_maxbytespersecond() const;
  public:
  void clear_a_maxbytespersecond();
  uint32_t a_maxbytespersecond() const;
  void set_a_maxbytespersecond(uint32_t value);
  private:
  uint32_t _internal_a_maxbytespersecond() const;
  void _internal_set_a_maxbytespersecond(uint32_t value);
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_PInputChannelThrottleQueueConstructor)
 private:
  class _Internal;

  // helper for ByteSizeLong()
  size_t RequiredFieldsByteSizeFallback() const;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    uint32_t a_meanbytespersecond_;
    uint32_t a_maxbytespersecond_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Reply_PInputChannelThrottleQueueConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Reply_PInputChannelThrottleQueueConstructor) */ {
 public:
  inline Reply_PInputChannelThrottleQueueConstructor() : Reply_PInputChannelThrottleQueueConstructor(nullptr) {}
  ~Reply_PInputChannelThrottleQueueConstructor() override;
  explicit PROTOBUF_CONSTEXPR Reply_PInputChannelThrottleQueueConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Reply_PInputChannelThrottleQueueConstructor(const Reply_PInputChannelThrottleQueueConstructor& from);
  Reply_PInputChannelThrottleQueueConstructor(Reply_PInputChannelThrottleQueueConstructor&& from) noexcept
    : Reply_PInputChannelThrottleQueueConstructor() {
    *this = ::std::move(from);
  }

  inline Reply_PInputChannelThrottleQueueConstructor& operator=(const Reply_PInputChannelThrottleQueueConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Reply_PInputChannelThrottleQueueConstructor& operator=(Reply_PInputChannelThrottleQueueConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Reply_PInputChannelThrottleQueueConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Reply_PInputChannelThrottleQueueConstructor* internal_default_instance() {
    return reinterpret_cast<const Reply_PInputChannelThrottleQueueConstructor*>(
               &_Reply_PInputChannelThrottleQueueConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    38;

  friend void swap(Reply_PInputChannelThrottleQueueConstructor& a, Reply_PInputChannelThrottleQueueConstructor& b) {
    a.Swap(&b);
  }
  inline void Swap(Reply_PInputChannelThrottleQueueConstructor* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Reply_PInputChannelThrottleQueueConstructor* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Reply_PInputChannelThrottleQueueConstructor* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Reply_PInputChannelThrottleQueueConstructor>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Reply_PInputChannelThrottleQueueConstructor& from);
  void MergeFrom(const Reply_PInputChannelThrottleQueueConstructor& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

