toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Reply_PInputChannelThrottleQueueConstructor* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Reply_PInputChannelThrottleQueueConstructor";
  }
  protected:
  explicit Reply_PInputChannelThrottleQueueConstructor(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Reply_PInputChannelThrottleQueueConstructor)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_PAltSvcTransactionConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_PAltSvcTransactionConstructor) */ {
 public:
  inline Msg_PAltSvcTransactionConstructor() : Msg_PAltSvcTransactionConstructor(nullptr) {}
  ~Msg_PAltSvcTransactionConstructor() override;
  explicit PROTOBUF_CONSTEXPR Msg_PAltSvcTransactionConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_PAltSvcTransactionConstructor(const Msg_PAltSvcTransactionConstructor& from);
  Msg_PAltSvcTransactionConstructor(Msg_PAltSvcTransactionConstructor&& from) noexcept
    : Msg_PAltSvcTransactionConstructor() {
    *this = ::std::move(from);
  }

  inline Msg_PAltSvcTransactionConstructor& operator=(const Msg_PAltSvcTransactionConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_PAltSvcTransactionConstructor& operator=(Msg_PAltSvcTransactionConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_PAltSvcTransactionConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_PAltSvcTransactionConstructor* internal_default_instance() {
    return reinterpret_cast<const Msg_PAltSvcTransactionConstructor*>(
               &_Msg_PAltSvcTransactionConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    39;

  friend void swap(Msg_PAltSvcTransactionConstructor& a, Msg_PAltSvcTransactionConstructor& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_PAltSvcTransactionConstructor* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_PAltSvcTransactionConstructor* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_PAltSvcTransactionConstructor* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_PAltSvcTransactionConstructor>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_PAltSvcTransactionConstructor& from);
  void MergeFrom(const Msg_PAltSvcTransactionConstructor& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_PAltSvcTransactionConstructor* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_PAltSvcTransactionConstructor";
  }
  protected:
  explicit Msg_PAltSvcTransactionConstructor(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAAConnInfoFieldNumber = 1,
    kAACapsFieldNumber = 2,
  };
  // required .protobuf.mozilla.net.HttpConnectionInfoCloneArgs a_aConnInfo = 1;
  bool has_a_aconninfo() const;
  private:
  bool _internal_has_a_aconninfo() const;
  public:
  void clear_a_aconninfo();
  const ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs& a_aconninfo() const;
  PROTOBUF_NODISCARD ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* release_a_aconninfo();
  ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* mutable_a_aconninfo();
  void set_allocated_a_aconninfo(::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* a_aconninfo);
  private:
  const ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs& _internal_a_aconninfo() const;
  ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* _internal_mutable_a_aconninfo();
  public:
  void unsafe_arena_set_allocated_a_aconninfo(
      ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* a_aconninfo);
  ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* unsafe_arena_release_a_aconninfo();

  // required uint32 a_aCaps = 2;
  bool has_a_acaps() const;
  private:
  bool _internal_has_a_acaps() const;
  public:
  void clear_a_acaps();
  uint32_t a_acaps() const;
  void set_a_acaps(uint32_t value);
  private:
  uint32_t _internal_a_acaps() const;
  void _internal_set_a_acaps(uint32_t value);
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_PAltSvcTransactionConstructor)
 private:
  class _Internal;

  // helper for ByteSizeLong()
  size_t RequiredFieldsByteSizeFallback() const;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* a_aconninfo_;
    uint32_t a_acaps_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Reply_PAltSvcTransactionConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Reply_PAltSvcTransactionConstructor) */ {
 public:
  inline Reply_PAltSvcTransactionConstructor() : Reply_PAltSvcTransactionConstructor(nullptr) {}
  ~Reply_PAltSvcTransactionConstructor() override;
  explicit PROTOBUF_CONSTEXPR Reply_PAltSvcTransactionConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Reply_PAltSvcTransactionConstructor(const Reply_PAltSvcTransactionConstructor& from);
  Reply_PAltSvcTransactionConstructor(Reply_PAltSvcTransactionConstructor&& from) noexcept
    : Reply_PAltSvcTransactionConstructor() {
    *this = ::std::move(from);
  }

  inline Reply_PAltSvcTransactionConstructor& operator=(const Reply_PAltSvcTransactionConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Reply_PAltSvcTransactionConstructor& operator=(Reply_PAltSvcTransactionConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Reply_PAltSvcTransactionConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Reply_PAltSvcTransactionConstructor* internal_default_instance() {
    return reinterpret_cast<const Reply_PAltSvcTransactionConstructor*>(
               &_Reply_PAltSvcTransactionConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    40;

