toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_ClearSessionCache* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_ClearSessionCache";
  }
  protected:
  explicit Msg_ClearSessionCache(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_ClearSessionCache)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Reply_ClearSessionCache final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Reply_ClearSessionCache) */ {
 public:
  inline Reply_ClearSessionCache() : Reply_ClearSessionCache(nullptr) {}
  ~Reply_ClearSessionCache() override;
  explicit PROTOBUF_CONSTEXPR Reply_ClearSessionCache(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Reply_ClearSessionCache(const Reply_ClearSessionCache& from);
  Reply_ClearSessionCache(Reply_ClearSessionCache&& from) noexcept
    : Reply_ClearSessionCache() {
    *this = ::std::move(from);
  }

  inline Reply_ClearSessionCache& operator=(const Reply_ClearSessionCache& from) {
    CopyFrom(from);
    return *this;
  }
  inline Reply_ClearSessionCache& operator=(Reply_ClearSessionCache&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Reply_ClearSessionCache& default_instance() {
    return *internal_default_instance();
  }
  static inline const Reply_ClearSessionCache* internal_default_instance() {
    return reinterpret_cast<const Reply_ClearSessionCache*>(
               &_Reply_ClearSessionCache_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    42;

  friend void swap(Reply_ClearSessionCache& a, Reply_ClearSessionCache& b) {
    a.Swap(&b);
  }
  inline void Swap(Reply_ClearSessionCache* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Reply_ClearSessionCache* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Reply_ClearSessionCache* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Reply_ClearSessionCache>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Reply_ClearSessionCache& from);
  void MergeFrom(const Reply_ClearSessionCache& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Reply_ClearSessionCache* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Reply_ClearSessionCache";
  }
  protected:
  explicit Reply_ClearSessionCache(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAOkFieldNumber = 1,
  };
  // required bytes a_ok = 1;
  bool has_a_ok() const;
  private:
  bool _internal_has_a_ok() const;
  public:
  void clear_a_ok();
  const std::string& a_ok() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_ok(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_ok();
  PROTOBUF_NODISCARD std::string* release_a_ok();
  void set_allocated_a_ok(std::string* a_ok);
  private:
  const std::string& _internal_a_ok() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_ok(const std::string& value);
  std::string* _internal_mutable_a_ok();
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Reply_ClearSessionCache)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_ok_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_PTRRServiceConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor) */ {
 public:
  inline Msg_PTRRServiceConstructor() : Msg_PTRRServiceConstructor(nullptr) {}
  ~Msg_PTRRServiceConstructor() override;
  explicit PROTOBUF_CONSTEXPR Msg_PTRRServiceConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_PTRRServiceConstructor(const Msg_PTRRServiceConstructor& from);
  Msg_PTRRServiceConstructor(Msg_PTRRServiceConstructor&& from) noexcept
    : Msg_PTRRServiceConstructor() {
    *this = ::std::move(from);
  }

  inline Msg_PTRRServiceConstructor& operator=(const Msg_PTRRServiceConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_PTRRServiceConstructor& operator=(Msg_PTRRServiceConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

