toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  static const Msg_PTRRServiceConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_PTRRServiceConstructor* internal_default_instance() {
    return reinterpret_cast<const Msg_PTRRServiceConstructor*>(
               &_Msg_PTRRServiceConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    43;

  friend void swap(Msg_PTRRServiceConstructor& a, Msg_PTRRServiceConstructor& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_PTRRServiceConstructor* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_PTRRServiceConstructor* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_PTRRServiceConstructor* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_PTRRServiceConstructor>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_PTRRServiceConstructor& from);
  void MergeFrom(const Msg_PTRRServiceConstructor& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_PTRRServiceConstructor* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor";
  }
  protected:
  explicit Msg_PTRRServiceConstructor(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAADNSSuffixListFieldNumber = 3,
    kAACaptiveIsPassedFieldNumber = 1,
    kAAParentalControlEnabledFieldNumber = 2,
  };
  // repeated string a_aDNSSuffixList = 3;
  int a_adnssuffixlist_size() const;
  private:
  int _internal_a_adnssuffixlist_size() const;
  public:
  void clear_a_adnssuffixlist();
  const std::string& a_adnssuffixlist(int index) const;
  std::string* mutable_a_adnssuffixlist(int index);
  void set_a_adnssuffixlist(int index, const std::string& value);
  void set_a_adnssuffixlist(int index, std::string&& value);
  void set_a_adnssuffixlist(int index, const char* value);
  void set_a_adnssuffixlist(int index, const char* value, size_t size);
  std::string* add_a_adnssuffixlist();
  void add_a_adnssuffixlist(const std::string& value);
  void add_a_adnssuffixlist(std::string&& value);
  void add_a_adnssuffixlist(const char* value);
  void add_a_adnssuffixlist(const char* value, size_t size);
  const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>& a_adnssuffixlist() const;
  ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>* mutable_a_adnssuffixlist();
  private:
  const std::string& _internal_a_adnssuffixlist(int index) const;
  std::string* _internal_add_a_adnssuffixlist();
  public:

  // required bool a_aCaptiveIsPassed = 1;
  bool has_a_acaptiveispassed() const;
  private:
  bool _internal_has_a_acaptiveispassed() const;
  public:
  void clear_a_acaptiveispassed();
  bool a_acaptiveispassed() const;
  void set_a_acaptiveispassed(bool value);
  private:
  bool _internal_a_acaptiveispassed() const;
  void _internal_set_a_acaptiveispassed(bool value);
  public:

  // required bool a_aParentalControlEnabled = 2;
  bool has_a_aparentalcontrolenabled() const;
  private:
  bool _internal_has_a_aparentalcontrolenabled() const;
  public:
  void clear_a_aparentalcontrolenabled();
  bool a_aparentalcontrolenabled() const;
  void set_a_aparentalcontrolenabled(bool value);
  private:
  bool _internal_a_aparentalcontrolenabled() const;
  void _internal_set_a_aparentalcontrolenabled(bool value);
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor)
 private:
  class _Internal;

  // helper for ByteSizeLong()
  size_t RequiredFieldsByteSizeFallback() const;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string> a_adnssuffixlist_;
    bool a_acaptiveispassed_;
    bool a_aparentalcontrolenabled_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Reply_PTRRServiceConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Reply_PTRRServiceConstructor) */ {
 public:
  inline Reply_PTRRServiceConstructor() : Reply_PTRRServiceConstructor(nullptr) {}
  ~Reply_PTRRServiceConstructor() override;
  explicit PROTOBUF_CONSTEXPR Reply_PTRRServiceConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Reply_PTRRServiceConstructor(const Reply_PTRRServiceConstructor& from);
  Reply_PTRRServiceConstructor(Reply_PTRRServiceConstructor&& from) noexcept
    : Reply_PTRRServiceConstructor() {
    *this = ::std::move(from);
  }

  inline Reply_PTRRServiceConstructor& operator=(const Reply_PTRRServiceConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Reply_PTRRServiceConstructor& operator=(Reply_PTRRServiceConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Reply_PTRRServiceConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Reply_PTRRServiceConstructor* internal_default_instance() {
    return reinterpret_cast<const Reply_PTRRServiceConstructor*>(
               &_Reply_PTRRServiceConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    44;

  friend void swap(Reply_PTRRServiceConstructor& a, Reply_PTRRServiceConstructor& b) {
    a.Swap(&b);
  }
  inline void Swap(Reply_PTRRServiceConstructor* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Reply_PTRRServiceConstructor* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Reply_PTRRServiceConstructor* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Reply_PTRRServiceConstructor>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Reply_PTRRServiceConstructor& from);
  void MergeFrom(const Reply_PTRRServiceConstructor& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

