toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  Msg_NotifyObserver* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_NotifyObserver>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_NotifyObserver& from);
  void MergeFrom(const Msg_NotifyObserver& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_NotifyObserver* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_NotifyObserver";
  }
  protected:
  explicit Msg_NotifyObserver(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAATopicFieldNumber = 1,
    kAADataFieldNumber = 2,
  };
  // required string a_aTopic = 1;
  bool has_a_atopic() const;
  private:
  bool _internal_has_a_atopic() const;
  public:
  void clear_a_atopic();
  const std::string& a_atopic() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_atopic(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_atopic();
  PROTOBUF_NODISCARD std::string* release_a_atopic();
  void set_allocated_a_atopic(std::string* a_atopic);
  private:
  const std::string& _internal_a_atopic() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_atopic(const std::string& value);
  std::string* _internal_mutable_a_atopic();
  public:

  // required string a_aData = 2;
  bool has_a_adata() const;
  private:
  bool _internal_has_a_adata() const;
  public:
  void clear_a_adata();
  const std::string& a_adata() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_adata(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_adata();
  PROTOBUF_NODISCARD std::string* release_a_adata();
  void set_allocated_a_adata(std::string* a_adata);
  private:
  const std::string& _internal_a_adata() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_adata(const std::string& value);
  std::string* _internal_mutable_a_adata();
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_NotifyObserver)
 private:
  class _Internal;

  // helper for ByteSizeLong()
  size_t RequiredFieldsByteSizeFallback() const;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_atopic_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_adata_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_GetSocketData final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_GetSocketData) */ {
 public:
  inline Msg_GetSocketData() : Msg_GetSocketData(nullptr) {}
  ~Msg_GetSocketData() override;
  explicit PROTOBUF_CONSTEXPR Msg_GetSocketData(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_GetSocketData(const Msg_GetSocketData& from);
  Msg_GetSocketData(Msg_GetSocketData&& from) noexcept
    : Msg_GetSocketData() {
    *this = ::std::move(from);
  }

  inline Msg_GetSocketData& operator=(const Msg_GetSocketData& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_GetSocketData& operator=(Msg_GetSocketData&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_GetSocketData& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_GetSocketData* internal_default_instance() {
    return reinterpret_cast<const Msg_GetSocketData*>(
               &_Msg_GetSocketData_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    48;

  friend void swap(Msg_GetSocketData& a, Msg_GetSocketData& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_GetSocketData* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_GetSocketData* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_GetSocketData* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_GetSocketData>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_GetSocketData& from);
  void MergeFrom(const Msg_GetSocketData& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

