toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_GetSocketData* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_GetSocketData";
  }
  protected:
  explicit Msg_GetSocketData(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_GetSocketData)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Reply_GetSocketData final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Reply_GetSocketData) */ {
 public:
  inline Reply_GetSocketData() : Reply_GetSocketData(nullptr) {}
  ~Reply_GetSocketData() override;
  explicit PROTOBUF_CONSTEXPR Reply_GetSocketData(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Reply_GetSocketData(const Reply_GetSocketData& from);
  Reply_GetSocketData(Reply_GetSocketData&& from) noexcept
    : Reply_GetSocketData() {
    *this = ::std::move(from);
  }

  inline Reply_GetSocketData& operator=(const Reply_GetSocketData& from) {
    CopyFrom(from);
    return *this;
  }
  inline Reply_GetSocketData& operator=(Reply_GetSocketData&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Reply_GetSocketData& default_instance() {
    return *internal_default_instance();
  }
  static inline const Reply_GetSocketData* internal_default_instance() {
    return reinterpret_cast<const Reply_GetSocketData*>(
               &_Reply_GetSocketData_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    49;

  friend void swap(Reply_GetSocketData& a, Reply_GetSocketData& b) {
    a.Swap(&b);
  }
  inline void Swap(Reply_GetSocketData* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Reply_GetSocketData* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Reply_GetSocketData* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Reply_GetSocketData>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Reply_GetSocketData& from);
  void MergeFrom(const Reply_GetSocketData& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Reply_GetSocketData* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Reply_GetSocketData";
  }
  protected:
  explicit Reply_GetSocketData(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kADataFieldNumber = 1,
  };
  // required .protobuf.mozilla.net.SocketDataArgs a_data = 1;
  bool has_a_data() const;
  private:
  bool _internal_has_a_data() const;
  public:
  void clear_a_data();
  const ::protobuf::mozilla::net::SocketDataArgs& a_data() const;
  PROTOBUF_NODISCARD ::protobuf::mozilla::net::SocketDataArgs* release_a_data();
  ::protobuf::mozilla::net::SocketDataArgs* mutable_a_data();
  void set_allocated_a_data(::protobuf::mozilla::net::SocketDataArgs* a_data);
  private:
  const ::protobuf::mozilla::net::SocketDataArgs& _internal_a_data() const;
  ::protobuf::mozilla::net::SocketDataArgs* _internal_mutable_a_data();
  public:
  void unsafe_arena_set_allocated_a_data(
      ::protobuf::mozilla::net::SocketDataArgs* a_data);
  ::protobuf::mozilla::net::SocketDataArgs* unsafe_arena_release_a_data();

