toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Reply_GetSocketData)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::protobuf::mozilla::net::SocketDataArgs* a_data_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_GetDNSCacheEntries final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_GetDNSCacheEntries) */ {
 public:
  inline Msg_GetDNSCacheEntries() : Msg_GetDNSCacheEntries(nullptr) {}
  ~Msg_GetDNSCacheEntries() override;
  explicit PROTOBUF_CONSTEXPR Msg_GetDNSCacheEntries(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_GetDNSCacheEntries(const Msg_GetDNSCacheEntries& from);
  Msg_GetDNSCacheEntries(Msg_GetDNSCacheEntries&& from) noexcept
    : Msg_GetDNSCacheEntries() {
    *this = ::std::move(from);
  }

  inline Msg_GetDNSCacheEntries& operator=(const Msg_GetDNSCacheEntries& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_GetDNSCacheEntries& operator=(Msg_GetDNSCacheEntries&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_GetDNSCacheEntries& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_GetDNSCacheEntries* internal_default_instance() {
    return reinterpret_cast<const Msg_GetDNSCacheEntries*>(
               &_Msg_GetDNSCacheEntries_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    50;

  friend void swap(Msg_GetDNSCacheEntries& a, Msg_GetDNSCacheEntries& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_GetDNSCacheEntries* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_GetDNSCacheEntries* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_GetDNSCacheEntries* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_GetDNSCacheEntries>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_GetDNSCacheEntries& from);
  void MergeFrom(const Msg_GetDNSCacheEntries& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_GetDNSCacheEntries* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_GetDNSCacheEntries";
  }
  protected:
  explicit Msg_GetDNSCacheEntries(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_GetDNSCacheEntries)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Reply_GetDNSCacheEntries final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries) */ {
 public:
  inline Reply_GetDNSCacheEntries() : Reply_GetDNSCacheEntries(nullptr) {}
  ~Reply_GetDNSCacheEntries() override;
  explicit PROTOBUF_CONSTEXPR Reply_GetDNSCacheEntries(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Reply_GetDNSCacheEntries(const Reply_GetDNSCacheEntries& from);
  Reply_GetDNSCacheEntries(Reply_GetDNSCacheEntries&& from) noexcept
    : Reply_GetDNSCacheEntries() {
    *this = ::std::move(from);
  }

  inline Reply_GetDNSCacheEntries& operator=(const Reply_GetDNSCacheEntries& from) {
    CopyFrom(from);
    return *this;
  }
  inline Reply_GetDNSCacheEntries& operator=(Reply_GetDNSCacheEntries&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

