toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  static const Reply_GetDNSCacheEntries& default_instance() {
    return *internal_default_instance();
  }
  static inline const Reply_GetDNSCacheEntries* internal_default_instance() {
    return reinterpret_cast<const Reply_GetDNSCacheEntries*>(
               &_Reply_GetDNSCacheEntries_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    51;

  friend void swap(Reply_GetDNSCacheEntries& a, Reply_GetDNSCacheEntries& b) {
    a.Swap(&b);
  }
  inline void Swap(Reply_GetDNSCacheEntries* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Reply_GetDNSCacheEntries* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Reply_GetDNSCacheEntries* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Reply_GetDNSCacheEntries>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Reply_GetDNSCacheEntries& from);
  void MergeFrom(const Reply_GetDNSCacheEntries& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Reply_GetDNSCacheEntries* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries";
  }
  protected:
  explicit Reply_GetDNSCacheEntries(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAEntriesFieldNumber = 1,
  };
  // repeated bytes a_entries = 1;
  int a_entries_size() const;
  private:
  int _internal_a_entries_size() const;
  public:
  void clear_a_entries();
  const std::string& a_entries(int index) const;
  std::string* mutable_a_entries(int index);
  void set_a_entries(int index, const std::string& value);
  void set_a_entries(int index, std::string&& value);
  void set_a_entries(int index, const char* value);
  void set_a_entries(int index, const void* value, size_t size);
  std::string* add_a_entries();
  void add_a_entries(const std::string& value);
  void add_a_entries(std::string&& value);
  void add_a_entries(const char* value);
  void add_a_entries(const void* value, size_t size);
  const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>& a_entries() const;
  ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>* mutable_a_entries();
  private:
  const std::string& _internal_a_entries(int index) const;
  std::string* _internal_add_a_entries();
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string> a_entries_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_GetHttpConnectionData final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_GetHttpConnectionData) */ {
 public:
  inline Msg_GetHttpConnectionData() : Msg_GetHttpConnectionData(nullptr) {}
  ~Msg_GetHttpConnectionData() override;
  explicit PROTOBUF_CONSTEXPR Msg_GetHttpConnectionData(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_GetHttpConnectionData(const Msg_GetHttpConnectionData& from);
  Msg_GetHttpConnectionData(Msg_GetHttpConnectionData&& from) noexcept
    : Msg_GetHttpConnectionData() {
    *this = ::std::move(from);
  }

  inline Msg_GetHttpConnectionData& operator=(const Msg_GetHttpConnectionData& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_GetHttpConnectionData& operator=(Msg_GetHttpConnectionData&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_GetHttpConnectionData& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_GetHttpConnectionData* internal_default_instance() {
    return reinterpret_cast<const Msg_GetHttpConnectionData*>(
               &_Msg_GetHttpConnectionData_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    52;

