toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Reply_GetHttpConnectionData* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData";
  }
  protected:
  explicit Reply_GetHttpConnectionData(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAParamsFieldNumber = 1,
  };
  // repeated bytes a_params = 1;
  int a_params_size() const;
  private:
  int _internal_a_params_size() const;
  public:
  void clear_a_params();
  const std::string& a_params(int index) const;
  std::string* mutable_a_params(int index);
  void set_a_params(int index, const std::string& value);
  void set_a_params(int index, std::string&& value);
  void set_a_params(int index, const char* value);
  void set_a_params(int index, const void* value, size_t size);
  std::string* add_a_params();
  void add_a_params(const std::string& value);
  void add_a_params(std::string&& value);
  void add_a_params(const char* value);
  void add_a_params(const void* value, size_t size);
  const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>& a_params() const;
  ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>* mutable_a_params();
  private:
  const std::string& _internal_a_params(int index) const;
  std::string* _internal_add_a_params();
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string> a_params_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_GetHttp3ConnectionStatsData final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_GetHttp3ConnectionStatsData) */ {
 public:
  inline Msg_GetHttp3ConnectionStatsData() : Msg_GetHttp3ConnectionStatsData(nullptr) {}
  ~Msg_GetHttp3ConnectionStatsData() override;
  explicit PROTOBUF_CONSTEXPR Msg_GetHttp3ConnectionStatsData(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_GetHttp3ConnectionStatsData(const Msg_GetHttp3ConnectionStatsData& from);
  Msg_GetHttp3ConnectionStatsData(Msg_GetHttp3ConnectionStatsData&& from) noexcept
    : Msg_GetHttp3ConnectionStatsData() {
    *this = ::std::move(from);
  }

  inline Msg_GetHttp3ConnectionStatsData& operator=(const Msg_GetHttp3ConnectionStatsData& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_GetHttp3ConnectionStatsData& operator=(Msg_GetHttp3ConnectionStatsData&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_GetHttp3ConnectionStatsData& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_GetHttp3ConnectionStatsData* internal_default_instance() {
    return reinterpret_cast<const Msg_GetHttp3ConnectionStatsData*>(
               &_Msg_GetHttp3ConnectionStatsData_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    54;

  friend void swap(Msg_GetHttp3ConnectionStatsData& a, Msg_GetHttp3ConnectionStatsData& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_GetHttp3ConnectionStatsData* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_GetHttp3ConnectionStatsData* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_GetHttp3ConnectionStatsData* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_GetHttp3ConnectionStatsData>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_GetHttp3ConnectionStatsData& from);
  void MergeFrom(const Msg_GetHttp3ConnectionStatsData& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

