toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  Msg_RecheckIPConnectivity(const Msg_RecheckIPConnectivity& from);
  Msg_RecheckIPConnectivity(Msg_RecheckIPConnectivity&& from) noexcept
    : Msg_RecheckIPConnectivity() {
    *this = ::std::move(from);
  }

  inline Msg_RecheckIPConnectivity& operator=(const Msg_RecheckIPConnectivity& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_RecheckIPConnectivity& operator=(Msg_RecheckIPConnectivity&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_RecheckIPConnectivity& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_RecheckIPConnectivity* internal_default_instance() {
    return reinterpret_cast<const Msg_RecheckIPConnectivity*>(
               &_Msg_RecheckIPConnectivity_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    57;

  friend void swap(Msg_RecheckIPConnectivity& a, Msg_RecheckIPConnectivity& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_RecheckIPConnectivity* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_RecheckIPConnectivity* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_RecheckIPConnectivity* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_RecheckIPConnectivity>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_RecheckIPConnectivity& from);
  void MergeFrom(const Msg_RecheckIPConnectivity& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_RecheckIPConnectivity* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_RecheckIPConnectivity";
  }
  protected:
  explicit Msg_RecheckIPConnectivity(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_RecheckIPConnectivity)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_RecheckDNS final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_RecheckDNS) */ {
 public:
  inline Msg_RecheckDNS() : Msg_RecheckDNS(nullptr) {}
  ~Msg_RecheckDNS() override;
  explicit PROTOBUF_CONSTEXPR Msg_RecheckDNS(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_RecheckDNS(const Msg_RecheckDNS& from);
  Msg_RecheckDNS(Msg_RecheckDNS&& from) noexcept
    : Msg_RecheckDNS() {
    *this = ::std::move(from);
  }

  inline Msg_RecheckDNS& operator=(const Msg_RecheckDNS& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_RecheckDNS& operator=(Msg_RecheckDNS&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_RecheckDNS& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_RecheckDNS* internal_default_instance() {
    return reinterpret_cast<const Msg_RecheckDNS*>(
               &_Msg_RecheckDNS_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    58;

  friend void swap(Msg_RecheckDNS& a, Msg_RecheckDNS& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_RecheckDNS* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_RecheckDNS* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_RecheckDNS* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_RecheckDNS>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_RecheckDNS& from);
  void MergeFrom(const Msg_RecheckDNS& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

