toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  friend void swap(Reply_FlushFOGData& a, Reply_FlushFOGData& b) {
    a.Swap(&b);
  }
  inline void Swap(Reply_FlushFOGData* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Reply_FlushFOGData* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Reply_FlushFOGData* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Reply_FlushFOGData>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Reply_FlushFOGData& from);
  void MergeFrom(const Reply_FlushFOGData& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Reply_FlushFOGData* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Reply_FlushFOGData";
  }
  protected:
  explicit Reply_FlushFOGData(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kABufFieldNumber = 1,
  };
  // required bytes a_buf = 1;
  bool has_a_buf() const;
  private:
  bool _internal_has_a_buf() const;
  public:
  void clear_a_buf();
  const std::string& a_buf() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_buf(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_buf();
  PROTOBUF_NODISCARD std::string* release_a_buf();
  void set_allocated_a_buf(std::string* a_buf);
  private:
  const std::string& _internal_a_buf() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_buf(const std::string& value);
  std::string* _internal_mutable_a_buf();
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Reply_FlushFOGData)
 private:
  class _Internal;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_buf_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_TestTriggerMetrics final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_TestTriggerMetrics) */ {
 public:
  inline Msg_TestTriggerMetrics() : Msg_TestTriggerMetrics(nullptr) {}
  ~Msg_TestTriggerMetrics() override;
  explicit PROTOBUF_CONSTEXPR Msg_TestTriggerMetrics(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_TestTriggerMetrics(const Msg_TestTriggerMetrics& from);
  Msg_TestTriggerMetrics(Msg_TestTriggerMetrics&& from) noexcept
    : Msg_TestTriggerMetrics() {
    *this = ::std::move(from);
  }

  inline Msg_TestTriggerMetrics& operator=(const Msg_TestTriggerMetrics& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_TestTriggerMetrics& operator=(Msg_TestTriggerMetrics&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_TestTriggerMetrics& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_TestTriggerMetrics* internal_default_instance() {
    return reinterpret_cast<const Msg_TestTriggerMetrics*>(
               &_Msg_TestTriggerMetrics_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    61;

  friend void swap(Msg_TestTriggerMetrics& a, Msg_TestTriggerMetrics& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_TestTriggerMetrics* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_TestTriggerMetrics* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_TestTriggerMetrics* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_TestTriggerMetrics>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_TestTriggerMetrics& from);
  void MergeFrom(const Msg_TestTriggerMetrics& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

