toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
class Msg_AddNetAddrOverride final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_AddNetAddrOverride) */ {
 public:
  inline Msg_AddNetAddrOverride() : Msg_AddNetAddrOverride(nullptr) {}
  ~Msg_AddNetAddrOverride() override;
  explicit PROTOBUF_CONSTEXPR Msg_AddNetAddrOverride(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_AddNetAddrOverride(const Msg_AddNetAddrOverride& from);
  Msg_AddNetAddrOverride(Msg_AddNetAddrOverride&& from) noexcept
    : Msg_AddNetAddrOverride() {
    *this = ::std::move(from);
  }

  inline Msg_AddNetAddrOverride& operator=(const Msg_AddNetAddrOverride& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_AddNetAddrOverride& operator=(Msg_AddNetAddrOverride&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_AddNetAddrOverride& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_AddNetAddrOverride* internal_default_instance() {
    return reinterpret_cast<const Msg_AddNetAddrOverride*>(
               &_Msg_AddNetAddrOverride_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    63;

  friend void swap(Msg_AddNetAddrOverride& a, Msg_AddNetAddrOverride& b) {
    a.Swap(&b);
  }
  inline void Swap(Msg_AddNetAddrOverride* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Msg_AddNetAddrOverride* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Msg_AddNetAddrOverride* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Msg_AddNetAddrOverride>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Msg_AddNetAddrOverride& from);
  void MergeFrom(const Msg_AddNetAddrOverride& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_AddNetAddrOverride* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_AddNetAddrOverride";
  }
  protected:
  explicit Msg_AddNetAddrOverride(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAAFromFieldNumber = 1,
    kAAToFieldNumber = 2,
  };
  // required bytes a_aFrom = 1;
  bool has_a_afrom() const;
  private:
  bool _internal_has_a_afrom() const;
  public:
  void clear_a_afrom();
  const std::string& a_afrom() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_afrom(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_afrom();
  PROTOBUF_NODISCARD std::string* release_a_afrom();
  void set_allocated_a_afrom(std::string* a_afrom);
  private:
  const std::string& _internal_a_afrom() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_afrom(const std::string& value);
  std::string* _internal_mutable_a_afrom();
  public:

  // required bytes a_aTo = 2;
  bool has_a_ato() const;
  private:
  bool _internal_has_a_ato() const;
  public:
  void clear_a_ato();
  const std::string& a_ato() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_ato(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_ato();
  PROTOBUF_NODISCARD std::string* release_a_ato();
  void set_allocated_a_ato(std::string* a_ato);
  private:
  const std::string& _internal_a_ato() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_ato(const std::string& value);
  std::string* _internal_mutable_a_ato();
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_AddNetAddrOverride)
 private:
  class _Internal;

  // helper for ByteSizeLong()
  size_t RequiredFieldsByteSizeFallback() const;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_afrom_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_ato_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Msg_ClearNetAddrOverrides final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Msg_ClearNetAddrOverrides) */ {
 public:
  inline Msg_ClearNetAddrOverrides() : Msg_ClearNetAddrOverrides(nullptr) {}
  ~Msg_ClearNetAddrOverrides() override;
  explicit PROTOBUF_CONSTEXPR Msg_ClearNetAddrOverrides(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Msg_ClearNetAddrOverrides(const Msg_ClearNetAddrOverrides& from);
  Msg_ClearNetAddrOverrides(Msg_ClearNetAddrOverrides&& from) noexcept
    : Msg_ClearNetAddrOverrides() {
    *this = ::std::move(from);
  }

  inline Msg_ClearNetAddrOverrides& operator=(const Msg_ClearNetAddrOverrides& from) {
    CopyFrom(from);
    return *this;
  }
  inline Msg_ClearNetAddrOverrides& operator=(Msg_ClearNetAddrOverrides&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Msg_ClearNetAddrOverrides& default_instance() {
    return *internal_default_instance();
  }
  static inline const Msg_ClearNetAddrOverrides* internal_default_instance() {
    return reinterpret_cast<const Msg_ClearNetAddrOverrides*>(
               &_Msg_ClearNetAddrOverrides_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    64;

