toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
  private:
  void SharedCtor(::PROTOBUF_NAMESPACE_ID::Arena* arena, bool is_message_owned);
  void SharedDtor();
  void SetCachedSize(int size) const;
  void InternalSwap(Msg_PDNSRequestConstructor* other);

  private:
  friend class ::PROTOBUF_NAMESPACE_ID::internal::AnyMetadata;
  static ::PROTOBUF_NAMESPACE_ID::StringPiece FullMessageName() {
    return "protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor";
  }
  protected:
  explicit Msg_PDNSRequestConstructor(::PROTOBUF_NAMESPACE_ID::Arena* arena,
                       bool is_message_owned = false);
  public:

  std::string GetTypeName() const final;

  // nested types ----------------------------------------------------

  // accessors -------------------------------------------------------

  enum : int {
    kAHostNameFieldNumber = 1,
    kATrrServerFieldNumber = 2,
    kAOriginAttributesFieldNumber = 5,
    kAFlagsFieldNumber = 6,
    kAPortFieldNumber = 3,
    kATypeFieldNumber = 4,
  };
  // required string a_hostName = 1;
  bool has_a_hostname() const;
  private:
  bool _internal_has_a_hostname() const;
  public:
  void clear_a_hostname();
  const std::string& a_hostname() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_hostname(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_hostname();
  PROTOBUF_NODISCARD std::string* release_a_hostname();
  void set_allocated_a_hostname(std::string* a_hostname);
  private:
  const std::string& _internal_a_hostname() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_hostname(const std::string& value);
  std::string* _internal_mutable_a_hostname();
  public:

  // required string a_trrServer = 2;
  bool has_a_trrserver() const;
  private:
  bool _internal_has_a_trrserver() const;
  public:
  void clear_a_trrserver();
  const std::string& a_trrserver() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_trrserver(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_trrserver();
  PROTOBUF_NODISCARD std::string* release_a_trrserver();
  void set_allocated_a_trrserver(std::string* a_trrserver);
  private:
  const std::string& _internal_a_trrserver() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_trrserver(const std::string& value);
  std::string* _internal_mutable_a_trrserver();
  public:

  // required bytes a_originAttributes = 5;
  bool has_a_originattributes() const;
  private:
  bool _internal_has_a_originattributes() const;
  public:
  void clear_a_originattributes();
  const std::string& a_originattributes() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_originattributes(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_originattributes();
  PROTOBUF_NODISCARD std::string* release_a_originattributes();
  void set_allocated_a_originattributes(std::string* a_originattributes);
  private:
  const std::string& _internal_a_originattributes() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_originattributes(const std::string& value);
  std::string* _internal_mutable_a_originattributes();
  public:

  // required bytes a_flags = 6;
  bool has_a_flags() const;
  private:
  bool _internal_has_a_flags() const;
  public:
  void clear_a_flags();
  const std::string& a_flags() const;
  template <typename ArgT0 = const std::string&, typename... ArgT>
  void set_a_flags(ArgT0&& arg0, ArgT... args);
  std::string* mutable_a_flags();
  PROTOBUF_NODISCARD std::string* release_a_flags();
  void set_allocated_a_flags(std::string* a_flags);
  private:
  const std::string& _internal_a_flags() const;
  inline PROTOBUF_ALWAYS_INLINE void _internal_set_a_flags(const std::string& value);
  std::string* _internal_mutable_a_flags();
  public:

  // required sint32 a_port = 3;
  bool has_a_port() const;
  private:
  bool _internal_has_a_port() const;
  public:
  void clear_a_port();
  int32_t a_port() const;
  void set_a_port(int32_t value);
  private:
  int32_t _internal_a_port() const;
  void _internal_set_a_port(int32_t value);
  public:

  // required uint32 a_type = 4;
  bool has_a_type() const;
  private:
  bool _internal_has_a_type() const;
  public:
  void clear_a_type();
  uint32_t a_type() const;
  void set_a_type(uint32_t value);
  private:
  uint32_t _internal_a_type() const;
  void _internal_set_a_type(uint32_t value);
  public:

  // @@protoc_insertion_point(class_scope:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor)
 private:
  class _Internal;

  // helper for ByteSizeLong()
  size_t RequiredFieldsByteSizeFallback() const;

  template <typename T> friend class ::PROTOBUF_NAMESPACE_ID::Arena::InternalHelper;
  typedef void InternalArenaConstructable_;
  typedef void DestructorSkippable_;
  struct Impl_ {
    ::PROTOBUF_NAMESPACE_ID::internal::HasBits<1> _has_bits_;
    mutable ::PROTOBUF_NAMESPACE_ID::internal::CachedSize _cached_size_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_hostname_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_trrserver_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_originattributes_;
    ::PROTOBUF_NAMESPACE_ID::internal::ArenaStringPtr a_flags_;
    int32_t a_port_;
    uint32_t a_type_;
  };
  union { Impl_ _impl_; };
  friend struct ::TableStruct_PSocketProcess_2eproto;
};
// -------------------------------------------------------------------

class Reply_PDNSRequestConstructor final :
    public ::PROTOBUF_NAMESPACE_ID::MessageLite /* @@protoc_insertion_point(class_definition:protobuf.mozilla.net.PSocketProcess.Reply_PDNSRequestConstructor) */ {
 public:
  inline Reply_PDNSRequestConstructor() : Reply_PDNSRequestConstructor(nullptr) {}
  ~Reply_PDNSRequestConstructor() override;
  explicit PROTOBUF_CONSTEXPR Reply_PDNSRequestConstructor(::PROTOBUF_NAMESPACE_ID::internal::ConstantInitialized);

  Reply_PDNSRequestConstructor(const Reply_PDNSRequestConstructor& from);
  Reply_PDNSRequestConstructor(Reply_PDNSRequestConstructor&& from) noexcept
    : Reply_PDNSRequestConstructor() {
    *this = ::std::move(from);
  }

  inline Reply_PDNSRequestConstructor& operator=(const Reply_PDNSRequestConstructor& from) {
    CopyFrom(from);
    return *this;
  }
  inline Reply_PDNSRequestConstructor& operator=(Reply_PDNSRequestConstructor&& from) noexcept {
    if (this == &from) return *this;
    if (GetOwningArena() == from.GetOwningArena()
  #ifdef PROTOBUF_FORCE_COPY_IN_MOVE
        && GetOwningArena() != nullptr
  #endif  // !PROTOBUF_FORCE_COPY_IN_MOVE
    ) {
      InternalSwap(&from);
    } else {
      CopyFrom(from);
    }
    return *this;
  }

  inline const std::string& unknown_fields() const {
    return _internal_metadata_.unknown_fields<std::string>(::PROTOBUF_NAMESPACE_ID::internal::GetEmptyString);
  }
  inline std::string* mutable_unknown_fields() {
    return _internal_metadata_.mutable_unknown_fields<std::string>();
  }

  static const Reply_PDNSRequestConstructor& default_instance() {
    return *internal_default_instance();
  }
  static inline const Reply_PDNSRequestConstructor* internal_default_instance() {
    return reinterpret_cast<const Reply_PDNSRequestConstructor*>(
               &_Reply_PDNSRequestConstructor_default_instance_);
  }
  static constexpr int kIndexInFileMessages =
    66;

  friend void swap(Reply_PDNSRequestConstructor& a, Reply_PDNSRequestConstructor& b) {
    a.Swap(&b);
  }
  inline void Swap(Reply_PDNSRequestConstructor* other) {
    if (other == this) return;
  #ifdef PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() != nullptr &&
        GetOwningArena() == other->GetOwningArena()) {
   #else  // PROTOBUF_FORCE_COPY_IN_SWAP
    if (GetOwningArena() == other->GetOwningArena()) {
  #endif  // !PROTOBUF_FORCE_COPY_IN_SWAP
      InternalSwap(other);
    } else {
      ::PROTOBUF_NAMESPACE_ID::internal::GenericSwap(this, other);
    }
  }
  void UnsafeArenaSwap(Reply_PDNSRequestConstructor* other) {
    if (other == this) return;
    GOOGLE_DCHECK(GetOwningArena() == other->GetOwningArena());
    InternalSwap(other);
  }

  // implements Message ----------------------------------------------

  Reply_PDNSRequestConstructor* New(::PROTOBUF_NAMESPACE_ID::Arena* arena = nullptr) const final {
    return CreateMaybeMessage<Reply_PDNSRequestConstructor>(arena);
  }
  void CheckTypeAndMergeFrom(const ::PROTOBUF_NAMESPACE_ID::MessageLite& from)  final;
  void CopyFrom(const Reply_PDNSRequestConstructor& from);
  void MergeFrom(const Reply_PDNSRequestConstructor& from);
  PROTOBUF_ATTRIBUTE_REINITIALIZES void Clear() final;
  bool IsInitialized() const final;

  size_t ByteSizeLong() const final;
  const char* _InternalParse(const char* ptr, ::PROTOBUF_NAMESPACE_ID::internal::ParseContext* ctx) final;
  uint8_t* _InternalSerialize(
      uint8_t* target, ::PROTOBUF_NAMESPACE_ID::io::EpsCopyOutputStream* stream) const final;
  int GetCachedSize() const final { return _impl_._cached_size_.Get(); }

