toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// required .protobuf.mozilla.dom.MemoryReport a_aReport = 1;
inline bool Msg_AddMemoryReport::_internal_has_a_areport() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  PROTOBUF_ASSUME(!value || _impl_.a_areport_ != nullptr);
  return value;
}
inline bool Msg_AddMemoryReport::has_a_areport() const {
  return _internal_has_a_areport();
}
inline const ::protobuf::mozilla::dom::MemoryReport& Msg_AddMemoryReport::_internal_a_areport() const {
  const ::protobuf::mozilla::dom::MemoryReport* p = _impl_.a_areport_;
  return p != nullptr ? *p : reinterpret_cast<const ::protobuf::mozilla::dom::MemoryReport&>(
      ::protobuf::mozilla::dom::_MemoryReport_default_instance_);
}
inline const ::protobuf::mozilla::dom::MemoryReport& Msg_AddMemoryReport::a_areport() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_AddMemoryReport.a_aReport)
  return _internal_a_areport();
}
inline void Msg_AddMemoryReport::unsafe_arena_set_allocated_a_areport(
    ::protobuf::mozilla::dom::MemoryReport* a_areport) {
  if (GetArenaForAllocation() == nullptr) {
    delete reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_areport_);
  }
  _impl_.a_areport_ = a_areport;
  if (a_areport) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  // @@protoc_insertion_point(field_unsafe_arena_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_AddMemoryReport.a_aReport)
}
inline ::protobuf::mozilla::dom::MemoryReport* Msg_AddMemoryReport::release_a_areport() {
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::dom::MemoryReport* temp = _impl_.a_areport_;
  _impl_.a_areport_ = nullptr;
#ifdef PROTOBUF_FORCE_COPY_IN_RELEASE
  auto* old =  reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(temp);
  temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  if (GetArenaForAllocation() == nullptr) { delete old; }
#else  // PROTOBUF_FORCE_COPY_IN_RELEASE
  if (GetArenaForAllocation() != nullptr) {
    temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  }
#endif  // !PROTOBUF_FORCE_COPY_IN_RELEASE
  return temp;
}
inline ::protobuf::mozilla::dom::MemoryReport* Msg_AddMemoryReport::unsafe_arena_release_a_areport() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_AddMemoryReport.a_aReport)
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::dom::MemoryReport* temp = _impl_.a_areport_;
  _impl_.a_areport_ = nullptr;
  return temp;
}
inline ::protobuf::mozilla::dom::MemoryReport* Msg_AddMemoryReport::_internal_mutable_a_areport() {
  _impl_._has_bits_[0] |= 0x00000001u;
  if (_impl_.a_areport_ == nullptr) {
    auto* p = CreateMaybeMessage<::protobuf::mozilla::dom::MemoryReport>(GetArenaForAllocation());
    _impl_.a_areport_ = p;
  }
  return _impl_.a_areport_;
}
inline ::protobuf::mozilla::dom::MemoryReport* Msg_AddMemoryReport::mutable_a_areport() {
  ::protobuf::mozilla::dom::MemoryReport* _msg = _internal_mutable_a_areport();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_AddMemoryReport.a_aReport)
  return _msg;
}
inline void Msg_AddMemoryReport::set_allocated_a_areport(::protobuf::mozilla::dom::MemoryReport* a_areport) {
  ::PROTOBUF_NAMESPACE_ID::Arena* message_arena = GetArenaForAllocation();
  if (message_arena == nullptr) {
    delete reinterpret_cast< ::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_areport_);
  }
  if (a_areport) {
    ::PROTOBUF_NAMESPACE_ID::Arena* submessage_arena =
        ::PROTOBUF_NAMESPACE_ID::Arena::InternalGetOwningArena(
                reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(a_areport));
    if (message_arena != submessage_arena) {
      a_areport = ::PROTOBUF_NAMESPACE_ID::internal::GetOwnedMessage(
          message_arena, a_areport, submessage_arena);
    }
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_areport_ = a_areport;
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_AddMemoryReport.a_aReport)
}

// -------------------------------------------------------------------

// Msg_AccumulateChildHistograms

// repeated bytes a_accumulations = 1;
inline int Msg_AccumulateChildHistograms::_internal_a_accumulations_size() const {
  return _impl_.a_accumulations_.size();
}
inline int Msg_AccumulateChildHistograms::a_accumulations_size() const {
  return _internal_a_accumulations_size();
}
inline void Msg_AccumulateChildHistograms::clear_a_accumulations() {
  _impl_.a_accumulations_.Clear();
}
inline std::string* Msg_AccumulateChildHistograms::add_a_accumulations() {
  std::string* _s = _internal_add_a_accumulations();
  // @@protoc_insertion_point(field_add_mutable:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms.a_accumulations)
  return _s;
}
inline const std::string& Msg_AccumulateChildHistograms::_internal_a_accumulations(int index) const {
  return _impl_.a_accumulations_.Get(index);
}
inline const std::string& Msg_AccumulateChildHistograms::a_accumulations(int index) const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms.a_accumulations)
  return _internal_a_accumulations(index);
}
inline std::string* Msg_AccumulateChildHistograms::mutable_a_accumulations(int index) {
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms.a_accumulations)
  return _impl_.a_accumulations_.Mutable(index);
}
inline void Msg_AccumulateChildHistograms::set_a_accumulations(int index, const std::string& value) {
  _impl_.a_accumulations_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms.a_accumulations)
}
inline void Msg_AccumulateChildHistograms::set_a_accumulations(int index, std::string&& value) {
  _impl_.a_accumulations_.Mutable(index)->assign(std::move(value));
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms.a_accumulations)
}
inline void Msg_AccumulateChildHistograms::set_a_accumulations(int index, const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_accumulations_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set_char:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms.a_accumulations)
}
inline void Msg_AccumulateChildHistograms::set_a_accumulations(int index, const void* value, size_t size) {
  _impl_.a_accumulations_.Mutable(index)->assign(
    reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_set_pointer:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms.a_accumulations)
}
inline std::string* Msg_AccumulateChildHistograms::_internal_add_a_accumulations() {
  return _impl_.a_accumulations_.Add();
}
inline void Msg_AccumulateChildHistograms::add_a_accumulations(const std::string& value) {
  _impl_.a_accumulations_.Add()->assign(value);
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms.a_accumulations)
}
inline void Msg_AccumulateChildHistograms::add_a_accumulations(std::string&& value) {
  _impl_.a_accumulations_.Add(std::move(value));
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms.a_accumulations)
}
inline void Msg_AccumulateChildHistograms::add_a_accumulations(const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_accumulations_.Add()->assign(value);
  // @@protoc_insertion_point(field_add_char:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms.a_accumulations)
}
inline void Msg_AccumulateChildHistograms::add_a_accumulations(const void* value, size_t size) {
  _impl_.a_accumulations_.Add()->assign(reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_add_pointer:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms.a_accumulations)
}
inline const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>&
Msg_AccumulateChildHistograms::a_accumulations() const {
  // @@protoc_insertion_point(field_list:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms.a_accumulations)
  return _impl_.a_accumulations_;
}
inline ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>*
Msg_AccumulateChildHistograms::mutable_a_accumulations() {
  // @@protoc_insertion_point(field_mutable_list:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildHistograms.a_accumulations)
  return &_impl_.a_accumulations_;
}

// -------------------------------------------------------------------

