toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// Msg_AccumulateChildKeyedHistograms

// repeated bytes a_accumulations = 1;
inline int Msg_AccumulateChildKeyedHistograms::_internal_a_accumulations_size() const {
  return _impl_.a_accumulations_.size();
}
inline int Msg_AccumulateChildKeyedHistograms::a_accumulations_size() const {
  return _internal_a_accumulations_size();
}
inline void Msg_AccumulateChildKeyedHistograms::clear_a_accumulations() {
  _impl_.a_accumulations_.Clear();
}
inline std::string* Msg_AccumulateChildKeyedHistograms::add_a_accumulations() {
  std::string* _s = _internal_add_a_accumulations();
  // @@protoc_insertion_point(field_add_mutable:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms.a_accumulations)
  return _s;
}
inline const std::string& Msg_AccumulateChildKeyedHistograms::_internal_a_accumulations(int index) const {
  return _impl_.a_accumulations_.Get(index);
}
inline const std::string& Msg_AccumulateChildKeyedHistograms::a_accumulations(int index) const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms.a_accumulations)
  return _internal_a_accumulations(index);
}
inline std::string* Msg_AccumulateChildKeyedHistograms::mutable_a_accumulations(int index) {
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms.a_accumulations)
  return _impl_.a_accumulations_.Mutable(index);
}
inline void Msg_AccumulateChildKeyedHistograms::set_a_accumulations(int index, const std::string& value) {
  _impl_.a_accumulations_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms.a_accumulations)
}
inline void Msg_AccumulateChildKeyedHistograms::set_a_accumulations(int index, std::string&& value) {
  _impl_.a_accumulations_.Mutable(index)->assign(std::move(value));
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms.a_accumulations)
}
inline void Msg_AccumulateChildKeyedHistograms::set_a_accumulations(int index, const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_accumulations_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set_char:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms.a_accumulations)
}
inline void Msg_AccumulateChildKeyedHistograms::set_a_accumulations(int index, const void* value, size_t size) {
  _impl_.a_accumulations_.Mutable(index)->assign(
    reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_set_pointer:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms.a_accumulations)
}
inline std::string* Msg_AccumulateChildKeyedHistograms::_internal_add_a_accumulations() {
  return _impl_.a_accumulations_.Add();
}
inline void Msg_AccumulateChildKeyedHistograms::add_a_accumulations(const std::string& value) {
  _impl_.a_accumulations_.Add()->assign(value);
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms.a_accumulations)
}
inline void Msg_AccumulateChildKeyedHistograms::add_a_accumulations(std::string&& value) {
  _impl_.a_accumulations_.Add(std::move(value));
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms.a_accumulations)
}
inline void Msg_AccumulateChildKeyedHistograms::add_a_accumulations(const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_accumulations_.Add()->assign(value);
  // @@protoc_insertion_point(field_add_char:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms.a_accumulations)
}
inline void Msg_AccumulateChildKeyedHistograms::add_a_accumulations(const void* value, size_t size) {
  _impl_.a_accumulations_.Add()->assign(reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_add_pointer:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms.a_accumulations)
}
inline const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>&
Msg_AccumulateChildKeyedHistograms::a_accumulations() const {
  // @@protoc_insertion_point(field_list:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms.a_accumulations)
  return _impl_.a_accumulations_;
}
inline ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>*
Msg_AccumulateChildKeyedHistograms::mutable_a_accumulations() {
  // @@protoc_insertion_point(field_mutable_list:protobuf.mozilla.net.PSocketProcess.Msg_AccumulateChildKeyedHistograms.a_accumulations)
  return &_impl_.a_accumulations_;
}

// -------------------------------------------------------------------

// Msg_UpdateChildScalars

// repeated bytes a_actions = 1;
inline int Msg_UpdateChildScalars::_internal_a_actions_size() const {
  return _impl_.a_actions_.size();
}
inline int Msg_UpdateChildScalars::a_actions_size() const {
  return _internal_a_actions_size();
}
inline void Msg_UpdateChildScalars::clear_a_actions() {
  _impl_.a_actions_.Clear();
}
inline std::string* Msg_UpdateChildScalars::add_a_actions() {
  std::string* _s = _internal_add_a_actions();
  // @@protoc_insertion_point(field_add_mutable:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildScalars.a_actions)
  return _s;
}
inline const std::string& Msg_UpdateChildScalars::_internal_a_actions(int index) const {
  return _impl_.a_actions_.Get(index);
}
inline const std::string& Msg_UpdateChildScalars::a_actions(int index) const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildScalars.a_actions)
  return _internal_a_actions(index);
}
inline std::string* Msg_UpdateChildScalars::mutable_a_actions(int index) {
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildScalars.a_actions)
  return _impl_.a_actions_.Mutable(index);
}
inline void Msg_UpdateChildScalars::set_a_actions(int index, const std::string& value) {
  _impl_.a_actions_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildScalars.a_actions)
}
inline void Msg_UpdateChildScalars::set_a_actions(int index, std::string&& value) {
  _impl_.a_actions_.Mutable(index)->assign(std::move(value));
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildScalars.a_actions)
}
inline void Msg_UpdateChildScalars::set_a_actions(int index, const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_actions_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set_char:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildScalars.a_actions)
}
inline void Msg_UpdateChildScalars::set_a_actions(int index, const void* value, size_t size) {
  _impl_.a_actions_.Mutable(index)->assign(
    reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_set_pointer:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildScalars.a_actions)
}
inline std::string* Msg_UpdateChildScalars::_internal_add_a_actions() {
  return _impl_.a_actions_.Add();
}
inline void Msg_UpdateChildScalars::add_a_actions(const std::string& value) {
  _impl_.a_actions_.Add()->assign(value);
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildScalars.a_actions)
}
inline void Msg_UpdateChildScalars::add_a_actions(std::string&& value) {
  _impl_.a_actions_.Add(std::move(value));
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildScalars.a_actions)
}
inline void Msg_UpdateChildScalars::add_a_actions(const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_actions_.Add()->assign(value);
  // @@protoc_insertion_point(field_add_char:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildScalars.a_actions)
}
inline void Msg_UpdateChildScalars::add_a_actions(const void* value, size_t size) {
  _impl_.a_actions_.Add()->assign(reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_add_pointer:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildScalars.a_actions)
}
inline const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>&
Msg_UpdateChildScalars::a_actions() const {
  // @@protoc_insertion_point(field_list:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildScalars.a_actions)
  return _impl_.a_actions_;
}
inline ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>*
Msg_UpdateChildScalars::mutable_a_actions() {
  // @@protoc_insertion_point(field_mutable_list:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildScalars.a_actions)
  return &_impl_.a_actions_;
}

// -------------------------------------------------------------------

