toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// Msg_UpdateChildKeyedScalars

// repeated bytes a_actions = 1;
inline int Msg_UpdateChildKeyedScalars::_internal_a_actions_size() const {
  return _impl_.a_actions_.size();
}
inline int Msg_UpdateChildKeyedScalars::a_actions_size() const {
  return _internal_a_actions_size();
}
inline void Msg_UpdateChildKeyedScalars::clear_a_actions() {
  _impl_.a_actions_.Clear();
}
inline std::string* Msg_UpdateChildKeyedScalars::add_a_actions() {
  std::string* _s = _internal_add_a_actions();
  // @@protoc_insertion_point(field_add_mutable:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildKeyedScalars.a_actions)
  return _s;
}
inline const std::string& Msg_UpdateChildKeyedScalars::_internal_a_actions(int index) const {
  return _impl_.a_actions_.Get(index);
}
inline const std::string& Msg_UpdateChildKeyedScalars::a_actions(int index) const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildKeyedScalars.a_actions)
  return _internal_a_actions(index);
}
inline std::string* Msg_UpdateChildKeyedScalars::mutable_a_actions(int index) {
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildKeyedScalars.a_actions)
  return _impl_.a_actions_.Mutable(index);
}
inline void Msg_UpdateChildKeyedScalars::set_a_actions(int index, const std::string& value) {
  _impl_.a_actions_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildKeyedScalars.a_actions)
}
inline void Msg_UpdateChildKeyedScalars::set_a_actions(int index, std::string&& value) {
  _impl_.a_actions_.Mutable(index)->assign(std::move(value));
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildKeyedScalars.a_actions)
}
inline void Msg_UpdateChildKeyedScalars::set_a_actions(int index, const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_actions_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set_char:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildKeyedScalars.a_actions)
}
inline void Msg_UpdateChildKeyedScalars::set_a_actions(int index, const void* value, size_t size) {
  _impl_.a_actions_.Mutable(index)->assign(
    reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_set_pointer:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildKeyedScalars.a_actions)
}
inline std::string* Msg_UpdateChildKeyedScalars::_internal_add_a_actions() {
  return _impl_.a_actions_.Add();
}
inline void Msg_UpdateChildKeyedScalars::add_a_actions(const std::string& value) {
  _impl_.a_actions_.Add()->assign(value);
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildKeyedScalars.a_actions)
}
inline void Msg_UpdateChildKeyedScalars::add_a_actions(std::string&& value) {
  _impl_.a_actions_.Add(std::move(value));
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildKeyedScalars.a_actions)
}
inline void Msg_UpdateChildKeyedScalars::add_a_actions(const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_actions_.Add()->assign(value);
  // @@protoc_insertion_point(field_add_char:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildKeyedScalars.a_actions)
}
inline void Msg_UpdateChildKeyedScalars::add_a_actions(const void* value, size_t size) {
  _impl_.a_actions_.Add()->assign(reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_add_pointer:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildKeyedScalars.a_actions)
}
inline const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>&
Msg_UpdateChildKeyedScalars::a_actions() const {
  // @@protoc_insertion_point(field_list:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildKeyedScalars.a_actions)
  return _impl_.a_actions_;
}
inline ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>*
Msg_UpdateChildKeyedScalars::mutable_a_actions() {
  // @@protoc_insertion_point(field_mutable_list:protobuf.mozilla.net.PSocketProcess.Msg_UpdateChildKeyedScalars.a_actions)
  return &_impl_.a_actions_;
}

// -------------------------------------------------------------------

// Msg_RecordChildEvents

// repeated bytes a_events = 1;
inline int Msg_RecordChildEvents::_internal_a_events_size() const {
  return _impl_.a_events_.size();
}
inline int Msg_RecordChildEvents::a_events_size() const {
  return _internal_a_events_size();
}
inline void Msg_RecordChildEvents::clear_a_events() {
  _impl_.a_events_.Clear();
}
inline std::string* Msg_RecordChildEvents::add_a_events() {
  std::string* _s = _internal_add_a_events();
  // @@protoc_insertion_point(field_add_mutable:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents.a_events)
  return _s;
}
inline const std::string& Msg_RecordChildEvents::_internal_a_events(int index) const {
  return _impl_.a_events_.Get(index);
}
inline const std::string& Msg_RecordChildEvents::a_events(int index) const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents.a_events)
  return _internal_a_events(index);
}
inline std::string* Msg_RecordChildEvents::mutable_a_events(int index) {
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents.a_events)
  return _impl_.a_events_.Mutable(index);
}
inline void Msg_RecordChildEvents::set_a_events(int index, const std::string& value) {
  _impl_.a_events_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents.a_events)
}
inline void Msg_RecordChildEvents::set_a_events(int index, std::string&& value) {
  _impl_.a_events_.Mutable(index)->assign(std::move(value));
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents.a_events)
}
inline void Msg_RecordChildEvents::set_a_events(int index, const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_events_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set_char:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents.a_events)
}
inline void Msg_RecordChildEvents::set_a_events(int index, const void* value, size_t size) {
  _impl_.a_events_.Mutable(index)->assign(
    reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_set_pointer:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents.a_events)
}
inline std::string* Msg_RecordChildEvents::_internal_add_a_events() {
  return _impl_.a_events_.Add();
}
inline void Msg_RecordChildEvents::add_a_events(const std::string& value) {
  _impl_.a_events_.Add()->assign(value);
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents.a_events)
}
inline void Msg_RecordChildEvents::add_a_events(std::string&& value) {
  _impl_.a_events_.Add(std::move(value));
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents.a_events)
}
inline void Msg_RecordChildEvents::add_a_events(const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_events_.Add()->assign(value);
  // @@protoc_insertion_point(field_add_char:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents.a_events)
}
inline void Msg_RecordChildEvents::add_a_events(const void* value, size_t size) {
  _impl_.a_events_.Add()->assign(reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_add_pointer:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents.a_events)
}
inline const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>&
Msg_RecordChildEvents::a_events() const {
  // @@protoc_insertion_point(field_list:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents.a_events)
  return _impl_.a_events_;
}
inline ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>*
Msg_RecordChildEvents::mutable_a_events() {
  // @@protoc_insertion_point(field_mutable_list:protobuf.mozilla.net.PSocketProcess.Msg_RecordChildEvents.a_events)
  return &_impl_.a_events_;
}

// -------------------------------------------------------------------

// Msg_RecordDiscardedData

// required bytes a_data = 1;
inline bool Msg_RecordDiscardedData::_internal_has_a_data() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_RecordDiscardedData::has_a_data() const {
  return _internal_has_a_data();
}
inline void Msg_RecordDiscardedData::clear_a_data() {
  _impl_.a_data_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_RecordDiscardedData::a_data() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_RecordDiscardedData.a_data)
  return _internal_a_data();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_RecordDiscardedData::set_a_data(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_data_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_RecordDiscardedData.a_data)
}
inline std::string* Msg_RecordDiscardedData::mutable_a_data() {
  std::string* _s = _internal_mutable_a_data();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_RecordDiscardedData.a_data)
  return _s;
}
inline const std::string& Msg_RecordDiscardedData::_internal_a_data() const {
  return _impl_.a_data_.Get();
}
inline void Msg_RecordDiscardedData::_internal_set_a_data(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_data_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_RecordDiscardedData::_internal_mutable_a_data() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_data_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_RecordDiscardedData::release_a_data() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_RecordDiscardedData.a_data)
  if (!_internal_has_a_data()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_data_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_data_.IsDefault()) {
    _impl_.a_data_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_RecordDiscardedData::set_allocated_a_data(std::string* a_data) {
  if (a_data != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_data_.SetAllocated(a_data, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_data_.IsDefault()) {
    _impl_.a_data_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_RecordDiscardedData.a_data)
}

// -------------------------------------------------------------------

