toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// Msg_PWebrtcTCPSocketConstructor

// optional bytes a_tabId = 1;
inline bool Msg_PWebrtcTCPSocketConstructor::_internal_has_a_tabid() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_PWebrtcTCPSocketConstructor::has_a_tabid() const {
  return _internal_has_a_tabid();
}
inline void Msg_PWebrtcTCPSocketConstructor::clear_a_tabid() {
  _impl_.a_tabid_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_PWebrtcTCPSocketConstructor::a_tabid() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PWebrtcTCPSocketConstructor.a_tabId)
  return _internal_a_tabid();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_PWebrtcTCPSocketConstructor::set_a_tabid(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_tabid_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PWebrtcTCPSocketConstructor.a_tabId)
}
inline std::string* Msg_PWebrtcTCPSocketConstructor::mutable_a_tabid() {
  std::string* _s = _internal_mutable_a_tabid();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_PWebrtcTCPSocketConstructor.a_tabId)
  return _s;
}
inline const std::string& Msg_PWebrtcTCPSocketConstructor::_internal_a_tabid() const {
  return _impl_.a_tabid_.Get();
}
inline void Msg_PWebrtcTCPSocketConstructor::_internal_set_a_tabid(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_tabid_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_PWebrtcTCPSocketConstructor::_internal_mutable_a_tabid() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_tabid_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_PWebrtcTCPSocketConstructor::release_a_tabid() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_PWebrtcTCPSocketConstructor.a_tabId)
  if (!_internal_has_a_tabid()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_tabid_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_tabid_.IsDefault()) {
    _impl_.a_tabid_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_PWebrtcTCPSocketConstructor::set_allocated_a_tabid(std::string* a_tabid) {
  if (a_tabid != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_tabid_.SetAllocated(a_tabid, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_tabid_.IsDefault()) {
    _impl_.a_tabid_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_PWebrtcTCPSocketConstructor.a_tabId)
}

// -------------------------------------------------------------------

// Reply_PWebrtcTCPSocketConstructor

// -------------------------------------------------------------------

// Msg_ObserveHttpActivity

// required .protobuf.mozilla.net.HttpActivityArgs a_aActivityArgs = 1;
inline bool Msg_ObserveHttpActivity::_internal_has_a_aactivityargs() const {
  bool value = (_impl_._has_bits_[0] & 0x00000004u) != 0;
  PROTOBUF_ASSUME(!value || _impl_.a_aactivityargs_ != nullptr);
  return value;
}
inline bool Msg_ObserveHttpActivity::has_a_aactivityargs() const {
  return _internal_has_a_aactivityargs();
}
inline const ::protobuf::mozilla::net::HttpActivityArgs& Msg_ObserveHttpActivity::_internal_a_aactivityargs() const {
  const ::protobuf::mozilla::net::HttpActivityArgs* p = _impl_.a_aactivityargs_;
  return p != nullptr ? *p : reinterpret_cast<const ::protobuf::mozilla::net::HttpActivityArgs&>(
      ::protobuf::mozilla::net::_HttpActivityArgs_default_instance_);
}
inline const ::protobuf::mozilla::net::HttpActivityArgs& Msg_ObserveHttpActivity::a_aactivityargs() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aActivityArgs)
  return _internal_a_aactivityargs();
}
inline void Msg_ObserveHttpActivity::unsafe_arena_set_allocated_a_aactivityargs(
    ::protobuf::mozilla::net::HttpActivityArgs* a_aactivityargs) {
  if (GetArenaForAllocation() == nullptr) {
    delete reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_aactivityargs_);
  }
  _impl_.a_aactivityargs_ = a_aactivityargs;
  if (a_aactivityargs) {
    _impl_._has_bits_[0] |= 0x00000004u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000004u;
  }
  // @@protoc_insertion_point(field_unsafe_arena_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aActivityArgs)
}
inline ::protobuf::mozilla::net::HttpActivityArgs* Msg_ObserveHttpActivity::release_a_aactivityargs() {
  _impl_._has_bits_[0] &= ~0x00000004u;
  ::protobuf::mozilla::net::HttpActivityArgs* temp = _impl_.a_aactivityargs_;
  _impl_.a_aactivityargs_ = nullptr;
#ifdef PROTOBUF_FORCE_COPY_IN_RELEASE
  auto* old =  reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(temp);
  temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  if (GetArenaForAllocation() == nullptr) { delete old; }
#else  // PROTOBUF_FORCE_COPY_IN_RELEASE
  if (GetArenaForAllocation() != nullptr) {
    temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  }
#endif  // !PROTOBUF_FORCE_COPY_IN_RELEASE
  return temp;
}
inline ::protobuf::mozilla::net::HttpActivityArgs* Msg_ObserveHttpActivity::unsafe_arena_release_a_aactivityargs() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aActivityArgs)
  _impl_._has_bits_[0] &= ~0x00000004u;
  ::protobuf::mozilla::net::HttpActivityArgs* temp = _impl_.a_aactivityargs_;
  _impl_.a_aactivityargs_ = nullptr;
  return temp;
}
inline ::protobuf::mozilla::net::HttpActivityArgs* Msg_ObserveHttpActivity::_internal_mutable_a_aactivityargs() {
  _impl_._has_bits_[0] |= 0x00000004u;
  if (_impl_.a_aactivityargs_ == nullptr) {
    auto* p = CreateMaybeMessage<::protobuf::mozilla::net::HttpActivityArgs>(GetArenaForAllocation());
    _impl_.a_aactivityargs_ = p;
  }
  return _impl_.a_aactivityargs_;
}
inline ::protobuf::mozilla::net::HttpActivityArgs* Msg_ObserveHttpActivity::mutable_a_aactivityargs() {
  ::protobuf::mozilla::net::HttpActivityArgs* _msg = _internal_mutable_a_aactivityargs();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aActivityArgs)
  return _msg;
}
inline void Msg_ObserveHttpActivity::set_allocated_a_aactivityargs(::protobuf::mozilla::net::HttpActivityArgs* a_aactivityargs) {
  ::PROTOBUF_NAMESPACE_ID::Arena* message_arena = GetArenaForAllocation();
  if (message_arena == nullptr) {
    delete reinterpret_cast< ::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_aactivityargs_);
  }
  if (a_aactivityargs) {
    ::PROTOBUF_NAMESPACE_ID::Arena* submessage_arena =
        ::PROTOBUF_NAMESPACE_ID::Arena::InternalGetOwningArena(
                reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(a_aactivityargs));
    if (message_arena != submessage_arena) {
      a_aactivityargs = ::PROTOBUF_NAMESPACE_ID::internal::GetOwnedMessage(
          message_arena, a_aactivityargs, submessage_arena);
    }
    _impl_._has_bits_[0] |= 0x00000004u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000004u;
  }
  _impl_.a_aactivityargs_ = a_aactivityargs;
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aActivityArgs)
}

// required uint32 a_aActivityType = 2;
inline bool Msg_ObserveHttpActivity::_internal_has_a_aactivitytype() const {
  bool value = (_impl_._has_bits_[0] & 0x00000008u) != 0;
  return value;
}
inline bool Msg_ObserveHttpActivity::has_a_aactivitytype() const {
  return _internal_has_a_aactivitytype();
}
inline void Msg_ObserveHttpActivity::clear_a_aactivitytype() {
  _impl_.a_aactivitytype_ = 0u;
  _impl_._has_bits_[0] &= ~0x00000008u;
}
inline uint32_t Msg_ObserveHttpActivity::_internal_a_aactivitytype() const {
  return _impl_.a_aactivitytype_;
}
inline uint32_t Msg_ObserveHttpActivity::a_aactivitytype() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aActivityType)
  return _internal_a_aactivitytype();
}
inline void Msg_ObserveHttpActivity::_internal_set_a_aactivitytype(uint32_t value) {
  _impl_._has_bits_[0] |= 0x00000008u;
  _impl_.a_aactivitytype_ = value;
}
inline void Msg_ObserveHttpActivity::set_a_aactivitytype(uint32_t value) {
  _internal_set_a_aactivitytype(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aActivityType)
}

