toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// required uint32 a_aActivitySubtype = 3;
inline bool Msg_ObserveHttpActivity::_internal_has_a_aactivitysubtype() const {
  bool value = (_impl_._has_bits_[0] & 0x00000010u) != 0;
  return value;
}
inline bool Msg_ObserveHttpActivity::has_a_aactivitysubtype() const {
  return _internal_has_a_aactivitysubtype();
}
inline void Msg_ObserveHttpActivity::clear_a_aactivitysubtype() {
  _impl_.a_aactivitysubtype_ = 0u;
  _impl_._has_bits_[0] &= ~0x00000010u;
}
inline uint32_t Msg_ObserveHttpActivity::_internal_a_aactivitysubtype() const {
  return _impl_.a_aactivitysubtype_;
}
inline uint32_t Msg_ObserveHttpActivity::a_aactivitysubtype() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aActivitySubtype)
  return _internal_a_aactivitysubtype();
}
inline void Msg_ObserveHttpActivity::_internal_set_a_aactivitysubtype(uint32_t value) {
  _impl_._has_bits_[0] |= 0x00000010u;
  _impl_.a_aactivitysubtype_ = value;
}
inline void Msg_ObserveHttpActivity::set_a_aactivitysubtype(uint32_t value) {
  _internal_set_a_aactivitysubtype(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aActivitySubtype)
}

// required bytes a_aTimestamp = 4;
inline bool Msg_ObserveHttpActivity::_internal_has_a_atimestamp() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_ObserveHttpActivity::has_a_atimestamp() const {
  return _internal_has_a_atimestamp();
}
inline void Msg_ObserveHttpActivity::clear_a_atimestamp() {
  _impl_.a_atimestamp_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_ObserveHttpActivity::a_atimestamp() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aTimestamp)
  return _internal_a_atimestamp();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_ObserveHttpActivity::set_a_atimestamp(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_atimestamp_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aTimestamp)
}
inline std::string* Msg_ObserveHttpActivity::mutable_a_atimestamp() {
  std::string* _s = _internal_mutable_a_atimestamp();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aTimestamp)
  return _s;
}
inline const std::string& Msg_ObserveHttpActivity::_internal_a_atimestamp() const {
  return _impl_.a_atimestamp_.Get();
}
inline void Msg_ObserveHttpActivity::_internal_set_a_atimestamp(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_atimestamp_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_ObserveHttpActivity::_internal_mutable_a_atimestamp() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_atimestamp_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_ObserveHttpActivity::release_a_atimestamp() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aTimestamp)
  if (!_internal_has_a_atimestamp()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_atimestamp_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_atimestamp_.IsDefault()) {
    _impl_.a_atimestamp_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_ObserveHttpActivity::set_allocated_a_atimestamp(std::string* a_atimestamp) {
  if (a_atimestamp != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_atimestamp_.SetAllocated(a_atimestamp, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_atimestamp_.IsDefault()) {
    _impl_.a_atimestamp_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aTimestamp)
}

// required uint64 a_aExtraSizeData = 5;
inline bool Msg_ObserveHttpActivity::_internal_has_a_aextrasizedata() const {
  bool value = (_impl_._has_bits_[0] & 0x00000020u) != 0;
  return value;
}
inline bool Msg_ObserveHttpActivity::has_a_aextrasizedata() const {
  return _internal_has_a_aextrasizedata();
}
inline void Msg_ObserveHttpActivity::clear_a_aextrasizedata() {
  _impl_.a_aextrasizedata_ = uint64_t{0u};
  _impl_._has_bits_[0] &= ~0x00000020u;
}
inline uint64_t Msg_ObserveHttpActivity::_internal_a_aextrasizedata() const {
  return _impl_.a_aextrasizedata_;
}
inline uint64_t Msg_ObserveHttpActivity::a_aextrasizedata() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aExtraSizeData)
  return _internal_a_aextrasizedata();
}
inline void Msg_ObserveHttpActivity::_internal_set_a_aextrasizedata(uint64_t value) {
  _impl_._has_bits_[0] |= 0x00000020u;
  _impl_.a_aextrasizedata_ = value;
}
inline void Msg_ObserveHttpActivity::set_a_aextrasizedata(uint64_t value) {
  _internal_set_a_aextrasizedata(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aExtraSizeData)
}

// required string a_aExtraStringData = 6;
inline bool Msg_ObserveHttpActivity::_internal_has_a_aextrastringdata() const {
  bool value = (_impl_._has_bits_[0] & 0x00000002u) != 0;
  return value;
}
inline bool Msg_ObserveHttpActivity::has_a_aextrastringdata() const {
  return _internal_has_a_aextrastringdata();
}
inline void Msg_ObserveHttpActivity::clear_a_aextrastringdata() {
  _impl_.a_aextrastringdata_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000002u;
}
inline const std::string& Msg_ObserveHttpActivity::a_aextrastringdata() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aExtraStringData)
  return _internal_a_aextrastringdata();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_ObserveHttpActivity::set_a_aextrastringdata(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000002u;
 _impl_.a_aextrastringdata_.Set(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aExtraStringData)
}
inline std::string* Msg_ObserveHttpActivity::mutable_a_aextrastringdata() {
  std::string* _s = _internal_mutable_a_aextrastringdata();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aExtraStringData)
  return _s;
}
inline const std::string& Msg_ObserveHttpActivity::_internal_a_aextrastringdata() const {
  return _impl_.a_aextrastringdata_.Get();
}
inline void Msg_ObserveHttpActivity::_internal_set_a_aextrastringdata(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000002u;
  _impl_.a_aextrastringdata_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_ObserveHttpActivity::_internal_mutable_a_aextrastringdata() {
  _impl_._has_bits_[0] |= 0x00000002u;
  return _impl_.a_aextrastringdata_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_ObserveHttpActivity::release_a_aextrastringdata() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aExtraStringData)
  if (!_internal_has_a_aextrastringdata()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000002u;
  auto* p = _impl_.a_aextrastringdata_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_aextrastringdata_.IsDefault()) {
    _impl_.a_aextrastringdata_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_ObserveHttpActivity::set_allocated_a_aextrastringdata(std::string* a_aextrastringdata) {
  if (a_aextrastringdata != nullptr) {
    _impl_._has_bits_[0] |= 0x00000002u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000002u;
  }
  _impl_.a_aextrastringdata_.SetAllocated(a_aextrastringdata, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_aextrastringdata_.IsDefault()) {
    _impl_.a_aextrastringdata_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_ObserveHttpActivity.a_aExtraStringData)
}

// -------------------------------------------------------------------

// Msg_InitSocketBackground

// required bytes a_aEndpoint = 1;
inline bool Msg_InitSocketBackground::_internal_has_a_aendpoint() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_InitSocketBackground::has_a_aendpoint() const {
  return _internal_has_a_aendpoint();
}
inline void Msg_InitSocketBackground::clear_a_aendpoint() {
  _impl_.a_aendpoint_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_InitSocketBackground::a_aendpoint() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketBackground.a_aEndpoint)
  return _internal_a_aendpoint();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_InitSocketBackground::set_a_aendpoint(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_aendpoint_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketBackground.a_aEndpoint)
}
inline std::string* Msg_InitSocketBackground::mutable_a_aendpoint() {
  std::string* _s = _internal_mutable_a_aendpoint();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketBackground.a_aEndpoint)
  return _s;
}
inline const std::string& Msg_InitSocketBackground::_internal_a_aendpoint() const {
  return _impl_.a_aendpoint_.Get();
}
inline void Msg_InitSocketBackground::_internal_set_a_aendpoint(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_aendpoint_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_InitSocketBackground::_internal_mutable_a_aendpoint() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_aendpoint_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_InitSocketBackground::release_a_aendpoint() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketBackground.a_aEndpoint)
  if (!_internal_has_a_aendpoint()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_aendpoint_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_aendpoint_.IsDefault()) {
    _impl_.a_aendpoint_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_InitSocketBackground::set_allocated_a_aendpoint(std::string* a_aendpoint) {
  if (a_aendpoint != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_aendpoint_.SetAllocated(a_aendpoint, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_aendpoint_.IsDefault()) {
    _impl_.a_aendpoint_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketBackground.a_aEndpoint)
}

// -------------------------------------------------------------------

// Msg_PAltServiceConstructor

// -------------------------------------------------------------------

// Reply_PAltServiceConstructor

// -------------------------------------------------------------------

