toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// Msg_PProxyConfigLookupConstructor

// required bytes a_aUri = 1;
inline bool Msg_PProxyConfigLookupConstructor::_internal_has_a_auri() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_PProxyConfigLookupConstructor::has_a_auri() const {
  return _internal_has_a_auri();
}
inline void Msg_PProxyConfigLookupConstructor::clear_a_auri() {
  _impl_.a_auri_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_PProxyConfigLookupConstructor::a_auri() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PProxyConfigLookupConstructor.a_aUri)
  return _internal_a_auri();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_PProxyConfigLookupConstructor::set_a_auri(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_auri_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PProxyConfigLookupConstructor.a_aUri)
}
inline std::string* Msg_PProxyConfigLookupConstructor::mutable_a_auri() {
  std::string* _s = _internal_mutable_a_auri();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_PProxyConfigLookupConstructor.a_aUri)
  return _s;
}
inline const std::string& Msg_PProxyConfigLookupConstructor::_internal_a_auri() const {
  return _impl_.a_auri_.Get();
}
inline void Msg_PProxyConfigLookupConstructor::_internal_set_a_auri(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_auri_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_PProxyConfigLookupConstructor::_internal_mutable_a_auri() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_auri_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_PProxyConfigLookupConstructor::release_a_auri() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_PProxyConfigLookupConstructor.a_aUri)
  if (!_internal_has_a_auri()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_auri_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_auri_.IsDefault()) {
    _impl_.a_auri_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_PProxyConfigLookupConstructor::set_allocated_a_auri(std::string* a_auri) {
  if (a_auri != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_auri_.SetAllocated(a_auri, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_auri_.IsDefault()) {
    _impl_.a_auri_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_PProxyConfigLookupConstructor.a_aUri)
}

// required uint32 a_aFlags = 2;
inline bool Msg_PProxyConfigLookupConstructor::_internal_has_a_aflags() const {
  bool value = (_impl_._has_bits_[0] & 0x00000002u) != 0;
  return value;
}
inline bool Msg_PProxyConfigLookupConstructor::has_a_aflags() const {
  return _internal_has_a_aflags();
}
inline void Msg_PProxyConfigLookupConstructor::clear_a_aflags() {
  _impl_.a_aflags_ = 0u;
  _impl_._has_bits_[0] &= ~0x00000002u;
}
inline uint32_t Msg_PProxyConfigLookupConstructor::_internal_a_aflags() const {
  return _impl_.a_aflags_;
}
inline uint32_t Msg_PProxyConfigLookupConstructor::a_aflags() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PProxyConfigLookupConstructor.a_aFlags)
  return _internal_a_aflags();
}
inline void Msg_PProxyConfigLookupConstructor::_internal_set_a_aflags(uint32_t value) {
  _impl_._has_bits_[0] |= 0x00000002u;
  _impl_.a_aflags_ = value;
}
inline void Msg_PProxyConfigLookupConstructor::set_a_aflags(uint32_t value) {
  _internal_set_a_aflags(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PProxyConfigLookupConstructor.a_aFlags)
}

// -------------------------------------------------------------------

// Reply_PProxyConfigLookupConstructor

// -------------------------------------------------------------------

// Msg_ExcludeHttp2OrHttp3

// required .protobuf.mozilla.net.HttpConnectionInfoCloneArgs a_aArgs = 1;
inline bool Msg_ExcludeHttp2OrHttp3::_internal_has_a_aargs() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  PROTOBUF_ASSUME(!value || _impl_.a_aargs_ != nullptr);
  return value;
}
inline bool Msg_ExcludeHttp2OrHttp3::has_a_aargs() const {
  return _internal_has_a_aargs();
}
inline const ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs& Msg_ExcludeHttp2OrHttp3::_internal_a_aargs() const {
  const ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* p = _impl_.a_aargs_;
  return p != nullptr ? *p : reinterpret_cast<const ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs&>(
      ::protobuf::mozilla::net::_HttpConnectionInfoCloneArgs_default_instance_);
}
inline const ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs& Msg_ExcludeHttp2OrHttp3::a_aargs() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_ExcludeHttp2OrHttp3.a_aArgs)
  return _internal_a_aargs();
}
inline void Msg_ExcludeHttp2OrHttp3::unsafe_arena_set_allocated_a_aargs(
    ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* a_aargs) {
  if (GetArenaForAllocation() == nullptr) {
    delete reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_aargs_);
  }
  _impl_.a_aargs_ = a_aargs;
  if (a_aargs) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  // @@protoc_insertion_point(field_unsafe_arena_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_ExcludeHttp2OrHttp3.a_aArgs)
}
inline ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* Msg_ExcludeHttp2OrHttp3::release_a_aargs() {
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* temp = _impl_.a_aargs_;
  _impl_.a_aargs_ = nullptr;
#ifdef PROTOBUF_FORCE_COPY_IN_RELEASE
  auto* old =  reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(temp);
  temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  if (GetArenaForAllocation() == nullptr) { delete old; }
#else  // PROTOBUF_FORCE_COPY_IN_RELEASE
  if (GetArenaForAllocation() != nullptr) {
    temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  }
#endif  // !PROTOBUF_FORCE_COPY_IN_RELEASE
  return temp;
}
inline ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* Msg_ExcludeHttp2OrHttp3::unsafe_arena_release_a_aargs() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_ExcludeHttp2OrHttp3.a_aArgs)
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* temp = _impl_.a_aargs_;
  _impl_.a_aargs_ = nullptr;
  return temp;
}
inline ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* Msg_ExcludeHttp2OrHttp3::_internal_mutable_a_aargs() {
  _impl_._has_bits_[0] |= 0x00000001u;
  if (_impl_.a_aargs_ == nullptr) {
    auto* p = CreateMaybeMessage<::protobuf::mozilla::net::HttpConnectionInfoCloneArgs>(GetArenaForAllocation());
    _impl_.a_aargs_ = p;
  }
  return _impl_.a_aargs_;
}
inline ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* Msg_ExcludeHttp2OrHttp3::mutable_a_aargs() {
  ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* _msg = _internal_mutable_a_aargs();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_ExcludeHttp2OrHttp3.a_aArgs)
  return _msg;
}
inline void Msg_ExcludeHttp2OrHttp3::set_allocated_a_aargs(::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* a_aargs) {
  ::PROTOBUF_NAMESPACE_ID::Arena* message_arena = GetArenaForAllocation();
  if (message_arena == nullptr) {
    delete reinterpret_cast< ::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_aargs_);
  }
  if (a_aargs) {
    ::PROTOBUF_NAMESPACE_ID::Arena* submessage_arena =
        ::PROTOBUF_NAMESPACE_ID::Arena::InternalGetOwningArena(
                reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(a_aargs));
    if (message_arena != submessage_arena) {
      a_aargs = ::PROTOBUF_NAMESPACE_ID::internal::GetOwnedMessage(
          message_arena, a_aargs, submessage_arena);
    }
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_aargs_ = a_aargs;
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_ExcludeHttp2OrHttp3.a_aArgs)
}

// -------------------------------------------------------------------

// Msg_OnConsoleMessage

// required string a_aMessage = 1;
inline bool Msg_OnConsoleMessage::_internal_has_a_amessage() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_OnConsoleMessage::has_a_amessage() const {
  return _internal_has_a_amessage();
}
inline void Msg_OnConsoleMessage::clear_a_amessage() {
  _impl_.a_amessage_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_OnConsoleMessage::a_amessage() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_OnConsoleMessage.a_aMessage)
  return _internal_a_amessage();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_OnConsoleMessage::set_a_amessage(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_amessage_.Set(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_OnConsoleMessage.a_aMessage)
}
inline std::string* Msg_OnConsoleMessage::mutable_a_amessage() {
  std::string* _s = _internal_mutable_a_amessage();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_OnConsoleMessage.a_aMessage)
  return _s;
}
inline const std::string& Msg_OnConsoleMessage::_internal_a_amessage() const {
  return _impl_.a_amessage_.Get();
}
inline void Msg_OnConsoleMessage::_internal_set_a_amessage(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_amessage_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_OnConsoleMessage::_internal_mutable_a_amessage() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_amessage_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_OnConsoleMessage::release_a_amessage() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_OnConsoleMessage.a_aMessage)
  if (!_internal_has_a_amessage()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_amessage_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_amessage_.IsDefault()) {
    _impl_.a_amessage_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_OnConsoleMessage::set_allocated_a_amessage(std::string* a_amessage) {
  if (a_amessage != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_amessage_.SetAllocated(a_amessage, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_amessage_.IsDefault()) {
    _impl_.a_amessage_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_OnConsoleMessage.a_aMessage)
}

// -------------------------------------------------------------------

// Msg_FOGData

// required bytes a_buf = 1;
inline bool Msg_FOGData::_internal_has_a_buf() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_FOGData::has_a_buf() const {
  return _internal_has_a_buf();
}
inline void Msg_FOGData::clear_a_buf() {
  _impl_.a_buf_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_FOGData::a_buf() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_FOGData.a_buf)
  return _internal_a_buf();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_FOGData::set_a_buf(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_buf_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_FOGData.a_buf)
}
inline std::string* Msg_FOGData::mutable_a_buf() {
  std::string* _s = _internal_mutable_a_buf();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_FOGData.a_buf)
  return _s;
}
inline const std::string& Msg_FOGData::_internal_a_buf() const {
  return _impl_.a_buf_.Get();
}
inline void Msg_FOGData::_internal_set_a_buf(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_buf_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_FOGData::_internal_mutable_a_buf() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_buf_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_FOGData::release_a_buf() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_FOGData.a_buf)
  if (!_internal_has_a_buf()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_buf_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_buf_.IsDefault()) {
    _impl_.a_buf_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_FOGData::set_allocated_a_buf(std::string* a_buf) {
  if (a_buf != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_buf_.SetAllocated(a_buf, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_buf_.IsDefault()) {
    _impl_.a_buf_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_FOGData.a_buf)
}

// -------------------------------------------------------------------

// Msg_Init

// required .protobuf.mozilla.net.SocketPorcessInitAttributes a_aAttributes = 1;
inline bool Msg_Init::_internal_has_a_aattributes() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  PROTOBUF_ASSUME(!value || _impl_.a_aattributes_ != nullptr);
  return value;
}
inline bool Msg_Init::has_a_aattributes() const {
  return _internal_has_a_aattributes();
}
inline const ::protobuf::mozilla::net::SocketPorcessInitAttributes& Msg_Init::_internal_a_aattributes() const {
  const ::protobuf::mozilla::net::SocketPorcessInitAttributes* p = _impl_.a_aattributes_;
  return p != nullptr ? *p : reinterpret_cast<const ::protobuf::mozilla::net::SocketPorcessInitAttributes&>(
      ::protobuf::mozilla::net::_SocketPorcessInitAttributes_default_instance_);
}
inline const ::protobuf::mozilla::net::SocketPorcessInitAttributes& Msg_Init::a_aattributes() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_Init.a_aAttributes)
  return _internal_a_aattributes();
}
inline void Msg_Init::unsafe_arena_set_allocated_a_aattributes(
    ::protobuf::mozilla::net::SocketPorcessInitAttributes* a_aattributes) {
  if (GetArenaForAllocation() == nullptr) {
    delete reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_aattributes_);
  }
  _impl_.a_aattributes_ = a_aattributes;
  if (a_aattributes) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  // @@protoc_insertion_point(field_unsafe_arena_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_Init.a_aAttributes)
}
inline ::protobuf::mozilla::net::SocketPorcessInitAttributes* Msg_Init::release_a_aattributes() {
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::net::SocketPorcessInitAttributes* temp = _impl_.a_aattributes_;
  _impl_.a_aattributes_ = nullptr;
#ifdef PROTOBUF_FORCE_COPY_IN_RELEASE
  auto* old =  reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(temp);
  temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  if (GetArenaForAllocation() == nullptr) { delete old; }
#else  // PROTOBUF_FORCE_COPY_IN_RELEASE
  if (GetArenaForAllocation() != nullptr) {
    temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  }
#endif  // !PROTOBUF_FORCE_COPY_IN_RELEASE
  return temp;
}
inline ::protobuf::mozilla::net::SocketPorcessInitAttributes* Msg_Init::unsafe_arena_release_a_aattributes() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_Init.a_aAttributes)
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::net::SocketPorcessInitAttributes* temp = _impl_.a_aattributes_;
  _impl_.a_aattributes_ = nullptr;
  return temp;
}
inline ::protobuf::mozilla::net::SocketPorcessInitAttributes* Msg_Init::_internal_mutable_a_aattributes() {
  _impl_._has_bits_[0] |= 0x00000001u;
  if (_impl_.a_aattributes_ == nullptr) {
    auto* p = CreateMaybeMessage<::protobuf::mozilla::net::SocketPorcessInitAttributes>(GetArenaForAllocation());
    _impl_.a_aattributes_ = p;
  }
  return _impl_.a_aattributes_;
}
inline ::protobuf::mozilla::net::SocketPorcessInitAttributes* Msg_Init::mutable_a_aattributes() {
  ::protobuf::mozilla::net::SocketPorcessInitAttributes* _msg = _internal_mutable_a_aattributes();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_Init.a_aAttributes)
  return _msg;
}
inline void Msg_Init::set_allocated_a_aattributes(::protobuf::mozilla::net::SocketPorcessInitAttributes* a_aattributes) {
  ::PROTOBUF_NAMESPACE_ID::Arena* message_arena = GetArenaForAllocation();
  if (message_arena == nullptr) {
    delete reinterpret_cast< ::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_aattributes_);
  }
  if (a_aattributes) {
    ::PROTOBUF_NAMESPACE_ID::Arena* submessage_arena =
        ::PROTOBUF_NAMESPACE_ID::Arena::InternalGetOwningArena(
                reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(a_aattributes));
    if (message_arena != submessage_arena) {
      a_aattributes = ::PROTOBUF_NAMESPACE_ID::internal::GetOwnedMessage(
          message_arena, a_aattributes, submessage_arena);
    }
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_aattributes_ = a_aattributes;
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_Init.a_aAttributes)
}

// -------------------------------------------------------------------

// Msg_PreferenceUpdate

// required .protobuf.mozilla.dom.Pref a_pref = 1;
inline bool Msg_PreferenceUpdate::_internal_has_a_pref() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  PROTOBUF_ASSUME(!value || _impl_.a_pref_ != nullptr);
  return value;
}
inline bool Msg_PreferenceUpdate::has_a_pref() const {
  return _internal_has_a_pref();
}
inline const ::protobuf::mozilla::dom::Pref& Msg_PreferenceUpdate::_internal_a_pref() const {
  const ::protobuf::mozilla::dom::Pref* p = _impl_.a_pref_;
  return p != nullptr ? *p : reinterpret_cast<const ::protobuf::mozilla::dom::Pref&>(
      ::protobuf::mozilla::dom::_Pref_default_instance_);
}
inline const ::protobuf::mozilla::dom::Pref& Msg_PreferenceUpdate::a_pref() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PreferenceUpdate.a_pref)
  return _internal_a_pref();
}
inline void Msg_PreferenceUpdate::unsafe_arena_set_allocated_a_pref(
    ::protobuf::mozilla::dom::Pref* a_pref) {
  if (GetArenaForAllocation() == nullptr) {
    delete reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_pref_);
  }
  _impl_.a_pref_ = a_pref;
  if (a_pref) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  // @@protoc_insertion_point(field_unsafe_arena_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_PreferenceUpdate.a_pref)
}
inline ::protobuf::mozilla::dom::Pref* Msg_PreferenceUpdate::release_a_pref() {
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::dom::Pref* temp = _impl_.a_pref_;
  _impl_.a_pref_ = nullptr;
#ifdef PROTOBUF_FORCE_COPY_IN_RELEASE
  auto* old =  reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(temp);
  temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  if (GetArenaForAllocation() == nullptr) { delete old; }
#else  // PROTOBUF_FORCE_COPY_IN_RELEASE
  if (GetArenaForAllocation() != nullptr) {
    temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  }
#endif  // !PROTOBUF_FORCE_COPY_IN_RELEASE
  return temp;
}
inline ::protobuf::mozilla::dom::Pref* Msg_PreferenceUpdate::unsafe_arena_release_a_pref() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_PreferenceUpdate.a_pref)
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::dom::Pref* temp = _impl_.a_pref_;
  _impl_.a_pref_ = nullptr;
  return temp;
}
inline ::protobuf::mozilla::dom::Pref* Msg_PreferenceUpdate::_internal_mutable_a_pref() {
  _impl_._has_bits_[0] |= 0x00000001u;
  if (_impl_.a_pref_ == nullptr) {
    auto* p = CreateMaybeMessage<::protobuf::mozilla::dom::Pref>(GetArenaForAllocation());
    _impl_.a_pref_ = p;
  }
  return _impl_.a_pref_;
}
inline ::protobuf::mozilla::dom::Pref* Msg_PreferenceUpdate::mutable_a_pref() {
  ::protobuf::mozilla::dom::Pref* _msg = _internal_mutable_a_pref();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_PreferenceUpdate.a_pref)
  return _msg;
}
inline void Msg_PreferenceUpdate::set_allocated_a_pref(::protobuf::mozilla::dom::Pref* a_pref) {
  ::PROTOBUF_NAMESPACE_ID::Arena* message_arena = GetArenaForAllocation();
  if (message_arena == nullptr) {
    delete reinterpret_cast< ::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_pref_);
  }
  if (a_pref) {
    ::PROTOBUF_NAMESPACE_ID::Arena* submessage_arena =
        ::PROTOBUF_NAMESPACE_ID::Arena::InternalGetOwningArena(
                reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(a_pref));
    if (message_arena != submessage_arena) {
      a_pref = ::PROTOBUF_NAMESPACE_ID::internal::GetOwnedMessage(
          message_arena, a_pref, submessage_arena);
    }
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_pref_ = a_pref;
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_PreferenceUpdate.a_pref)
}

// -------------------------------------------------------------------

// Msg_RequestMemoryReport

// required uint32 a_generation = 1;
inline bool Msg_RequestMemoryReport::_internal_has_a_generation() const {
  bool value = (_impl_._has_bits_[0] & 0x00000002u) != 0;
  return value;
}
inline bool Msg_RequestMemoryReport::has_a_generation() const {
  return _internal_has_a_generation();
}
inline void Msg_RequestMemoryReport::clear_a_generation() {
  _impl_.a_generation_ = 0u;
  _impl_._has_bits_[0] &= ~0x00000002u;
}
inline uint32_t Msg_RequestMemoryReport::_internal_a_generation() const {
  return _impl_.a_generation_;
}
inline uint32_t Msg_RequestMemoryReport::a_generation() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport.a_generation)
  return _internal_a_generation();
}
inline void Msg_RequestMemoryReport::_internal_set_a_generation(uint32_t value) {
  _impl_._has_bits_[0] |= 0x00000002u;
  _impl_.a_generation_ = value;
}
inline void Msg_RequestMemoryReport::set_a_generation(uint32_t value) {
  _internal_set_a_generation(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport.a_generation)
}

