toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// required bool a_anonymize = 2;
inline bool Msg_RequestMemoryReport::_internal_has_a_anonymize() const {
  bool value = (_impl_._has_bits_[0] & 0x00000004u) != 0;
  return value;
}
inline bool Msg_RequestMemoryReport::has_a_anonymize() const {
  return _internal_has_a_anonymize();
}
inline void Msg_RequestMemoryReport::clear_a_anonymize() {
  _impl_.a_anonymize_ = false;
  _impl_._has_bits_[0] &= ~0x00000004u;
}
inline bool Msg_RequestMemoryReport::_internal_a_anonymize() const {
  return _impl_.a_anonymize_;
}
inline bool Msg_RequestMemoryReport::a_anonymize() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport.a_anonymize)
  return _internal_a_anonymize();
}
inline void Msg_RequestMemoryReport::_internal_set_a_anonymize(bool value) {
  _impl_._has_bits_[0] |= 0x00000004u;
  _impl_.a_anonymize_ = value;
}
inline void Msg_RequestMemoryReport::set_a_anonymize(bool value) {
  _internal_set_a_anonymize(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport.a_anonymize)
}

// required bool a_minimizeMemoryUsage = 3;
inline bool Msg_RequestMemoryReport::_internal_has_a_minimizememoryusage() const {
  bool value = (_impl_._has_bits_[0] & 0x00000008u) != 0;
  return value;
}
inline bool Msg_RequestMemoryReport::has_a_minimizememoryusage() const {
  return _internal_has_a_minimizememoryusage();
}
inline void Msg_RequestMemoryReport::clear_a_minimizememoryusage() {
  _impl_.a_minimizememoryusage_ = false;
  _impl_._has_bits_[0] &= ~0x00000008u;
}
inline bool Msg_RequestMemoryReport::_internal_a_minimizememoryusage() const {
  return _impl_.a_minimizememoryusage_;
}
inline bool Msg_RequestMemoryReport::a_minimizememoryusage() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport.a_minimizeMemoryUsage)
  return _internal_a_minimizememoryusage();
}
inline void Msg_RequestMemoryReport::_internal_set_a_minimizememoryusage(bool value) {
  _impl_._has_bits_[0] |= 0x00000008u;
  _impl_.a_minimizememoryusage_ = value;
}
inline void Msg_RequestMemoryReport::set_a_minimizememoryusage(bool value) {
  _internal_set_a_minimizememoryusage(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport.a_minimizeMemoryUsage)
}

// optional bytes a_DMDFile = 4;
inline bool Msg_RequestMemoryReport::_internal_has_a_dmdfile() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_RequestMemoryReport::has_a_dmdfile() const {
  return _internal_has_a_dmdfile();
}
inline void Msg_RequestMemoryReport::clear_a_dmdfile() {
  _impl_.a_dmdfile_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_RequestMemoryReport::a_dmdfile() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport.a_DMDFile)
  return _internal_a_dmdfile();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_RequestMemoryReport::set_a_dmdfile(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_dmdfile_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport.a_DMDFile)
}
inline std::string* Msg_RequestMemoryReport::mutable_a_dmdfile() {
  std::string* _s = _internal_mutable_a_dmdfile();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport.a_DMDFile)
  return _s;
}
inline const std::string& Msg_RequestMemoryReport::_internal_a_dmdfile() const {
  return _impl_.a_dmdfile_.Get();
}
inline void Msg_RequestMemoryReport::_internal_set_a_dmdfile(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_dmdfile_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_RequestMemoryReport::_internal_mutable_a_dmdfile() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_dmdfile_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_RequestMemoryReport::release_a_dmdfile() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport.a_DMDFile)
  if (!_internal_has_a_dmdfile()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_dmdfile_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_dmdfile_.IsDefault()) {
    _impl_.a_dmdfile_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_RequestMemoryReport::set_allocated_a_dmdfile(std::string* a_dmdfile) {
  if (a_dmdfile != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_dmdfile_.SetAllocated(a_dmdfile, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_dmdfile_.IsDefault()) {
    _impl_.a_dmdfile_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_RequestMemoryReport.a_DMDFile)
}

// -------------------------------------------------------------------

// Reply_RequestMemoryReport

// required uint32 a_aGeneration = 1;
inline bool Reply_RequestMemoryReport::_internal_has_a_ageneration() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Reply_RequestMemoryReport::has_a_ageneration() const {
  return _internal_has_a_ageneration();
}
inline void Reply_RequestMemoryReport::clear_a_ageneration() {
  _impl_.a_ageneration_ = 0u;
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline uint32_t Reply_RequestMemoryReport::_internal_a_ageneration() const {
  return _impl_.a_ageneration_;
}
inline uint32_t Reply_RequestMemoryReport::a_ageneration() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Reply_RequestMemoryReport.a_aGeneration)
  return _internal_a_ageneration();
}
inline void Reply_RequestMemoryReport::_internal_set_a_ageneration(uint32_t value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_ageneration_ = value;
}
inline void Reply_RequestMemoryReport::set_a_ageneration(uint32_t value) {
  _internal_set_a_ageneration(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Reply_RequestMemoryReport.a_aGeneration)
}

// -------------------------------------------------------------------

