toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// Msg_SetOffline

// required bool a_offline = 1;
inline bool Msg_SetOffline::_internal_has_a_offline() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_SetOffline::has_a_offline() const {
  return _internal_has_a_offline();
}
inline void Msg_SetOffline::clear_a_offline() {
  _impl_.a_offline_ = false;
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline bool Msg_SetOffline::_internal_a_offline() const {
  return _impl_.a_offline_;
}
inline bool Msg_SetOffline::a_offline() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_SetOffline.a_offline)
  return _internal_a_offline();
}
inline void Msg_SetOffline::_internal_set_a_offline(bool value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_offline_ = value;
}
inline void Msg_SetOffline::set_a_offline(bool value) {
  _internal_set_a_offline(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_SetOffline.a_offline)
}

// -------------------------------------------------------------------

// Msg_SetConnectivity

// required bool a_connectivity = 1;
inline bool Msg_SetConnectivity::_internal_has_a_connectivity() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_SetConnectivity::has_a_connectivity() const {
  return _internal_has_a_connectivity();
}
inline void Msg_SetConnectivity::clear_a_connectivity() {
  _impl_.a_connectivity_ = false;
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline bool Msg_SetConnectivity::_internal_a_connectivity() const {
  return _impl_.a_connectivity_;
}
inline bool Msg_SetConnectivity::a_connectivity() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_SetConnectivity.a_connectivity)
  return _internal_a_connectivity();
}
inline void Msg_SetConnectivity::_internal_set_a_connectivity(bool value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_connectivity_ = value;
}
inline void Msg_SetConnectivity::set_a_connectivity(bool value) {
  _internal_set_a_connectivity(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_SetConnectivity.a_connectivity)
}

// -------------------------------------------------------------------

// Msg_InitLinuxSandbox

// optional bytes a_sandboxBroker = 1;
inline bool Msg_InitLinuxSandbox::_internal_has_a_sandboxbroker() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_InitLinuxSandbox::has_a_sandboxbroker() const {
  return _internal_has_a_sandboxbroker();
}
inline void Msg_InitLinuxSandbox::clear_a_sandboxbroker() {
  _impl_.a_sandboxbroker_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_InitLinuxSandbox::a_sandboxbroker() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_InitLinuxSandbox.a_sandboxBroker)
  return _internal_a_sandboxbroker();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_InitLinuxSandbox::set_a_sandboxbroker(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_sandboxbroker_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_InitLinuxSandbox.a_sandboxBroker)
}
inline std::string* Msg_InitLinuxSandbox::mutable_a_sandboxbroker() {
  std::string* _s = _internal_mutable_a_sandboxbroker();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_InitLinuxSandbox.a_sandboxBroker)
  return _s;
}
inline const std::string& Msg_InitLinuxSandbox::_internal_a_sandboxbroker() const {
  return _impl_.a_sandboxbroker_.Get();
}
inline void Msg_InitLinuxSandbox::_internal_set_a_sandboxbroker(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_sandboxbroker_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_InitLinuxSandbox::_internal_mutable_a_sandboxbroker() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_sandboxbroker_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_InitLinuxSandbox::release_a_sandboxbroker() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_InitLinuxSandbox.a_sandboxBroker)
  if (!_internal_has_a_sandboxbroker()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_sandboxbroker_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_sandboxbroker_.IsDefault()) {
    _impl_.a_sandboxbroker_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_InitLinuxSandbox::set_allocated_a_sandboxbroker(std::string* a_sandboxbroker) {
  if (a_sandboxbroker != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_sandboxbroker_.SetAllocated(a_sandboxbroker, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_sandboxbroker_.IsDefault()) {
    _impl_.a_sandboxbroker_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_InitLinuxSandbox.a_sandboxBroker)
}

// -------------------------------------------------------------------

// Msg_InitSocketProcessBridgeParent

// required bytes a_processId = 1;
inline bool Msg_InitSocketProcessBridgeParent::_internal_has_a_processid() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_InitSocketProcessBridgeParent::has_a_processid() const {
  return _internal_has_a_processid();
}
inline void Msg_InitSocketProcessBridgeParent::clear_a_processid() {
  _impl_.a_processid_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_InitSocketProcessBridgeParent::a_processid() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketProcessBridgeParent.a_processId)
  return _internal_a_processid();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_InitSocketProcessBridgeParent::set_a_processid(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_processid_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketProcessBridgeParent.a_processId)
}
inline std::string* Msg_InitSocketProcessBridgeParent::mutable_a_processid() {
  std::string* _s = _internal_mutable_a_processid();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketProcessBridgeParent.a_processId)
  return _s;
}
inline const std::string& Msg_InitSocketProcessBridgeParent::_internal_a_processid() const {
  return _impl_.a_processid_.Get();
}
inline void Msg_InitSocketProcessBridgeParent::_internal_set_a_processid(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_processid_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_InitSocketProcessBridgeParent::_internal_mutable_a_processid() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_processid_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_InitSocketProcessBridgeParent::release_a_processid() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketProcessBridgeParent.a_processId)
  if (!_internal_has_a_processid()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_processid_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_processid_.IsDefault()) {
    _impl_.a_processid_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_InitSocketProcessBridgeParent::set_allocated_a_processid(std::string* a_processid) {
  if (a_processid != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_processid_.SetAllocated(a_processid, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_processid_.IsDefault()) {
    _impl_.a_processid_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketProcessBridgeParent.a_processId)
}

