toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// required bytes a_endpoint = 2;
inline bool Msg_InitSocketProcessBridgeParent::_internal_has_a_endpoint() const {
  bool value = (_impl_._has_bits_[0] & 0x00000002u) != 0;
  return value;
}
inline bool Msg_InitSocketProcessBridgeParent::has_a_endpoint() const {
  return _internal_has_a_endpoint();
}
inline void Msg_InitSocketProcessBridgeParent::clear_a_endpoint() {
  _impl_.a_endpoint_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000002u;
}
inline const std::string& Msg_InitSocketProcessBridgeParent::a_endpoint() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketProcessBridgeParent.a_endpoint)
  return _internal_a_endpoint();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_InitSocketProcessBridgeParent::set_a_endpoint(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000002u;
 _impl_.a_endpoint_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketProcessBridgeParent.a_endpoint)
}
inline std::string* Msg_InitSocketProcessBridgeParent::mutable_a_endpoint() {
  std::string* _s = _internal_mutable_a_endpoint();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketProcessBridgeParent.a_endpoint)
  return _s;
}
inline const std::string& Msg_InitSocketProcessBridgeParent::_internal_a_endpoint() const {
  return _impl_.a_endpoint_.Get();
}
inline void Msg_InitSocketProcessBridgeParent::_internal_set_a_endpoint(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000002u;
  _impl_.a_endpoint_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_InitSocketProcessBridgeParent::_internal_mutable_a_endpoint() {
  _impl_._has_bits_[0] |= 0x00000002u;
  return _impl_.a_endpoint_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_InitSocketProcessBridgeParent::release_a_endpoint() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketProcessBridgeParent.a_endpoint)
  if (!_internal_has_a_endpoint()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000002u;
  auto* p = _impl_.a_endpoint_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_endpoint_.IsDefault()) {
    _impl_.a_endpoint_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_InitSocketProcessBridgeParent::set_allocated_a_endpoint(std::string* a_endpoint) {
  if (a_endpoint != nullptr) {
    _impl_._has_bits_[0] |= 0x00000002u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000002u;
  }
  _impl_.a_endpoint_.SetAllocated(a_endpoint, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_endpoint_.IsDefault()) {
    _impl_.a_endpoint_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_InitSocketProcessBridgeParent.a_endpoint)
}

// -------------------------------------------------------------------

// Msg_InitProfiler

// required bytes a_aEndpoint = 1;
inline bool Msg_InitProfiler::_internal_has_a_aendpoint() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_InitProfiler::has_a_aendpoint() const {
  return _internal_has_a_aendpoint();
}
inline void Msg_InitProfiler::clear_a_aendpoint() {
  _impl_.a_aendpoint_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_InitProfiler::a_aendpoint() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_InitProfiler.a_aEndpoint)
  return _internal_a_aendpoint();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_InitProfiler::set_a_aendpoint(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_aendpoint_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_InitProfiler.a_aEndpoint)
}
inline std::string* Msg_InitProfiler::mutable_a_aendpoint() {
  std::string* _s = _internal_mutable_a_aendpoint();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_InitProfiler.a_aEndpoint)
  return _s;
}
inline const std::string& Msg_InitProfiler::_internal_a_aendpoint() const {
  return _impl_.a_aendpoint_.Get();
}
inline void Msg_InitProfiler::_internal_set_a_aendpoint(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_aendpoint_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_InitProfiler::_internal_mutable_a_aendpoint() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_aendpoint_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_InitProfiler::release_a_aendpoint() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_InitProfiler.a_aEndpoint)
  if (!_internal_has_a_aendpoint()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_aendpoint_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_aendpoint_.IsDefault()) {
    _impl_.a_aendpoint_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_InitProfiler::set_allocated_a_aendpoint(std::string* a_aendpoint) {
  if (a_aendpoint != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_aendpoint_.SetAllocated(a_aendpoint, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_aendpoint_.IsDefault()) {
    _impl_.a_aendpoint_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_InitProfiler.a_aEndpoint)
}

// -------------------------------------------------------------------

