toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// Msg_SocketProcessTelemetryPing

// -------------------------------------------------------------------

// Msg_PHttpTransactionConstructor

// -------------------------------------------------------------------

// Reply_PHttpTransactionConstructor

// -------------------------------------------------------------------

// Msg_PHttpConnectionMgrConstructor

// required .protobuf.mozilla.net.HttpHandlerInitArgs a_aArgs = 1;
inline bool Msg_PHttpConnectionMgrConstructor::_internal_has_a_aargs() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  PROTOBUF_ASSUME(!value || _impl_.a_aargs_ != nullptr);
  return value;
}
inline bool Msg_PHttpConnectionMgrConstructor::has_a_aargs() const {
  return _internal_has_a_aargs();
}
inline const ::protobuf::mozilla::net::HttpHandlerInitArgs& Msg_PHttpConnectionMgrConstructor::_internal_a_aargs() const {
  const ::protobuf::mozilla::net::HttpHandlerInitArgs* p = _impl_.a_aargs_;
  return p != nullptr ? *p : reinterpret_cast<const ::protobuf::mozilla::net::HttpHandlerInitArgs&>(
      ::protobuf::mozilla::net::_HttpHandlerInitArgs_default_instance_);
}
inline const ::protobuf::mozilla::net::HttpHandlerInitArgs& Msg_PHttpConnectionMgrConstructor::a_aargs() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PHttpConnectionMgrConstructor.a_aArgs)
  return _internal_a_aargs();
}
inline void Msg_PHttpConnectionMgrConstructor::unsafe_arena_set_allocated_a_aargs(
    ::protobuf::mozilla::net::HttpHandlerInitArgs* a_aargs) {
  if (GetArenaForAllocation() == nullptr) {
    delete reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_aargs_);
  }
  _impl_.a_aargs_ = a_aargs;
  if (a_aargs) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  // @@protoc_insertion_point(field_unsafe_arena_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_PHttpConnectionMgrConstructor.a_aArgs)
}
inline ::protobuf::mozilla::net::HttpHandlerInitArgs* Msg_PHttpConnectionMgrConstructor::release_a_aargs() {
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::net::HttpHandlerInitArgs* temp = _impl_.a_aargs_;
  _impl_.a_aargs_ = nullptr;
#ifdef PROTOBUF_FORCE_COPY_IN_RELEASE
  auto* old =  reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(temp);
  temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  if (GetArenaForAllocation() == nullptr) { delete old; }
#else  // PROTOBUF_FORCE_COPY_IN_RELEASE
  if (GetArenaForAllocation() != nullptr) {
    temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  }
#endif  // !PROTOBUF_FORCE_COPY_IN_RELEASE
  return temp;
}
inline ::protobuf::mozilla::net::HttpHandlerInitArgs* Msg_PHttpConnectionMgrConstructor::unsafe_arena_release_a_aargs() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_PHttpConnectionMgrConstructor.a_aArgs)
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::net::HttpHandlerInitArgs* temp = _impl_.a_aargs_;
  _impl_.a_aargs_ = nullptr;
  return temp;
}
inline ::protobuf::mozilla::net::HttpHandlerInitArgs* Msg_PHttpConnectionMgrConstructor::_internal_mutable_a_aargs() {
  _impl_._has_bits_[0] |= 0x00000001u;
  if (_impl_.a_aargs_ == nullptr) {
    auto* p = CreateMaybeMessage<::protobuf::mozilla::net::HttpHandlerInitArgs>(GetArenaForAllocation());
    _impl_.a_aargs_ = p;
  }
  return _impl_.a_aargs_;
}
inline ::protobuf::mozilla::net::HttpHandlerInitArgs* Msg_PHttpConnectionMgrConstructor::mutable_a_aargs() {
  ::protobuf::mozilla::net::HttpHandlerInitArgs* _msg = _internal_mutable_a_aargs();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_PHttpConnectionMgrConstructor.a_aArgs)
  return _msg;
}
inline void Msg_PHttpConnectionMgrConstructor::set_allocated_a_aargs(::protobuf::mozilla::net::HttpHandlerInitArgs* a_aargs) {
  ::PROTOBUF_NAMESPACE_ID::Arena* message_arena = GetArenaForAllocation();
  if (message_arena == nullptr) {
    delete reinterpret_cast< ::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_aargs_);
  }
  if (a_aargs) {
    ::PROTOBUF_NAMESPACE_ID::Arena* submessage_arena =
        ::PROTOBUF_NAMESPACE_ID::Arena::InternalGetOwningArena(
                reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(a_aargs));
    if (message_arena != submessage_arena) {
      a_aargs = ::PROTOBUF_NAMESPACE_ID::internal::GetOwnedMessage(
          message_arena, a_aargs, submessage_arena);
    }
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_aargs_ = a_aargs;
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_PHttpConnectionMgrConstructor.a_aArgs)
}

// -------------------------------------------------------------------

// Reply_PHttpConnectionMgrConstructor

// -------------------------------------------------------------------

// Msg_UpdateDeviceModelId

// required string a_aModelId = 1;
inline bool Msg_UpdateDeviceModelId::_internal_has_a_amodelid() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_UpdateDeviceModelId::has_a_amodelid() const {
  return _internal_has_a_amodelid();
}
inline void Msg_UpdateDeviceModelId::clear_a_amodelid() {
  _impl_.a_amodelid_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_UpdateDeviceModelId::a_amodelid() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_UpdateDeviceModelId.a_aModelId)
  return _internal_a_amodelid();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_UpdateDeviceModelId::set_a_amodelid(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_amodelid_.Set(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_UpdateDeviceModelId.a_aModelId)
}
inline std::string* Msg_UpdateDeviceModelId::mutable_a_amodelid() {
  std::string* _s = _internal_mutable_a_amodelid();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_UpdateDeviceModelId.a_aModelId)
  return _s;
}
inline const std::string& Msg_UpdateDeviceModelId::_internal_a_amodelid() const {
  return _impl_.a_amodelid_.Get();
}
inline void Msg_UpdateDeviceModelId::_internal_set_a_amodelid(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_amodelid_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_UpdateDeviceModelId::_internal_mutable_a_amodelid() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_amodelid_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_UpdateDeviceModelId::release_a_amodelid() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_UpdateDeviceModelId.a_aModelId)
  if (!_internal_has_a_amodelid()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_amodelid_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_amodelid_.IsDefault()) {
    _impl_.a_amodelid_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_UpdateDeviceModelId::set_allocated_a_amodelid(std::string* a_amodelid) {
  if (a_amodelid != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_amodelid_.SetAllocated(a_amodelid, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_amodelid_.IsDefault()) {
    _impl_.a_amodelid_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_UpdateDeviceModelId.a_aModelId)
}

// -------------------------------------------------------------------

// Msg_OnHttpActivityDistributorActivated

// required bool a_aIsActivated = 1;
inline bool Msg_OnHttpActivityDistributorActivated::_internal_has_a_aisactivated() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_OnHttpActivityDistributorActivated::has_a_aisactivated() const {
  return _internal_has_a_aisactivated();
}
inline void Msg_OnHttpActivityDistributorActivated::clear_a_aisactivated() {
  _impl_.a_aisactivated_ = false;
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline bool Msg_OnHttpActivityDistributorActivated::_internal_a_aisactivated() const {
  return _impl_.a_aisactivated_;
}
inline bool Msg_OnHttpActivityDistributorActivated::a_aisactivated() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_OnHttpActivityDistributorActivated.a_aIsActivated)
  return _internal_a_aisactivated();
}
inline void Msg_OnHttpActivityDistributorActivated::_internal_set_a_aisactivated(bool value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_aisactivated_ = value;
}
inline void Msg_OnHttpActivityDistributorActivated::set_a_aisactivated(bool value) {
  _internal_set_a_aisactivated(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_OnHttpActivityDistributorActivated.a_aIsActivated)
}

// -------------------------------------------------------------------

// Msg_OnHttpActivityDistributorObserveProxyResponse

