toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// required bool a_aIsEnabled = 1;
inline bool Msg_OnHttpActivityDistributorObserveProxyResponse::_internal_has_a_aisenabled() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_OnHttpActivityDistributorObserveProxyResponse::has_a_aisenabled() const {
  return _internal_has_a_aisenabled();
}
inline void Msg_OnHttpActivityDistributorObserveProxyResponse::clear_a_aisenabled() {
  _impl_.a_aisenabled_ = false;
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline bool Msg_OnHttpActivityDistributorObserveProxyResponse::_internal_a_aisenabled() const {
  return _impl_.a_aisenabled_;
}
inline bool Msg_OnHttpActivityDistributorObserveProxyResponse::a_aisenabled() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_OnHttpActivityDistributorObserveProxyResponse.a_aIsEnabled)
  return _internal_a_aisenabled();
}
inline void Msg_OnHttpActivityDistributorObserveProxyResponse::_internal_set_a_aisenabled(bool value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_aisenabled_ = value;
}
inline void Msg_OnHttpActivityDistributorObserveProxyResponse::set_a_aisenabled(bool value) {
  _internal_set_a_aisenabled(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_OnHttpActivityDistributorObserveProxyResponse.a_aIsEnabled)
}

// -------------------------------------------------------------------

// Msg_OnHttpActivityDistributorObserveConnection

// required bool a_aIsEnabled = 1;
inline bool Msg_OnHttpActivityDistributorObserveConnection::_internal_has_a_aisenabled() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_OnHttpActivityDistributorObserveConnection::has_a_aisenabled() const {
  return _internal_has_a_aisenabled();
}
inline void Msg_OnHttpActivityDistributorObserveConnection::clear_a_aisenabled() {
  _impl_.a_aisenabled_ = false;
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline bool Msg_OnHttpActivityDistributorObserveConnection::_internal_a_aisenabled() const {
  return _impl_.a_aisenabled_;
}
inline bool Msg_OnHttpActivityDistributorObserveConnection::a_aisenabled() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_OnHttpActivityDistributorObserveConnection.a_aIsEnabled)
  return _internal_a_aisenabled();
}
inline void Msg_OnHttpActivityDistributorObserveConnection::_internal_set_a_aisenabled(bool value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_aisenabled_ = value;
}
inline void Msg_OnHttpActivityDistributorObserveConnection::set_a_aisenabled(bool value) {
  _internal_set_a_aisenabled(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_OnHttpActivityDistributorObserveConnection.a_aIsEnabled)
}

// -------------------------------------------------------------------

// Msg_PInputChannelThrottleQueueConstructor

// required uint32 a_meanBytesPerSecond = 1;
inline bool Msg_PInputChannelThrottleQueueConstructor::_internal_has_a_meanbytespersecond() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_PInputChannelThrottleQueueConstructor::has_a_meanbytespersecond() const {
  return _internal_has_a_meanbytespersecond();
}
inline void Msg_PInputChannelThrottleQueueConstructor::clear_a_meanbytespersecond() {
  _impl_.a_meanbytespersecond_ = 0u;
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline uint32_t Msg_PInputChannelThrottleQueueConstructor::_internal_a_meanbytespersecond() const {
  return _impl_.a_meanbytespersecond_;
}
inline uint32_t Msg_PInputChannelThrottleQueueConstructor::a_meanbytespersecond() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PInputChannelThrottleQueueConstructor.a_meanBytesPerSecond)
  return _internal_a_meanbytespersecond();
}
inline void Msg_PInputChannelThrottleQueueConstructor::_internal_set_a_meanbytespersecond(uint32_t value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_meanbytespersecond_ = value;
}
inline void Msg_PInputChannelThrottleQueueConstructor::set_a_meanbytespersecond(uint32_t value) {
  _internal_set_a_meanbytespersecond(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PInputChannelThrottleQueueConstructor.a_meanBytesPerSecond)
}

// required uint32 a_maxBytesPerSecond = 2;
inline bool Msg_PInputChannelThrottleQueueConstructor::_internal_has_a_maxbytespersecond() const {
  bool value = (_impl_._has_bits_[0] & 0x00000002u) != 0;
  return value;
}
inline bool Msg_PInputChannelThrottleQueueConstructor::has_a_maxbytespersecond() const {
  return _internal_has_a_maxbytespersecond();
}
inline void Msg_PInputChannelThrottleQueueConstructor::clear_a_maxbytespersecond() {
  _impl_.a_maxbytespersecond_ = 0u;
  _impl_._has_bits_[0] &= ~0x00000002u;
}
inline uint32_t Msg_PInputChannelThrottleQueueConstructor::_internal_a_maxbytespersecond() const {
  return _impl_.a_maxbytespersecond_;
}
inline uint32_t Msg_PInputChannelThrottleQueueConstructor::a_maxbytespersecond() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PInputChannelThrottleQueueConstructor.a_maxBytesPerSecond)
  return _internal_a_maxbytespersecond();
}
inline void Msg_PInputChannelThrottleQueueConstructor::_internal_set_a_maxbytespersecond(uint32_t value) {
  _impl_._has_bits_[0] |= 0x00000002u;
  _impl_.a_maxbytespersecond_ = value;
}
inline void Msg_PInputChannelThrottleQueueConstructor::set_a_maxbytespersecond(uint32_t value) {
  _internal_set_a_maxbytespersecond(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PInputChannelThrottleQueueConstructor.a_maxBytesPerSecond)
}

// -------------------------------------------------------------------

// Reply_PInputChannelThrottleQueueConstructor

// -------------------------------------------------------------------

// Msg_PAltSvcTransactionConstructor

// required .protobuf.mozilla.net.HttpConnectionInfoCloneArgs a_aConnInfo = 1;
inline bool Msg_PAltSvcTransactionConstructor::_internal_has_a_aconninfo() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  PROTOBUF_ASSUME(!value || _impl_.a_aconninfo_ != nullptr);
  return value;
}
inline bool Msg_PAltSvcTransactionConstructor::has_a_aconninfo() const {
  return _internal_has_a_aconninfo();
}
inline const ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs& Msg_PAltSvcTransactionConstructor::_internal_a_aconninfo() const {
  const ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* p = _impl_.a_aconninfo_;
  return p != nullptr ? *p : reinterpret_cast<const ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs&>(
      ::protobuf::mozilla::net::_HttpConnectionInfoCloneArgs_default_instance_);
}
inline const ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs& Msg_PAltSvcTransactionConstructor::a_aconninfo() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PAltSvcTransactionConstructor.a_aConnInfo)
  return _internal_a_aconninfo();
}
inline void Msg_PAltSvcTransactionConstructor::unsafe_arena_set_allocated_a_aconninfo(
    ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* a_aconninfo) {
  if (GetArenaForAllocation() == nullptr) {
    delete reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_aconninfo_);
  }
  _impl_.a_aconninfo_ = a_aconninfo;
  if (a_aconninfo) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  // @@protoc_insertion_point(field_unsafe_arena_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_PAltSvcTransactionConstructor.a_aConnInfo)
}
inline ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* Msg_PAltSvcTransactionConstructor::release_a_aconninfo() {
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* temp = _impl_.a_aconninfo_;
  _impl_.a_aconninfo_ = nullptr;
#ifdef PROTOBUF_FORCE_COPY_IN_RELEASE
  auto* old =  reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(temp);
  temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  if (GetArenaForAllocation() == nullptr) { delete old; }
#else  // PROTOBUF_FORCE_COPY_IN_RELEASE
  if (GetArenaForAllocation() != nullptr) {
    temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  }
#endif  // !PROTOBUF_FORCE_COPY_IN_RELEASE
  return temp;
}
inline ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* Msg_PAltSvcTransactionConstructor::unsafe_arena_release_a_aconninfo() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_PAltSvcTransactionConstructor.a_aConnInfo)
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* temp = _impl_.a_aconninfo_;
  _impl_.a_aconninfo_ = nullptr;
  return temp;
}
inline ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* Msg_PAltSvcTransactionConstructor::_internal_mutable_a_aconninfo() {
  _impl_._has_bits_[0] |= 0x00000001u;
  if (_impl_.a_aconninfo_ == nullptr) {
    auto* p = CreateMaybeMessage<::protobuf::mozilla::net::HttpConnectionInfoCloneArgs>(GetArenaForAllocation());
    _impl_.a_aconninfo_ = p;
  }
  return _impl_.a_aconninfo_;
}
inline ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* Msg_PAltSvcTransactionConstructor::mutable_a_aconninfo() {
  ::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* _msg = _internal_mutable_a_aconninfo();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_PAltSvcTransactionConstructor.a_aConnInfo)
  return _msg;
}
inline void Msg_PAltSvcTransactionConstructor::set_allocated_a_aconninfo(::protobuf::mozilla::net::HttpConnectionInfoCloneArgs* a_aconninfo) {
  ::PROTOBUF_NAMESPACE_ID::Arena* message_arena = GetArenaForAllocation();
  if (message_arena == nullptr) {
    delete reinterpret_cast< ::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_aconninfo_);
  }
  if (a_aconninfo) {
    ::PROTOBUF_NAMESPACE_ID::Arena* submessage_arena =
        ::PROTOBUF_NAMESPACE_ID::Arena::InternalGetOwningArena(
                reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(a_aconninfo));
    if (message_arena != submessage_arena) {
      a_aconninfo = ::PROTOBUF_NAMESPACE_ID::internal::GetOwnedMessage(
          message_arena, a_aconninfo, submessage_arena);
    }
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_aconninfo_ = a_aconninfo;
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_PAltSvcTransactionConstructor.a_aConnInfo)
}

// required uint32 a_aCaps = 2;
inline bool Msg_PAltSvcTransactionConstructor::_internal_has_a_acaps() const {
  bool value = (_impl_._has_bits_[0] & 0x00000002u) != 0;
  return value;
}
inline bool Msg_PAltSvcTransactionConstructor::has_a_acaps() const {
  return _internal_has_a_acaps();
}
inline void Msg_PAltSvcTransactionConstructor::clear_a_acaps() {
  _impl_.a_acaps_ = 0u;
  _impl_._has_bits_[0] &= ~0x00000002u;
}
inline uint32_t Msg_PAltSvcTransactionConstructor::_internal_a_acaps() const {
  return _impl_.a_acaps_;
}
inline uint32_t Msg_PAltSvcTransactionConstructor::a_acaps() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PAltSvcTransactionConstructor.a_aCaps)
  return _internal_a_acaps();
}
inline void Msg_PAltSvcTransactionConstructor::_internal_set_a_acaps(uint32_t value) {
  _impl_._has_bits_[0] |= 0x00000002u;
  _impl_.a_acaps_ = value;
}
inline void Msg_PAltSvcTransactionConstructor::set_a_acaps(uint32_t value) {
  _internal_set_a_acaps(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PAltSvcTransactionConstructor.a_aCaps)
}

// -------------------------------------------------------------------

// Reply_PAltSvcTransactionConstructor

// -------------------------------------------------------------------

// Msg_ClearSessionCache

// -------------------------------------------------------------------

// Reply_ClearSessionCache

// required bytes a_ok = 1;
inline bool Reply_ClearSessionCache::_internal_has_a_ok() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Reply_ClearSessionCache::has_a_ok() const {
  return _internal_has_a_ok();
}
inline void Reply_ClearSessionCache::clear_a_ok() {
  _impl_.a_ok_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Reply_ClearSessionCache::a_ok() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Reply_ClearSessionCache.a_ok)
  return _internal_a_ok();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Reply_ClearSessionCache::set_a_ok(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_ok_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Reply_ClearSessionCache.a_ok)
}
inline std::string* Reply_ClearSessionCache::mutable_a_ok() {
  std::string* _s = _internal_mutable_a_ok();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Reply_ClearSessionCache.a_ok)
  return _s;
}
inline const std::string& Reply_ClearSessionCache::_internal_a_ok() const {
  return _impl_.a_ok_.Get();
}
inline void Reply_ClearSessionCache::_internal_set_a_ok(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_ok_.Set(value, GetArenaForAllocation());
}
inline std::string* Reply_ClearSessionCache::_internal_mutable_a_ok() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_ok_.Mutable(GetArenaForAllocation());
}
inline std::string* Reply_ClearSessionCache::release_a_ok() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Reply_ClearSessionCache.a_ok)
  if (!_internal_has_a_ok()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_ok_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_ok_.IsDefault()) {
    _impl_.a_ok_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Reply_ClearSessionCache::set_allocated_a_ok(std::string* a_ok) {
  if (a_ok != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_ok_.SetAllocated(a_ok, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_ok_.IsDefault()) {
    _impl_.a_ok_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Reply_ClearSessionCache.a_ok)
}

// -------------------------------------------------------------------

// Msg_PTRRServiceConstructor

