toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// required bool a_aCaptiveIsPassed = 1;
inline bool Msg_PTRRServiceConstructor::_internal_has_a_acaptiveispassed() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_PTRRServiceConstructor::has_a_acaptiveispassed() const {
  return _internal_has_a_acaptiveispassed();
}
inline void Msg_PTRRServiceConstructor::clear_a_acaptiveispassed() {
  _impl_.a_acaptiveispassed_ = false;
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline bool Msg_PTRRServiceConstructor::_internal_a_acaptiveispassed() const {
  return _impl_.a_acaptiveispassed_;
}
inline bool Msg_PTRRServiceConstructor::a_acaptiveispassed() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aCaptiveIsPassed)
  return _internal_a_acaptiveispassed();
}
inline void Msg_PTRRServiceConstructor::_internal_set_a_acaptiveispassed(bool value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_acaptiveispassed_ = value;
}
inline void Msg_PTRRServiceConstructor::set_a_acaptiveispassed(bool value) {
  _internal_set_a_acaptiveispassed(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aCaptiveIsPassed)
}

// required bool a_aParentalControlEnabled = 2;
inline bool Msg_PTRRServiceConstructor::_internal_has_a_aparentalcontrolenabled() const {
  bool value = (_impl_._has_bits_[0] & 0x00000002u) != 0;
  return value;
}
inline bool Msg_PTRRServiceConstructor::has_a_aparentalcontrolenabled() const {
  return _internal_has_a_aparentalcontrolenabled();
}
inline void Msg_PTRRServiceConstructor::clear_a_aparentalcontrolenabled() {
  _impl_.a_aparentalcontrolenabled_ = false;
  _impl_._has_bits_[0] &= ~0x00000002u;
}
inline bool Msg_PTRRServiceConstructor::_internal_a_aparentalcontrolenabled() const {
  return _impl_.a_aparentalcontrolenabled_;
}
inline bool Msg_PTRRServiceConstructor::a_aparentalcontrolenabled() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aParentalControlEnabled)
  return _internal_a_aparentalcontrolenabled();
}
inline void Msg_PTRRServiceConstructor::_internal_set_a_aparentalcontrolenabled(bool value) {
  _impl_._has_bits_[0] |= 0x00000002u;
  _impl_.a_aparentalcontrolenabled_ = value;
}
inline void Msg_PTRRServiceConstructor::set_a_aparentalcontrolenabled(bool value) {
  _internal_set_a_aparentalcontrolenabled(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aParentalControlEnabled)
}

// repeated string a_aDNSSuffixList = 3;
inline int Msg_PTRRServiceConstructor::_internal_a_adnssuffixlist_size() const {
  return _impl_.a_adnssuffixlist_.size();
}
inline int Msg_PTRRServiceConstructor::a_adnssuffixlist_size() const {
  return _internal_a_adnssuffixlist_size();
}
inline void Msg_PTRRServiceConstructor::clear_a_adnssuffixlist() {
  _impl_.a_adnssuffixlist_.Clear();
}
inline std::string* Msg_PTRRServiceConstructor::add_a_adnssuffixlist() {
  std::string* _s = _internal_add_a_adnssuffixlist();
  // @@protoc_insertion_point(field_add_mutable:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aDNSSuffixList)
  return _s;
}
inline const std::string& Msg_PTRRServiceConstructor::_internal_a_adnssuffixlist(int index) const {
  return _impl_.a_adnssuffixlist_.Get(index);
}
inline const std::string& Msg_PTRRServiceConstructor::a_adnssuffixlist(int index) const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aDNSSuffixList)
  return _internal_a_adnssuffixlist(index);
}
inline std::string* Msg_PTRRServiceConstructor::mutable_a_adnssuffixlist(int index) {
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aDNSSuffixList)
  return _impl_.a_adnssuffixlist_.Mutable(index);
}
inline void Msg_PTRRServiceConstructor::set_a_adnssuffixlist(int index, const std::string& value) {
  _impl_.a_adnssuffixlist_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aDNSSuffixList)
}
inline void Msg_PTRRServiceConstructor::set_a_adnssuffixlist(int index, std::string&& value) {
  _impl_.a_adnssuffixlist_.Mutable(index)->assign(std::move(value));
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aDNSSuffixList)
}
inline void Msg_PTRRServiceConstructor::set_a_adnssuffixlist(int index, const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_adnssuffixlist_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set_char:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aDNSSuffixList)
}
inline void Msg_PTRRServiceConstructor::set_a_adnssuffixlist(int index, const char* value, size_t size) {
  _impl_.a_adnssuffixlist_.Mutable(index)->assign(
    reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_set_pointer:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aDNSSuffixList)
}
inline std::string* Msg_PTRRServiceConstructor::_internal_add_a_adnssuffixlist() {
  return _impl_.a_adnssuffixlist_.Add();
}
inline void Msg_PTRRServiceConstructor::add_a_adnssuffixlist(const std::string& value) {
  _impl_.a_adnssuffixlist_.Add()->assign(value);
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aDNSSuffixList)
}
inline void Msg_PTRRServiceConstructor::add_a_adnssuffixlist(std::string&& value) {
  _impl_.a_adnssuffixlist_.Add(std::move(value));
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aDNSSuffixList)
}
inline void Msg_PTRRServiceConstructor::add_a_adnssuffixlist(const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_adnssuffixlist_.Add()->assign(value);
  // @@protoc_insertion_point(field_add_char:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aDNSSuffixList)
}
inline void Msg_PTRRServiceConstructor::add_a_adnssuffixlist(const char* value, size_t size) {
  _impl_.a_adnssuffixlist_.Add()->assign(reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_add_pointer:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aDNSSuffixList)
}
inline const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>&
Msg_PTRRServiceConstructor::a_adnssuffixlist() const {
  // @@protoc_insertion_point(field_list:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aDNSSuffixList)
  return _impl_.a_adnssuffixlist_;
}
inline ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>*
Msg_PTRRServiceConstructor::mutable_a_adnssuffixlist() {
  // @@protoc_insertion_point(field_mutable_list:protobuf.mozilla.net.PSocketProcess.Msg_PTRRServiceConstructor.a_aDNSSuffixList)
  return &_impl_.a_adnssuffixlist_;
}

// -------------------------------------------------------------------

// Reply_PTRRServiceConstructor

// -------------------------------------------------------------------

// Msg_PNativeDNSResolverOverrideConstructor

// -------------------------------------------------------------------

// Reply_PNativeDNSResolverOverrideConstructor

// -------------------------------------------------------------------

// Msg_NotifyObserver

