toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// required string a_aTopic = 1;
inline bool Msg_NotifyObserver::_internal_has_a_atopic() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_NotifyObserver::has_a_atopic() const {
  return _internal_has_a_atopic();
}
inline void Msg_NotifyObserver::clear_a_atopic() {
  _impl_.a_atopic_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_NotifyObserver::a_atopic() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_NotifyObserver.a_aTopic)
  return _internal_a_atopic();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_NotifyObserver::set_a_atopic(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_atopic_.Set(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_NotifyObserver.a_aTopic)
}
inline std::string* Msg_NotifyObserver::mutable_a_atopic() {
  std::string* _s = _internal_mutable_a_atopic();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_NotifyObserver.a_aTopic)
  return _s;
}
inline const std::string& Msg_NotifyObserver::_internal_a_atopic() const {
  return _impl_.a_atopic_.Get();
}
inline void Msg_NotifyObserver::_internal_set_a_atopic(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_atopic_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_NotifyObserver::_internal_mutable_a_atopic() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_atopic_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_NotifyObserver::release_a_atopic() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_NotifyObserver.a_aTopic)
  if (!_internal_has_a_atopic()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_atopic_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_atopic_.IsDefault()) {
    _impl_.a_atopic_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_NotifyObserver::set_allocated_a_atopic(std::string* a_atopic) {
  if (a_atopic != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_atopic_.SetAllocated(a_atopic, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_atopic_.IsDefault()) {
    _impl_.a_atopic_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_NotifyObserver.a_aTopic)
}

// required string a_aData = 2;
inline bool Msg_NotifyObserver::_internal_has_a_adata() const {
  bool value = (_impl_._has_bits_[0] & 0x00000002u) != 0;
  return value;
}
inline bool Msg_NotifyObserver::has_a_adata() const {
  return _internal_has_a_adata();
}
inline void Msg_NotifyObserver::clear_a_adata() {
  _impl_.a_adata_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000002u;
}
inline const std::string& Msg_NotifyObserver::a_adata() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_NotifyObserver.a_aData)
  return _internal_a_adata();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_NotifyObserver::set_a_adata(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000002u;
 _impl_.a_adata_.Set(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_NotifyObserver.a_aData)
}
inline std::string* Msg_NotifyObserver::mutable_a_adata() {
  std::string* _s = _internal_mutable_a_adata();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_NotifyObserver.a_aData)
  return _s;
}
inline const std::string& Msg_NotifyObserver::_internal_a_adata() const {
  return _impl_.a_adata_.Get();
}
inline void Msg_NotifyObserver::_internal_set_a_adata(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000002u;
  _impl_.a_adata_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_NotifyObserver::_internal_mutable_a_adata() {
  _impl_._has_bits_[0] |= 0x00000002u;
  return _impl_.a_adata_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_NotifyObserver::release_a_adata() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_NotifyObserver.a_aData)
  if (!_internal_has_a_adata()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000002u;
  auto* p = _impl_.a_adata_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_adata_.IsDefault()) {
    _impl_.a_adata_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_NotifyObserver::set_allocated_a_adata(std::string* a_adata) {
  if (a_adata != nullptr) {
    _impl_._has_bits_[0] |= 0x00000002u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000002u;
  }
  _impl_.a_adata_.SetAllocated(a_adata, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_adata_.IsDefault()) {
    _impl_.a_adata_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_NotifyObserver.a_aData)
}

// -------------------------------------------------------------------

// Msg_GetSocketData

// -------------------------------------------------------------------

// Reply_GetSocketData

// required .protobuf.mozilla.net.SocketDataArgs a_data = 1;
inline bool Reply_GetSocketData::_internal_has_a_data() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  PROTOBUF_ASSUME(!value || _impl_.a_data_ != nullptr);
  return value;
}
inline bool Reply_GetSocketData::has_a_data() const {
  return _internal_has_a_data();
}
inline const ::protobuf::mozilla::net::SocketDataArgs& Reply_GetSocketData::_internal_a_data() const {
  const ::protobuf::mozilla::net::SocketDataArgs* p = _impl_.a_data_;
  return p != nullptr ? *p : reinterpret_cast<const ::protobuf::mozilla::net::SocketDataArgs&>(
      ::protobuf::mozilla::net::_SocketDataArgs_default_instance_);
}
inline const ::protobuf::mozilla::net::SocketDataArgs& Reply_GetSocketData::a_data() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Reply_GetSocketData.a_data)
  return _internal_a_data();
}
inline void Reply_GetSocketData::unsafe_arena_set_allocated_a_data(
    ::protobuf::mozilla::net::SocketDataArgs* a_data) {
  if (GetArenaForAllocation() == nullptr) {
    delete reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_data_);
  }
  _impl_.a_data_ = a_data;
  if (a_data) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  // @@protoc_insertion_point(field_unsafe_arena_set_allocated:protobuf.mozilla.net.PSocketProcess.Reply_GetSocketData.a_data)
}
inline ::protobuf::mozilla::net::SocketDataArgs* Reply_GetSocketData::release_a_data() {
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::net::SocketDataArgs* temp = _impl_.a_data_;
  _impl_.a_data_ = nullptr;
#ifdef PROTOBUF_FORCE_COPY_IN_RELEASE
  auto* old =  reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(temp);
  temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  if (GetArenaForAllocation() == nullptr) { delete old; }
#else  // PROTOBUF_FORCE_COPY_IN_RELEASE
  if (GetArenaForAllocation() != nullptr) {
    temp = ::PROTOBUF_NAMESPACE_ID::internal::DuplicateIfNonNull(temp);
  }
#endif  // !PROTOBUF_FORCE_COPY_IN_RELEASE
  return temp;
}
inline ::protobuf::mozilla::net::SocketDataArgs* Reply_GetSocketData::unsafe_arena_release_a_data() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Reply_GetSocketData.a_data)
  _impl_._has_bits_[0] &= ~0x00000001u;
  ::protobuf::mozilla::net::SocketDataArgs* temp = _impl_.a_data_;
  _impl_.a_data_ = nullptr;
  return temp;
}
inline ::protobuf::mozilla::net::SocketDataArgs* Reply_GetSocketData::_internal_mutable_a_data() {
  _impl_._has_bits_[0] |= 0x00000001u;
  if (_impl_.a_data_ == nullptr) {
    auto* p = CreateMaybeMessage<::protobuf::mozilla::net::SocketDataArgs>(GetArenaForAllocation());
    _impl_.a_data_ = p;
  }
  return _impl_.a_data_;
}
inline ::protobuf::mozilla::net::SocketDataArgs* Reply_GetSocketData::mutable_a_data() {
  ::protobuf::mozilla::net::SocketDataArgs* _msg = _internal_mutable_a_data();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Reply_GetSocketData.a_data)
  return _msg;
}
inline void Reply_GetSocketData::set_allocated_a_data(::protobuf::mozilla::net::SocketDataArgs* a_data) {
  ::PROTOBUF_NAMESPACE_ID::Arena* message_arena = GetArenaForAllocation();
  if (message_arena == nullptr) {
    delete reinterpret_cast< ::PROTOBUF_NAMESPACE_ID::MessageLite*>(_impl_.a_data_);
  }
  if (a_data) {
    ::PROTOBUF_NAMESPACE_ID::Arena* submessage_arena =
        ::PROTOBUF_NAMESPACE_ID::Arena::InternalGetOwningArena(
                reinterpret_cast<::PROTOBUF_NAMESPACE_ID::MessageLite*>(a_data));
    if (message_arena != submessage_arena) {
      a_data = ::PROTOBUF_NAMESPACE_ID::internal::GetOwnedMessage(
          message_arena, a_data, submessage_arena);
    }
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_data_ = a_data;
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Reply_GetSocketData.a_data)
}

// -------------------------------------------------------------------

// Msg_GetDNSCacheEntries

// -------------------------------------------------------------------

