toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// Reply_GetDNSCacheEntries

// repeated bytes a_entries = 1;
inline int Reply_GetDNSCacheEntries::_internal_a_entries_size() const {
  return _impl_.a_entries_.size();
}
inline int Reply_GetDNSCacheEntries::a_entries_size() const {
  return _internal_a_entries_size();
}
inline void Reply_GetDNSCacheEntries::clear_a_entries() {
  _impl_.a_entries_.Clear();
}
inline std::string* Reply_GetDNSCacheEntries::add_a_entries() {
  std::string* _s = _internal_add_a_entries();
  // @@protoc_insertion_point(field_add_mutable:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries.a_entries)
  return _s;
}
inline const std::string& Reply_GetDNSCacheEntries::_internal_a_entries(int index) const {
  return _impl_.a_entries_.Get(index);
}
inline const std::string& Reply_GetDNSCacheEntries::a_entries(int index) const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries.a_entries)
  return _internal_a_entries(index);
}
inline std::string* Reply_GetDNSCacheEntries::mutable_a_entries(int index) {
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries.a_entries)
  return _impl_.a_entries_.Mutable(index);
}
inline void Reply_GetDNSCacheEntries::set_a_entries(int index, const std::string& value) {
  _impl_.a_entries_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries.a_entries)
}
inline void Reply_GetDNSCacheEntries::set_a_entries(int index, std::string&& value) {
  _impl_.a_entries_.Mutable(index)->assign(std::move(value));
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries.a_entries)
}
inline void Reply_GetDNSCacheEntries::set_a_entries(int index, const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_entries_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set_char:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries.a_entries)
}
inline void Reply_GetDNSCacheEntries::set_a_entries(int index, const void* value, size_t size) {
  _impl_.a_entries_.Mutable(index)->assign(
    reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_set_pointer:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries.a_entries)
}
inline std::string* Reply_GetDNSCacheEntries::_internal_add_a_entries() {
  return _impl_.a_entries_.Add();
}
inline void Reply_GetDNSCacheEntries::add_a_entries(const std::string& value) {
  _impl_.a_entries_.Add()->assign(value);
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries.a_entries)
}
inline void Reply_GetDNSCacheEntries::add_a_entries(std::string&& value) {
  _impl_.a_entries_.Add(std::move(value));
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries.a_entries)
}
inline void Reply_GetDNSCacheEntries::add_a_entries(const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_entries_.Add()->assign(value);
  // @@protoc_insertion_point(field_add_char:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries.a_entries)
}
inline void Reply_GetDNSCacheEntries::add_a_entries(const void* value, size_t size) {
  _impl_.a_entries_.Add()->assign(reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_add_pointer:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries.a_entries)
}
inline const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>&
Reply_GetDNSCacheEntries::a_entries() const {
  // @@protoc_insertion_point(field_list:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries.a_entries)
  return _impl_.a_entries_;
}
inline ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>*
Reply_GetDNSCacheEntries::mutable_a_entries() {
  // @@protoc_insertion_point(field_mutable_list:protobuf.mozilla.net.PSocketProcess.Reply_GetDNSCacheEntries.a_entries)
  return &_impl_.a_entries_;
}

// -------------------------------------------------------------------

// Msg_GetHttpConnectionData

// -------------------------------------------------------------------

// Reply_GetHttpConnectionData

// repeated bytes a_params = 1;
inline int Reply_GetHttpConnectionData::_internal_a_params_size() const {
  return _impl_.a_params_.size();
}
inline int Reply_GetHttpConnectionData::a_params_size() const {
  return _internal_a_params_size();
}
inline void Reply_GetHttpConnectionData::clear_a_params() {
  _impl_.a_params_.Clear();
}
inline std::string* Reply_GetHttpConnectionData::add_a_params() {
  std::string* _s = _internal_add_a_params();
  // @@protoc_insertion_point(field_add_mutable:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData.a_params)
  return _s;
}
inline const std::string& Reply_GetHttpConnectionData::_internal_a_params(int index) const {
  return _impl_.a_params_.Get(index);
}
inline const std::string& Reply_GetHttpConnectionData::a_params(int index) const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData.a_params)
  return _internal_a_params(index);
}
inline std::string* Reply_GetHttpConnectionData::mutable_a_params(int index) {
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData.a_params)
  return _impl_.a_params_.Mutable(index);
}
inline void Reply_GetHttpConnectionData::set_a_params(int index, const std::string& value) {
  _impl_.a_params_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData.a_params)
}
inline void Reply_GetHttpConnectionData::set_a_params(int index, std::string&& value) {
  _impl_.a_params_.Mutable(index)->assign(std::move(value));
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData.a_params)
}
inline void Reply_GetHttpConnectionData::set_a_params(int index, const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_params_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set_char:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData.a_params)
}
inline void Reply_GetHttpConnectionData::set_a_params(int index, const void* value, size_t size) {
  _impl_.a_params_.Mutable(index)->assign(
    reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_set_pointer:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData.a_params)
}
inline std::string* Reply_GetHttpConnectionData::_internal_add_a_params() {
  return _impl_.a_params_.Add();
}
inline void Reply_GetHttpConnectionData::add_a_params(const std::string& value) {
  _impl_.a_params_.Add()->assign(value);
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData.a_params)
}
inline void Reply_GetHttpConnectionData::add_a_params(std::string&& value) {
  _impl_.a_params_.Add(std::move(value));
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData.a_params)
}
inline void Reply_GetHttpConnectionData::add_a_params(const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_params_.Add()->assign(value);
  // @@protoc_insertion_point(field_add_char:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData.a_params)
}
inline void Reply_GetHttpConnectionData::add_a_params(const void* value, size_t size) {
  _impl_.a_params_.Add()->assign(reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_add_pointer:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData.a_params)
}
inline const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>&
Reply_GetHttpConnectionData::a_params() const {
  // @@protoc_insertion_point(field_list:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData.a_params)
  return _impl_.a_params_;
}
inline ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>*
Reply_GetHttpConnectionData::mutable_a_params() {
  // @@protoc_insertion_point(field_mutable_list:protobuf.mozilla.net.PSocketProcess.Reply_GetHttpConnectionData.a_params)
  return &_impl_.a_params_;
}

// -------------------------------------------------------------------

// Msg_GetHttp3ConnectionStatsData

// -------------------------------------------------------------------

// Reply_GetHttp3ConnectionStatsData

