toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// repeated bytes a_params = 1;
inline int Reply_GetHttp3ConnectionStatsData::_internal_a_params_size() const {
  return _impl_.a_params_.size();
}
inline int Reply_GetHttp3ConnectionStatsData::a_params_size() const {
  return _internal_a_params_size();
}
inline void Reply_GetHttp3ConnectionStatsData::clear_a_params() {
  _impl_.a_params_.Clear();
}
inline std::string* Reply_GetHttp3ConnectionStatsData::add_a_params() {
  std::string* _s = _internal_add_a_params();
  // @@protoc_insertion_point(field_add_mutable:protobuf.mozilla.net.PSocketProcess.Reply_GetHttp3ConnectionStatsData.a_params)
  return _s;
}
inline const std::string& Reply_GetHttp3ConnectionStatsData::_internal_a_params(int index) const {
  return _impl_.a_params_.Get(index);
}
inline const std::string& Reply_GetHttp3ConnectionStatsData::a_params(int index) const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Reply_GetHttp3ConnectionStatsData.a_params)
  return _internal_a_params(index);
}
inline std::string* Reply_GetHttp3ConnectionStatsData::mutable_a_params(int index) {
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Reply_GetHttp3ConnectionStatsData.a_params)
  return _impl_.a_params_.Mutable(index);
}
inline void Reply_GetHttp3ConnectionStatsData::set_a_params(int index, const std::string& value) {
  _impl_.a_params_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Reply_GetHttp3ConnectionStatsData.a_params)
}
inline void Reply_GetHttp3ConnectionStatsData::set_a_params(int index, std::string&& value) {
  _impl_.a_params_.Mutable(index)->assign(std::move(value));
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Reply_GetHttp3ConnectionStatsData.a_params)
}
inline void Reply_GetHttp3ConnectionStatsData::set_a_params(int index, const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_params_.Mutable(index)->assign(value);
  // @@protoc_insertion_point(field_set_char:protobuf.mozilla.net.PSocketProcess.Reply_GetHttp3ConnectionStatsData.a_params)
}
inline void Reply_GetHttp3ConnectionStatsData::set_a_params(int index, const void* value, size_t size) {
  _impl_.a_params_.Mutable(index)->assign(
    reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_set_pointer:protobuf.mozilla.net.PSocketProcess.Reply_GetHttp3ConnectionStatsData.a_params)
}
inline std::string* Reply_GetHttp3ConnectionStatsData::_internal_add_a_params() {
  return _impl_.a_params_.Add();
}
inline void Reply_GetHttp3ConnectionStatsData::add_a_params(const std::string& value) {
  _impl_.a_params_.Add()->assign(value);
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Reply_GetHttp3ConnectionStatsData.a_params)
}
inline void Reply_GetHttp3ConnectionStatsData::add_a_params(std::string&& value) {
  _impl_.a_params_.Add(std::move(value));
  // @@protoc_insertion_point(field_add:protobuf.mozilla.net.PSocketProcess.Reply_GetHttp3ConnectionStatsData.a_params)
}
inline void Reply_GetHttp3ConnectionStatsData::add_a_params(const char* value) {
  GOOGLE_DCHECK(value != nullptr);
  _impl_.a_params_.Add()->assign(value);
  // @@protoc_insertion_point(field_add_char:protobuf.mozilla.net.PSocketProcess.Reply_GetHttp3ConnectionStatsData.a_params)
}
inline void Reply_GetHttp3ConnectionStatsData::add_a_params(const void* value, size_t size) {
  _impl_.a_params_.Add()->assign(reinterpret_cast<const char*>(value), size);
  // @@protoc_insertion_point(field_add_pointer:protobuf.mozilla.net.PSocketProcess.Reply_GetHttp3ConnectionStatsData.a_params)
}
inline const ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>&
Reply_GetHttp3ConnectionStatsData::a_params() const {
  // @@protoc_insertion_point(field_list:protobuf.mozilla.net.PSocketProcess.Reply_GetHttp3ConnectionStatsData.a_params)
  return _impl_.a_params_;
}
inline ::PROTOBUF_NAMESPACE_ID::RepeatedPtrField<std::string>*
Reply_GetHttp3ConnectionStatsData::mutable_a_params() {
  // @@protoc_insertion_point(field_mutable_list:protobuf.mozilla.net.PSocketProcess.Reply_GetHttp3ConnectionStatsData.a_params)
  return &_impl_.a_params_;
}

// -------------------------------------------------------------------

// Msg_InitProxyAutoConfigChild

// required bytes a_endpoint = 1;
inline bool Msg_InitProxyAutoConfigChild::_internal_has_a_endpoint() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_InitProxyAutoConfigChild::has_a_endpoint() const {
  return _internal_has_a_endpoint();
}
inline void Msg_InitProxyAutoConfigChild::clear_a_endpoint() {
  _impl_.a_endpoint_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_InitProxyAutoConfigChild::a_endpoint() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_InitProxyAutoConfigChild.a_endpoint)
  return _internal_a_endpoint();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_InitProxyAutoConfigChild::set_a_endpoint(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_endpoint_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_InitProxyAutoConfigChild.a_endpoint)
}
inline std::string* Msg_InitProxyAutoConfigChild::mutable_a_endpoint() {
  std::string* _s = _internal_mutable_a_endpoint();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_InitProxyAutoConfigChild.a_endpoint)
  return _s;
}
inline const std::string& Msg_InitProxyAutoConfigChild::_internal_a_endpoint() const {
  return _impl_.a_endpoint_.Get();
}
inline void Msg_InitProxyAutoConfigChild::_internal_set_a_endpoint(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_endpoint_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_InitProxyAutoConfigChild::_internal_mutable_a_endpoint() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_endpoint_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_InitProxyAutoConfigChild::release_a_endpoint() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_InitProxyAutoConfigChild.a_endpoint)
  if (!_internal_has_a_endpoint()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_endpoint_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_endpoint_.IsDefault()) {
    _impl_.a_endpoint_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_InitProxyAutoConfigChild::set_allocated_a_endpoint(std::string* a_endpoint) {
  if (a_endpoint != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_endpoint_.SetAllocated(a_endpoint, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_endpoint_.IsDefault()) {
    _impl_.a_endpoint_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_InitProxyAutoConfigChild.a_endpoint)
}

// -------------------------------------------------------------------

// Msg_RecheckIPConnectivity

// -------------------------------------------------------------------

// Msg_RecheckDNS

// -------------------------------------------------------------------

// Msg_FlushFOGData

// -------------------------------------------------------------------

// Reply_FlushFOGData

// required bytes a_buf = 1;
inline bool Reply_FlushFOGData::_internal_has_a_buf() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Reply_FlushFOGData::has_a_buf() const {
  return _internal_has_a_buf();
}
inline void Reply_FlushFOGData::clear_a_buf() {
  _impl_.a_buf_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Reply_FlushFOGData::a_buf() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Reply_FlushFOGData.a_buf)
  return _internal_a_buf();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Reply_FlushFOGData::set_a_buf(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_buf_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Reply_FlushFOGData.a_buf)
}
inline std::string* Reply_FlushFOGData::mutable_a_buf() {
  std::string* _s = _internal_mutable_a_buf();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Reply_FlushFOGData.a_buf)
  return _s;
}
inline const std::string& Reply_FlushFOGData::_internal_a_buf() const {
  return _impl_.a_buf_.Get();
}
inline void Reply_FlushFOGData::_internal_set_a_buf(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_buf_.Set(value, GetArenaForAllocation());
}
inline std::string* Reply_FlushFOGData::_internal_mutable_a_buf() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_buf_.Mutable(GetArenaForAllocation());
}
inline std::string* Reply_FlushFOGData::release_a_buf() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Reply_FlushFOGData.a_buf)
  if (!_internal_has_a_buf()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_buf_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_buf_.IsDefault()) {
    _impl_.a_buf_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Reply_FlushFOGData::set_allocated_a_buf(std::string* a_buf) {
  if (a_buf != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_buf_.SetAllocated(a_buf, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_buf_.IsDefault()) {
    _impl_.a_buf_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Reply_FlushFOGData.a_buf)
}

// -------------------------------------------------------------------

// Msg_TestTriggerMetrics

// -------------------------------------------------------------------

// Reply_TestTriggerMetrics

