toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// required bool a_unused = 1;
inline bool Reply_TestTriggerMetrics::_internal_has_a_unused() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Reply_TestTriggerMetrics::has_a_unused() const {
  return _internal_has_a_unused();
}
inline void Reply_TestTriggerMetrics::clear_a_unused() {
  _impl_.a_unused_ = false;
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline bool Reply_TestTriggerMetrics::_internal_a_unused() const {
  return _impl_.a_unused_;
}
inline bool Reply_TestTriggerMetrics::a_unused() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Reply_TestTriggerMetrics.a_unused)
  return _internal_a_unused();
}
inline void Reply_TestTriggerMetrics::_internal_set_a_unused(bool value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_unused_ = value;
}
inline void Reply_TestTriggerMetrics::set_a_unused(bool value) {
  _internal_set_a_unused(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Reply_TestTriggerMetrics.a_unused)
}

// -------------------------------------------------------------------

// Msg_AddNetAddrOverride

// required bytes a_aFrom = 1;
inline bool Msg_AddNetAddrOverride::_internal_has_a_afrom() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_AddNetAddrOverride::has_a_afrom() const {
  return _internal_has_a_afrom();
}
inline void Msg_AddNetAddrOverride::clear_a_afrom() {
  _impl_.a_afrom_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_AddNetAddrOverride::a_afrom() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_AddNetAddrOverride.a_aFrom)
  return _internal_a_afrom();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_AddNetAddrOverride::set_a_afrom(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_afrom_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_AddNetAddrOverride.a_aFrom)
}
inline std::string* Msg_AddNetAddrOverride::mutable_a_afrom() {
  std::string* _s = _internal_mutable_a_afrom();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_AddNetAddrOverride.a_aFrom)
  return _s;
}
inline const std::string& Msg_AddNetAddrOverride::_internal_a_afrom() const {
  return _impl_.a_afrom_.Get();
}
inline void Msg_AddNetAddrOverride::_internal_set_a_afrom(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_afrom_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_AddNetAddrOverride::_internal_mutable_a_afrom() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_afrom_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_AddNetAddrOverride::release_a_afrom() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_AddNetAddrOverride.a_aFrom)
  if (!_internal_has_a_afrom()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_afrom_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_afrom_.IsDefault()) {
    _impl_.a_afrom_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_AddNetAddrOverride::set_allocated_a_afrom(std::string* a_afrom) {
  if (a_afrom != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_afrom_.SetAllocated(a_afrom, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_afrom_.IsDefault()) {
    _impl_.a_afrom_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_AddNetAddrOverride.a_aFrom)
}

// required bytes a_aTo = 2;
inline bool Msg_AddNetAddrOverride::_internal_has_a_ato() const {
  bool value = (_impl_._has_bits_[0] & 0x00000002u) != 0;
  return value;
}
inline bool Msg_AddNetAddrOverride::has_a_ato() const {
  return _internal_has_a_ato();
}
inline void Msg_AddNetAddrOverride::clear_a_ato() {
  _impl_.a_ato_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000002u;
}
inline const std::string& Msg_AddNetAddrOverride::a_ato() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_AddNetAddrOverride.a_aTo)
  return _internal_a_ato();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_AddNetAddrOverride::set_a_ato(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000002u;
 _impl_.a_ato_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_AddNetAddrOverride.a_aTo)
}
inline std::string* Msg_AddNetAddrOverride::mutable_a_ato() {
  std::string* _s = _internal_mutable_a_ato();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_AddNetAddrOverride.a_aTo)
  return _s;
}
inline const std::string& Msg_AddNetAddrOverride::_internal_a_ato() const {
  return _impl_.a_ato_.Get();
}
inline void Msg_AddNetAddrOverride::_internal_set_a_ato(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000002u;
  _impl_.a_ato_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_AddNetAddrOverride::_internal_mutable_a_ato() {
  _impl_._has_bits_[0] |= 0x00000002u;
  return _impl_.a_ato_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_AddNetAddrOverride::release_a_ato() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_AddNetAddrOverride.a_aTo)
  if (!_internal_has_a_ato()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000002u;
  auto* p = _impl_.a_ato_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_ato_.IsDefault()) {
    _impl_.a_ato_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_AddNetAddrOverride::set_allocated_a_ato(std::string* a_ato) {
  if (a_ato != nullptr) {
    _impl_._has_bits_[0] |= 0x00000002u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000002u;
  }
  _impl_.a_ato_.SetAllocated(a_ato, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_ato_.IsDefault()) {
    _impl_.a_ato_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_AddNetAddrOverride.a_aTo)
}

// -------------------------------------------------------------------

// Msg_ClearNetAddrOverrides

// -------------------------------------------------------------------

// Msg_PDNSRequestConstructor

// required string a_hostName = 1;
inline bool Msg_PDNSRequestConstructor::_internal_has_a_hostname() const {
  bool value = (_impl_._has_bits_[0] & 0x00000001u) != 0;
  return value;
}
inline bool Msg_PDNSRequestConstructor::has_a_hostname() const {
  return _internal_has_a_hostname();
}
inline void Msg_PDNSRequestConstructor::clear_a_hostname() {
  _impl_.a_hostname_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000001u;
}
inline const std::string& Msg_PDNSRequestConstructor::a_hostname() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_hostName)
  return _internal_a_hostname();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_PDNSRequestConstructor::set_a_hostname(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000001u;
 _impl_.a_hostname_.Set(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_hostName)
}
inline std::string* Msg_PDNSRequestConstructor::mutable_a_hostname() {
  std::string* _s = _internal_mutable_a_hostname();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_hostName)
  return _s;
}
inline const std::string& Msg_PDNSRequestConstructor::_internal_a_hostname() const {
  return _impl_.a_hostname_.Get();
}
inline void Msg_PDNSRequestConstructor::_internal_set_a_hostname(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000001u;
  _impl_.a_hostname_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_PDNSRequestConstructor::_internal_mutable_a_hostname() {
  _impl_._has_bits_[0] |= 0x00000001u;
  return _impl_.a_hostname_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_PDNSRequestConstructor::release_a_hostname() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_hostName)
  if (!_internal_has_a_hostname()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000001u;
  auto* p = _impl_.a_hostname_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_hostname_.IsDefault()) {
    _impl_.a_hostname_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_PDNSRequestConstructor::set_allocated_a_hostname(std::string* a_hostname) {
  if (a_hostname != nullptr) {
    _impl_._has_bits_[0] |= 0x00000001u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000001u;
  }
  _impl_.a_hostname_.SetAllocated(a_hostname, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_hostname_.IsDefault()) {
    _impl_.a_hostname_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_hostName)
}

