toomium/firefox/tools/fuzzing/ipc/protobuf/PSocketProcess.pb.h
// required string a_trrServer = 2;
inline bool Msg_PDNSRequestConstructor::_internal_has_a_trrserver() const {
  bool value = (_impl_._has_bits_[0] & 0x00000002u) != 0;
  return value;
}
inline bool Msg_PDNSRequestConstructor::has_a_trrserver() const {
  return _internal_has_a_trrserver();
}
inline void Msg_PDNSRequestConstructor::clear_a_trrserver() {
  _impl_.a_trrserver_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000002u;
}
inline const std::string& Msg_PDNSRequestConstructor::a_trrserver() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_trrServer)
  return _internal_a_trrserver();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_PDNSRequestConstructor::set_a_trrserver(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000002u;
 _impl_.a_trrserver_.Set(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_trrServer)
}
inline std::string* Msg_PDNSRequestConstructor::mutable_a_trrserver() {
  std::string* _s = _internal_mutable_a_trrserver();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_trrServer)
  return _s;
}
inline const std::string& Msg_PDNSRequestConstructor::_internal_a_trrserver() const {
  return _impl_.a_trrserver_.Get();
}
inline void Msg_PDNSRequestConstructor::_internal_set_a_trrserver(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000002u;
  _impl_.a_trrserver_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_PDNSRequestConstructor::_internal_mutable_a_trrserver() {
  _impl_._has_bits_[0] |= 0x00000002u;
  return _impl_.a_trrserver_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_PDNSRequestConstructor::release_a_trrserver() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_trrServer)
  if (!_internal_has_a_trrserver()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000002u;
  auto* p = _impl_.a_trrserver_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_trrserver_.IsDefault()) {
    _impl_.a_trrserver_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_PDNSRequestConstructor::set_allocated_a_trrserver(std::string* a_trrserver) {
  if (a_trrserver != nullptr) {
    _impl_._has_bits_[0] |= 0x00000002u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000002u;
  }
  _impl_.a_trrserver_.SetAllocated(a_trrserver, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_trrserver_.IsDefault()) {
    _impl_.a_trrserver_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_trrServer)
}

// required sint32 a_port = 3;
inline bool Msg_PDNSRequestConstructor::_internal_has_a_port() const {
  bool value = (_impl_._has_bits_[0] & 0x00000010u) != 0;
  return value;
}
inline bool Msg_PDNSRequestConstructor::has_a_port() const {
  return _internal_has_a_port();
}
inline void Msg_PDNSRequestConstructor::clear_a_port() {
  _impl_.a_port_ = 0;
  _impl_._has_bits_[0] &= ~0x00000010u;
}
inline int32_t Msg_PDNSRequestConstructor::_internal_a_port() const {
  return _impl_.a_port_;
}
inline int32_t Msg_PDNSRequestConstructor::a_port() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_port)
  return _internal_a_port();
}
inline void Msg_PDNSRequestConstructor::_internal_set_a_port(int32_t value) {
  _impl_._has_bits_[0] |= 0x00000010u;
  _impl_.a_port_ = value;
}
inline void Msg_PDNSRequestConstructor::set_a_port(int32_t value) {
  _internal_set_a_port(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_port)
}

// required uint32 a_type = 4;
inline bool Msg_PDNSRequestConstructor::_internal_has_a_type() const {
  bool value = (_impl_._has_bits_[0] & 0x00000020u) != 0;
  return value;
}
inline bool Msg_PDNSRequestConstructor::has_a_type() const {
  return _internal_has_a_type();
}
inline void Msg_PDNSRequestConstructor::clear_a_type() {
  _impl_.a_type_ = 0u;
  _impl_._has_bits_[0] &= ~0x00000020u;
}
inline uint32_t Msg_PDNSRequestConstructor::_internal_a_type() const {
  return _impl_.a_type_;
}
inline uint32_t Msg_PDNSRequestConstructor::a_type() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_type)
  return _internal_a_type();
}
inline void Msg_PDNSRequestConstructor::_internal_set_a_type(uint32_t value) {
  _impl_._has_bits_[0] |= 0x00000020u;
  _impl_.a_type_ = value;
}
inline void Msg_PDNSRequestConstructor::set_a_type(uint32_t value) {
  _internal_set_a_type(value);
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_type)
}

// required bytes a_originAttributes = 5;
inline bool Msg_PDNSRequestConstructor::_internal_has_a_originattributes() const {
  bool value = (_impl_._has_bits_[0] & 0x00000004u) != 0;
  return value;
}
inline bool Msg_PDNSRequestConstructor::has_a_originattributes() const {
  return _internal_has_a_originattributes();
}
inline void Msg_PDNSRequestConstructor::clear_a_originattributes() {
  _impl_.a_originattributes_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000004u;
}
inline const std::string& Msg_PDNSRequestConstructor::a_originattributes() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_originAttributes)
  return _internal_a_originattributes();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_PDNSRequestConstructor::set_a_originattributes(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000004u;
 _impl_.a_originattributes_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_originAttributes)
}
inline std::string* Msg_PDNSRequestConstructor::mutable_a_originattributes() {
  std::string* _s = _internal_mutable_a_originattributes();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_originAttributes)
  return _s;
}
inline const std::string& Msg_PDNSRequestConstructor::_internal_a_originattributes() const {
  return _impl_.a_originattributes_.Get();
}
inline void Msg_PDNSRequestConstructor::_internal_set_a_originattributes(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000004u;
  _impl_.a_originattributes_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_PDNSRequestConstructor::_internal_mutable_a_originattributes() {
  _impl_._has_bits_[0] |= 0x00000004u;
  return _impl_.a_originattributes_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_PDNSRequestConstructor::release_a_originattributes() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_originAttributes)
  if (!_internal_has_a_originattributes()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000004u;
  auto* p = _impl_.a_originattributes_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_originattributes_.IsDefault()) {
    _impl_.a_originattributes_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_PDNSRequestConstructor::set_allocated_a_originattributes(std::string* a_originattributes) {
  if (a_originattributes != nullptr) {
    _impl_._has_bits_[0] |= 0x00000004u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000004u;
  }
  _impl_.a_originattributes_.SetAllocated(a_originattributes, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_originattributes_.IsDefault()) {
    _impl_.a_originattributes_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_originAttributes)
}

// required bytes a_flags = 6;
inline bool Msg_PDNSRequestConstructor::_internal_has_a_flags() const {
  bool value = (_impl_._has_bits_[0] & 0x00000008u) != 0;
  return value;
}
inline bool Msg_PDNSRequestConstructor::has_a_flags() const {
  return _internal_has_a_flags();
}
inline void Msg_PDNSRequestConstructor::clear_a_flags() {
  _impl_.a_flags_.ClearToEmpty();
  _impl_._has_bits_[0] &= ~0x00000008u;
}
inline const std::string& Msg_PDNSRequestConstructor::a_flags() const {
  // @@protoc_insertion_point(field_get:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_flags)
  return _internal_a_flags();
}
template <typename ArgT0, typename... ArgT>
inline PROTOBUF_ALWAYS_INLINE
void Msg_PDNSRequestConstructor::set_a_flags(ArgT0&& arg0, ArgT... args) {
 _impl_._has_bits_[0] |= 0x00000008u;
 _impl_.a_flags_.SetBytes(static_cast<ArgT0 &&>(arg0), args..., GetArenaForAllocation());
  // @@protoc_insertion_point(field_set:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_flags)
}
inline std::string* Msg_PDNSRequestConstructor::mutable_a_flags() {
  std::string* _s = _internal_mutable_a_flags();
  // @@protoc_insertion_point(field_mutable:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_flags)
  return _s;
}
inline const std::string& Msg_PDNSRequestConstructor::_internal_a_flags() const {
  return _impl_.a_flags_.Get();
}
inline void Msg_PDNSRequestConstructor::_internal_set_a_flags(const std::string& value) {
  _impl_._has_bits_[0] |= 0x00000008u;
  _impl_.a_flags_.Set(value, GetArenaForAllocation());
}
inline std::string* Msg_PDNSRequestConstructor::_internal_mutable_a_flags() {
  _impl_._has_bits_[0] |= 0x00000008u;
  return _impl_.a_flags_.Mutable(GetArenaForAllocation());
}
inline std::string* Msg_PDNSRequestConstructor::release_a_flags() {
  // @@protoc_insertion_point(field_release:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_flags)
  if (!_internal_has_a_flags()) {
    return nullptr;
  }
  _impl_._has_bits_[0] &= ~0x00000008u;
  auto* p = _impl_.a_flags_.Release();
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_flags_.IsDefault()) {
    _impl_.a_flags_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  return p;
}
inline void Msg_PDNSRequestConstructor::set_allocated_a_flags(std::string* a_flags) {
  if (a_flags != nullptr) {
    _impl_._has_bits_[0] |= 0x00000008u;
  } else {
    _impl_._has_bits_[0] &= ~0x00000008u;
  }
  _impl_.a_flags_.SetAllocated(a_flags, GetArenaForAllocation());
#ifdef PROTOBUF_FORCE_COPY_DEFAULT_STRING
  if (_impl_.a_flags_.IsDefault()) {
    _impl_.a_flags_.Set("", GetArenaForAllocation());
  }
#endif // PROTOBUF_FORCE_COPY_DEFAULT_STRING
  // @@protoc_insertion_point(field_set_allocated:protobuf.mozilla.net.PSocketProcess.Msg_PDNSRequestConstructor.a_flags)
}

// -------------------------------------------------------------------

// Reply_PDNSRequestConstructor

